{"comment_0": "\nHello Everyone,\n\r\nThis song is not about drugs. It is an insult to this great band to imply that MJK is only speaking about drugs, drug use, and drug effects. This song is really about Quantum Physics. At the begining of the song MJK quotes Bill Hicks. He says\n\r\n\"Today a young man on acid realized that all matter is merely energy condensed to a slow vibration. That we are all one consciousness experiencing itself subjectively. There is no such thing as death, life is only a dream, and we are the imagination of ourselves. Here's Tom with the weather.\"\n\r\nThis one paragraph is what the whole song is about. He is talking about the Big Bang. When all atoms in the universe where ONE atom. Then the big bang happened and created the universe. That is why we are one consciousness, because we are all one (originated from the same thing). By the way the man that realized this theory did not do acid, it was Albert Einstein. (Theory of Relativity)\n\r\n\"Prying open my third eye\" is not a reference to MJK's penis or his Peyote eye. The third eye in Buddhism is your consciousness. Your third eye allows you to see reality as it is, not the reality that we think exist, which is the reality we create in our minds that we see, taste, touch, etc.\n\r\nWe have all heard MJK refer to life as an illusion. Life is what our brain tells us what we are experiencing. When the Big Bang happened it not only created you, me, this planet, our universe, but it created all the parallel universes. Which means that if we are all one because we originated from the BIG Bang. Then that means that we all exist in everywhere, including other dimensions and so on. So, right now at this very moment you exist multiple times throughout space. That is why life is an illusion.\n\r\n\"So good to see you\r\nI've missed you so much\r\nSo glad it's over\r\nI've missed you so much\r\nCame out to watch you play\r\nWhy are you running?\"\n\r\nThis is also related to Buddhist philosophy. The principle of Reincarnation. He says the statement above several times throughout the song. The first, he is talking about visiting himself as a child. The second is him visiting himself from another life time. According to Buddhist Philosophy, when you die you do not take with you anything but your Karma. This means your physical appearance, your knowledge, your car, all of these thing do not come with you to your next life. That is why MJK says this,\"\n\r\nI stick my hand into his shadow\r\nTo pull the pieces from the sand\r\nWhich I attempt to reassemble\r\nTo see just who I might have been\r\nI do not recognize the vessel,\r\nBut the eyes seem so familiar\r\nLike phosphorescent desert buttons\r\nSinging one familiar song.\"\n\r\nYou can see who you were in past lives, who you will be, and even who others were. If you just open your third eye. \n\r\nIf you have time go to youtube.com and type in \"what the bleep do we know part 1.\" Watch the whole movie. It will thoroughly explain all of these concepts. We all see what we want to see. Just read through the comments, and see how people distorted MJK's lyrics because they wanted MJK to say what they wanted to hear.\n\r\nIf you are an avid TOOL fan, or if you know anything about TOOL. You know that they don't clearly state the point. Not because they are trying to be tricky. They want you to think for yourself. All of our lives we have been fed distorted information. We have been given answers to all our problems with the click of the search button on Google. TOOL doesn't want to give you the answers. They want you to find them on your own. Be pro-active learn the truth because you won't in school. Our governments, our dogmatic religions ( such as christianity, Islam, Jeudaism), and our teachers don't want you to know the truth because you begin to question. When you begin to question you begin to ask. When you ask then you act. This leads to revolution.\n\r\nI hope this comment helped open your third eye.\n\r\n\"Liberate yourself and you will liberate the world\"\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI think that this song is about someone(loved one maybe child) who has passed away. And the narrator is dreaming of their \"face again\" and In the beginning Bill Hicks is talking about how drugs can help. So this person has turned into a drug addict and is trying to stop but is brought back \"Down that hole and back again\"\r\nThis person is high to feel better and believes that he sees the loved one \"playing\" so he \"came out to watch you play\"  but him/her starts running away and the addict starts to cry and screams \"why are you running away!\"\r\nThird eye is a metaphor for finally realizing what is true/reality so the addict is \"Prying open my third eye\" so see reality and that he/she Is gone but thanks the drugs for letting the addict see the loved one once again.  And realizes that this entire time he's been \"Chasing a trail of smoke\" meaning the loved one was never there but he did it for \"reason.\" The reason is because he loved him/her. \n\n\n", "comment_2": "\nThe entire Aenima album is about Carl Jung's theory of Analytical Psychology.  This song is about the final layer, the center of it all:  The Self.  Just like \"Forty-six & 2\" was about crossing through layer 3, the Shadow.  And you'll hear Maynard mention \"Crucifying the ego\" in a few songs.  Eulogy was about \"Ego death\" which must happen to progress forward.  Ego is layer 2.  Look it up, I promise you it's true.  Maynard formed the word \"Aenima\" by combining \"anima\" (layer 4, the feminine soul within a man, and oppositely animus is the masculine soul within a woman, and it's said that the qualities of one's one anima/animus reflect that of the lover they should have.  It's kind of the basis for the concept of soul mates)  and enema.  Aenima is meant to mean \"A cleansing of the soul.\"  \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nLike phosphorescent desert buttons \r\nSinging one familiar song... \n\n\r\nWhen he sings these two lines he is refering to the use of the halucinagenic peyote cactus that grows in parts of northern Mexico and the SW United States.  After eating between 4 and 8 \"buttons\" from the inside of the peyote cactus, one can experience visions including animals who speak.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nrow row row your boat,\r\ngently down a stream.\r\nmerrily, merrily, merrily,\r\nlife is but a dream\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nHmm.. I posted a comment on this song a long time ago, it seems to have been deleted.\r\nThis song is the grand finale of Ã\u0086nema. This collaberation of every meaning behind the other songs in Ã\u0086nema is a metaphoric sea of beauty. It reminds us to keep an omnispective view of everything, to question and contemplate existance, to not believe blindly, amongst other things.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis song is a record of Maynard's own experiences with the third eye.  The third eye follows a theory that there are subtleties that can't be seen with our normal eyes.  It's suggested in the lyrics that Maynard follows this path like a religion, and that he induces his visions with drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nWow Aragorn, your pretty dumb huh? Rappo was intelligently making clear the connection of the nursery rhyme \"Row Row Row Your Boat\" to the line \"A child's rhyme stuck in my head, it said life is but a dream\" before you take shots at people, think of what you're saying.  \t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nthis one ain't all that hard... prying open my third eye.  that phrase is heavily emphasized in the song.  assuming you understand the third eye reference and that the song has obvious references to both lsd and mescaline, try looking at the song as being less about the drugs and more about the rather unpleasant image of someone trying to pry their own eyes open with the drugs being the crowbar.  hope someone finds this useful.  peace.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\n\"Dreaming of that face again.\nIt's bright and blue and shimmering.\nGrinning wide\nAnd comforting me with it's three warm and wild eyes.\"\n\nIF ANYONE HAS EVER DONE LSD YOU WILL KNOW ABOUT THIS. EVEN CERTAIN PRACTICES OF BUDDHISM REQUIRE STEREOSCOPIC VISUALISATION...I.E., CONVERGING YOUR LINE OF SIGHT UNTIL YOU SEE THREE EYES. (TRY THIS IN THE MIRROR). DIFFERENT EXPERIENCES FOR DIFFERENT PEOPLE...BUT CAN BE HOLOGRAPHIC-LIKE, LIKE YOU ARE IN A DIFFERENT DIMENSION. THERE ARE MANY SONGS ABOUT THIS.\n\n\"On my back and tumbling\nDown that hole and back again\nRising up\nAnd wiping the webs and the dew from my withered eye.\nIn, out, in.., out, in, out\nA child's rhyme stuck in my head.\nIt said that life is but a dream.\"\n\nREFERENCES TO ALICE AND WONDERLAND (DOWN THE RABBIT HOLE). ENLIGHTENMENT. RE-ACTIVATION. \n\n\"I've spent so many years in question\nTo find I've known this all along.\n\"So good to see you.\nI've missed you so much.\nSo glad it's over.\nI've missed you so much\nCame out to watch you play.\nWhy are you running?\"\"\n\nTRICKY ONE.\n\n\"Shrouding all the ground around me\nIs this holy crow above me.\nBlack as holes within a memory\nAnd blue as our new second sun.\"\n\nLOTS  OF MUSICAL REFERENCES TO \"OUT OF THE BLACK, AND INTO THE BLUE\". AGAIN, ENLIGHTENMENT?\n\n\nI stick my hand into his shadow\nTo pull the pieces from the sand.\nWhich I attempt to reassemble\nTo see just who I might have been.\nI do not recognize the vessel,\nBut the eyes seem so familiar.\nLike phosphorescent desert buttons\"\n\nREMEMBERING YOUR PAST...WHO YOU WERE. PAST LIFE REGRESSION. ALSO SEE \"46+2 BY TOOL\". DESERT BUTTONS, LOL!\n\n\"Singing one familiar song\n\"So good to see you.\nI've missed you so much.\nSo glad it's over.\nI've missed you so much.\nCame out to watch you play.\nWhy are you running away?\"\"\n\nMY BEST GUESS: ITS HARD TO STAY IN THIS PLACE. VAGUE MEMORIES OF DISTANT PAST, LONG BEFORE THIS LIFE.\n\nPrying open my third eye.\nSo good to see you once again.\nI thought that you were hiding.\nAnd you thought that I had run away.\nChasing the tail of dogma.\nI opened my eye and there we were.\nSo good to see you once again\nI thought that you were hiding from me.\nAnd you thought that I had run away.\nChasing a trail of smoke and reason.\nPrying open my third eye.\n\nOPENING OF THIRD EYE. SPIRITUAL ENLIGHTENMENT. HE'S RUNNING AWAY FROM \"HIMSELF\" NO ONE ELSE. DOGMA IS THE ENEMY OF ENLIGHTENMENT.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\n\"Came out to watch you play \r\nWhy are you running away?\"\n\r\nthen\n\r\n\"I thought that you were hiding \r\nAnd you thought that I had run away\"\n\r\nI just thought I'd comment on this strangely written part.  It's MJK writing about himself, as two people.  One him thought that the other him was hiding, and the \"hiding\" him thought the other was running away (\"Chasing the tail of Dogma\").  As small as it is, most people probably don't recognize this, but it's a beautifully written piece.  Good times, good times...\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nthis song is obiviously about drugs opening up his eyes, all three of them, and showing him everything that he couldnt see with out them, maybe not maynard, but someone.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis song is about finding yourself through the use of your \"third eye\"\n\r\nwe all have the outer and inner consciousness's that exist simultaneously, your inner conscious commonly referred to as an inner child or the subconscious or the dreaming personality is older than your outer consciousness, Your outer consciousness is the one we activly think with otherwise known as \"the stream of consciousness\"\n\r\nAs we grow up in social restrictions our higher or outer conscious trains itself and becomes conditioned to ignore refute dispute or otherwise render invalid MANY HUNDREDS OF THOUSANDS of possibilities. For instance one must not even consider talking back to your parents in certain manners when we are young, otherwise your gonna suffer severe consequences that result in pain. In our teenage years we begin to rebel against this specific type of conditioning, but subtler conditioning remains for the most part for us to function adequetly in society. A good exmple of those who loose or never develop the subtler conditionings are people with social dis-functions, people who are hard to get along with, are strange, or have neroutic tendencies...\n\r\ni know that seems a bit deep, but its to illustrate that there is a subconscious existence that continualy thinks about ALL possibilities that we shut off from ourselves in the intrest of effeciently handling our buisness and day to day survival, a human cannot afford to debate the meritts of EVERY footfall in intrest of actualy getting to his destination. What eventualy happens is we atrophy great portions of our links into our subconsciousness, many of them are no longer needed and may even hinder our abilities to function well, and many others are inadvertantly disabled that may very well be powerfull or fulfilling aspects of our innate inteligence.\n\r\nThis song is about the process of reuniting ourselves with our inner and subconscious layers that have been \"put in the closet\" for so long. At birth we are fully united with our subconscious, and only after years of training and social conditioning do we become seperated from our more primal urges and understandings... the second being more important.\n\r\nUrges are for the most part counter-productive or in-effeficient, however our subconscious understandings are beyond ingenious, the human subconscious s able to calculate the trajectories of hundreds of objects simultaneously just by seeing them, think about a kid playing football, most of his reactions are not higher thought, they are instant calculations done by \"instinct\", but its trained instinct isnt it? the kid manages for the most part to adhere to the rules of the game and to calculate the positions of 24 players and those players sizes weights speeds and physical stances, hes able to simultaneously tragect potential avenues of acomplishment, potential avenues of failure, the weight speed size and trajectory of the ball, and to carry out his mission in the best way possible, as in fighting for every inch.\n\r\nNow even if this kid sucks at football and gets sacked, his mind still does more advanced calculations from inherent understandings in less than a second than a trained physicist could calculate in several years of paperwork. \n\r\nNow imagine if you could tap into and unify your conscious and trained higher thoughts with that kind of instinctual comprehension?\n\r\nthis is the gateway represented by the third eye, the attempt to understand that which we already inherently understand, and to learn about things we already know, but to know them consciously. It is the ultimate unification of thought, and those who are able to do it can bend a huge amount of thought towards the world, hence the reference to all matter being nothing more than energy coalasced into a slow wave. Which by the way is pretty much true, matter and energy are the same thing in different states.\n\r\nThe process of opening up your mind to your inner mind is difficult to do, hence the \"Prying open my third eye\", ever try to remember something that was on the tip of your tounge? something you should just know of the top of your mind but your stuck? imagine that feeling but even more distinct, that is PRYING open your third eye, attempting to rip the shroud that clouds your ability to tap into that which you already have. This is also why there are so many references to dream like states and images, getting in to that true level of awareness is forcing ourseleves to awake from a sleep we arent aware were in, or should i say daze?\n\r\nDrugs have a long history in both recreational and medicinal (psychiatric) uses as being capable of spanning the divide between sub conscious and higher thought for limited amounts of time, although artificialy. The ability of tapping into that same connection without drugs is an even greater accomplishment, which i think this song is something of an attempt to discribe.\n\r\nRemember even the smartest of human beings only use 10% of their brain throughout their ENTIRE lives, and only a small portion of that is actualy your thought stream, if you could use all of your brain, well, youd be able to comprehend the depths of the universe MUCH more adeptly. This song is kind of an instruction guide for finding a true and lasting connection to your inner inteligence that cant be substituted by the briefs connections provided by drugs.\n\r\nThe references to rebuilding himself and to finding his hiding self all go back to the same connection... and if you look at many other tool songs, they are about the same tapping into yourself, lateralus and schism come to mind.... but those are less explicit and subject to opinion... this one is almost blatant.\n\r\nlook at this bit closely\n\r\n\"So good to see you once again \r\nI thought that you were hiding from me \r\nAnd you thought that I had run away \r\nChasing a trail of smoke and reason \"\n\r\nHis higher thought is of course greatly happy to find the lost connection to his inner mind, eespecialy after searching for so long for what seemed to be hidden, and in finding it, he realizes its always been there, and that he had left it, hence the subconscious's feeling that he had run away.\n\r\nin leteralus this topic comes up again \"over thinking, over analyzing, seperates the body from the mind\"... \n\r\nAn incredibly powerfull song that taps some deeper spots in me... maynard is certainly a genius, if only for his ability to reach through all the crap and try to tap into how and what we realy are beneath all the bullshit (training).\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI think the beginning of the song and the \"third eye\" could refer to the hindu god krishna. Krishna is blue and shines and has a third eye that allows him to see what other humans can not. So maybe by prying open his third eye maynard tries to see farther and deeper than what normal people can see.\n\r\nAlso maynard sometimes paints himself blue before concerts.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nthis would be the greatest song to do shrooms to, not that ive done it, but like imagine what u would see and feel on drugs listening to this song, actually i dont think drugs make the song ne better but it sure does add to the experience. The song is obviously about not seeing things for waht ur normal eyes see things ass like the best example for this song is if uve ever seen those drawings that if u look at it one way u see like an old man and if u look at it anohter u see a young girl, like the song is about opening ur mind to seeing the both side of things\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nyou don't need drugs to figure out this song ... just think outside a box... better yet, run as far away from the box as you can.. and stay there.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI always believed it was about him being molested as a child....Grinning wide\r\nAnd comforting me with his three warm and wild eyes. meaning his eyes and his penis eye when it is erect\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nIm glad someone out there really gets this song.  You would be amazed at all the wacky ideas about this song.\r\nThe song is about his relationship with PEYOTE.  I knwo this to be fact,  I been there many times, and a few with him.  WE don't mess around with the lower 50 weak strains.  We go strait to the heart of the matter.  HUIRICUTA.\r\nAlso, in case you dont know  Wings of Marie 1 and 2 added with vente tres makes a massive super song.  You will need some simple mixing program to put them together.  Its worth it\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nOk guys this is it.  The song is about his relationship with mescalito.  The entity that lives in the peyote cactus.  The conversations within the song are being held with mescalito.  Peyote buttons dont need infared glasses to be found because they glow...thats ridiculous. They are phosphorescent....like japanese beetles.  They glow of irridecence.\n\r\nIf anyone wants the real information on tool just ask me.  I have been friend with Maynard since98.  I have many trips with him, and really just want to set you all strait.  That Ketamine comment... what a joke.  Maynard hates that phoney crap.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nAIM, you might be rightâ\u0080¦â\u0080¦but the lyrics may also have nothing to do with drugs. Granted, drugs can helpâ\u0080¦..sometimes, but it is usually a temporary thing....a peek through the third eye for a relatively short period of time. Maybe that is why TOOL is saying PRY instead of just OPEN. Drugs will get it done, but in a forceful and, in my experience, temporary way. I know many younger people won't want to hear it, but I urge you to spend 5 nights in a row meditating and writing down what happened after each session. You will be seeing shit just as crazy as your last boomer tripâ\u0080¦.and before you know it, you can do this ANYWHERE, ANYTIME. To truly open the anja chakra would be something more powerful/significant than a temporary peek...I would imagine some of the members of TOOL have managed to keep that eye open, at least partially, most of the time. I believe this partly because of their association with Alex Grey. If you don't what Alex Grey is about....check out his art. You will understand from his paintingâ\u0080¦.and it will be familiar to you if you have explored higher forms of consciousness....drug-induced or otherwise. I love TOOL on many levels and this is one of my favorite songs. What I get from it isâ\u0080¦.a slow awakening to other possibilities...to higher states of consciousness...to a truth that has always been there, but ignored by most. Whatever caused this ignorance is another story...I am sure there is blame deserved in many directions. It is a constant struggle to remain \"in tune\" with this higher realityâ\u0080¦.the forces of society, physiology, etcâ\u0080¦ pull you OUT instead of IN. Just like trying to hold on to a brittle theta thread with wonderful/terrifying hypnagogic images flashing through your skull on the borderline of sleepâ\u0080¦.or floating in an isolation tankâ\u0080¦..you go in and outâ\u0080¦.inâ\u0080¦.FREAK OUTâ\u0080¦..outâ\u0080¦.inâ\u0080¦.EXCITEDâ\u0080¦..out. With practice, you stay \"IN\" longer. This would allow for some real learningâ\u0080¦.realization. What is really real? Then comes recognitionâ\u0080¦.you remember things but don't know whyâ\u0080¦.situations like, \"I have done this before\"â\u0080¦.or \"I have been here before\". The important part of this song for me is a message of returnâ\u0080¦of being reunited with a piece of us that we have lost or maybe even forsakenâ\u0080¦.this piece IS us and only now, having recognized it again, do we feel the deepâ\u0080¦deep sorrow of having lost it in the first place. It is great sorrow with equal joy. We must take better care this time around.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nSounds some thing like this in the beginning   \"Think for yourself\r\nQuestion authority\n\r\nThroughout human history, as our species has faced the frightening,\r\nterrorizing fact that we do not know who we are, or where we are going in\r\nthis ocean of chaos, it has been the authorities, the political, the\r\nreligious, the educational authorities who attempted to comfort us by\r\ngiving us order, rules, regulations, informing, forming in our minds their\r\nview of reality. To think for yourself you must question authority and\r\nlearn how to put yourself in a state of vulnerable, open-mindedness;\r\nchaotic, confused, vulnerability to inform yourself.\n\r\nThink for yourself.\r\nQuestion authority.\" \t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nidk it seems to be just a song about the experience one has when they see the world through \"new eyes\" or a \"third eye\" when they're high and strung out. The world looks like a different place when you''re high...\n\nOf course the meaning could be much deeper than that\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nThe message I get from Tool's music, in particular 'Third Eye' and 'Lost Keys (Blame Hofman)' and 'Rosetta Stoned' is that drugs (or meditation for those of us who shy away from drugs) are the key to opening our mind, they lead us to epiphanies of salvation and the key to existence, enlightenment, but because of the nature of these psychedelic drugs, memory impairment, we can't remember these epiphanies. Maybe that's the curse of humanity, that through drugs or meditation we can discover the key to our existence and all of life, but we're still not allowed to know. \"Don't know, won't know, don't know, won't know, don't know, won't know.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI'm going to have to disagree with popular opinion here and say that this song IS about psychedelic drugs, at least in part. What it's NOT about is encouraging drug use.\n\nIn interviews, Maynard has said that while psychedelic drugs can help some people find inspiration and deeper meaning, this is only true if they prepare properly, have respect for the drug, and give themselves time to process the experience. He has said he knows dozens of people who used them improperly and, while not necessarily going insane, never quite came back from their trip. They spend so much time in their minds that they forget how to DO. \n\nThe problem is that psychedelic drugs allow people to achieve these states of consciousness without doing the work. Force them, in fact. Again, all of this is coming from interviews with Maynard.\n\nI believe this song is, at least in part, about this.\n\nI think the choice of words \"Prying open my third eye\" is very relevant.\n\nHe did not say \"Opening up my third eye.\" He did not say \"Peering out of my third eye.\" He said PRYING. This is a very violent choice of words for what should be a meditative, contemplative experience.\n\nMaynard has also always stressed the importance of the music itself, not just the lyrics, and this song has a very particular tone. It is perhaps their most dissonant song. It has a very aggressive, disturbing feel to it. The feel of this song is nothing like the calm, contemplative state of mind of, say, a Buddhist monk.\n\nIf we interpret the people that he meets as his \"other selves,\" I think that the line \"Why are you running?\" is again very relevant. This seems to imply that the narrator has no control of what is going on. In fact, everything about the song implies a state of confusion and unknowing.\n\nThe narrator hasn't opened his third eye, he's PRIED it open, and he's seeing things he can't understand.\n\nAgain, in interviews, Maynard has pointed out that psychedelic drugs allow people to achieve psychedelic states without doing the work to get there. I think that's what this song is about. In that sense, it's a lot like Rosetta Stoned.\n\nAs an aside, I don't think I'd be living up to my principles if I didn't add this:\n\n* Quantum mechanics is not about universal consciousness experiencing itself subjectively. There is nothing subjective about quantum mechanics, and it has nothing to do with consciousness. It is cold hard math. There is randomness in it, yes, but it's not subjective. Believe whatever spiritual/mystical beliefs you want, but don't conflate them with quantum mechanics. They are very different. I'm not being closed minded here. It's okay to believe in things that aren't or can't be proven. It's just not okay to call that science. *\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis song, Just like 46&2, Jimmy, and Pushit are all about Maynard and Jimmy aka \"11\" becoming 1.Jimmy is frozen in time, waiting for maynard to free him by coming home(facing his past and changing) the whole cd is about change. Mostly Maynard.\n\nDreaming of that face again\nIt's bright and blue and shimmering\nGrinning wide\nAnd comforting me with it's three warm and wild eyes\n\nMaynard is seeing himself as whole. remember what he looked like during the Aenima tour? he was painted in bright blue, symbolizing him as whole for the first time. other times he was painted half blue half white symbolizing he is not whole. its all there. its all about maynard\n\nonce you understand that \"Jimmy\" is about maynard becoming 1 with jimmy the rest will make sense. Jimmy is 11, he is the child Maynard is referring to at the start of 46&2. \"so good to see you once again\" about jimmy. \"came out to watch you play, why are you running away\" thats about Jimmy \"I thought you were hiding from me, you thought I had run away\" thats about Jimmy. This is all in Maynards Third Eye. its actually all pretty straight forward hes just such a good writer it took me 17 years to figure it out.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nit's cool, since it features some rantings from one of the greatest human beings to tread the earth (and is sadly no longer with us) Bill Hicks. He's amazing, and if you have any interest in social and political commentary and the smartest comedy you'll ever hear, check him out. \t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThis has be my favourite ever song. Period. I just now redownloaded it after having my albums stolen it and remember just how much I love it. There's not much to add to the above comments other than to add that Maynard is a god, and this song, all 13 minutes 45 second odd of it, is as good as it gets for me, and it's a high realm to aim for. \t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nPersonally I like the Salival version of this song better .... Dont know why?  Except that its got more feeling to it.  Wait I actually like the live versions of all their songs better.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nthis is such a meaningful song. maynard speaks about finding yourself and opening your mind to endless possibilities. \t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nheh me and my friends have a little joke to this song...not to be offensive or anything, but we were high one day and thought...maybe its a follow up to prison sex. See some people call their anus their \"brown eye\" so that would be like your third eye. and then they were talking about the grinning blue man. and the planet URANUS is blue and prying open the third eye is getting your ass fucked!  And then the molester came out to see him play like baseball and he is running away from him when all that guy wanted was some love. And if you read the lyrics on toolshed it says \"IN...OUT...IN...OUT\"...but we were fucked up when we were just joking around...this interpretation is not to be taken serious. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nyou actually remember what you talk about when you stoned man???? anyway a great song\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nthis is the greatest song i think Tool has wrote next to lateralus. The song is 13 minutes of pure music heaven. Going to one part where the song is so punding you almost get a headache, to silence..... where all you hear is a little tap on the bass drum. The lyrics now are incredible I know its alll about doing acid and opening your third eye. But i think thats cool. He has some amazing trips. But anyway the song is incredible. oh yea by the way when listening to this song high its almost like going to heaven.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI'd think it'd be something more along the lines of DMT, Salvia, or Peyote(like OceanOfChaos said).\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI just found something out: DMT is present in the brain, more specifically, the pineal gland. Also known as the \"Ajna Chakra\" in Hindu belief and also known as your \"Third Eye\".\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nTool have been compared to prog rock bands and certainly you could say that their albums are like concept albums, and some themes are present in several of their albums. If you look at the artwork for Opiate, Aenima and Lateralus they all have eyes. This is also like the video of Parabola and the first thing you see when you go onto their \"Dissectional\" website is a third eye appearing. I just read the message posted by Makoe, who has said basically the same thing, but didn't mention the other albums. I don't really know what this song is about in detail, I think that Madson guy/girl? should contribute, if you've read any of his postings I'm sure you'll agree he is exceptionally knowledgable, in fact I wouldn't be overly supried if he is Maynard. By the way, I'm soon going to get the circle of eyes that is on the Lateralus CD tatooed on my lower back.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nketamine.  look at the jacket, the dissociative anesthetic part.  oddly enough the answer's right there...\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nLike phosphorescent desert buttons \n\r\ninteresting point about this lyric. The reason why he refers to peyote as phosphorescent desert buttons is because if you look at it through some sort of heat vision (googles or whatever) they all glow a slightly different shade.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nThis is Tool's Stairway to heaven.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nThe third eye chakra is supposed to be the gateway between the imagination and the real world.  I tried using it a few times after listening to this song.  Supposedly, everyone has different visions.  The way I used it was just staring into my eye in the mirror.  I started to go \"IN and OUT\" of the vision, and my face looked like it was withered and had spots of dew on it.  I didn't see a face that was blue, but it was shimmering at times.  This song goes with the rest of the album I believe.  He talks to his spiritual self.  When he's yelling, \"Prying open my third eye\" it reminds me of a beating heart.  Everytime his heart beats, his sprititual self tries to open his third eye, so he knows that the beating heart is only for the real world, and if he sees the spritual world, he will understand that the beating world is not important, or not as important as he thought it was, so he stops thinking about the beating heart, except then it comes back again and again.  He could have kept on repeating \"prying open my third eye\" because until death, I believe you can keep going in and out of the spritual world.  \t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nOk, I just got the live cd.  Believe me, the LIVE version is much better. \n\r\nHe talks about questioning authority before the song, and doesn't talk about drugs at all.  Questioning authority is a part of imagination, or perhaps imagination is a part of questioning authority.  Thinking for yourself, opening your third eye, the spiritual eye, that is not influenced by the real world.  \t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nIn the live version his intro speech is actually a quote by Timothy Leary.\n\nleary.com/\n\n\n", "comment_41": "\ni love the intro speech on the salival version \"think for yourself, question authority.\" how hypocritical is that!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\ni really can agree with bonzo on how its like tools stairway to heaven.....just like how everyone remembers the line \"and shes buying a stairway to heaven\" i compare it to \"prying open my third eye\"....i have to agree with everyones points about the song....and the live version on salival kicks major ass...\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nAt about 7:51 in the studio version of the song, there is some weird sound or someone says something.  Its right before Maynard says \"shrouding all the ground around me\" Does anyone know what it is?\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nBY \"question authority\" i dont think that it means ask them questions for information, but ask them why they are doing what they are doing.  Thinking for yourself by not letting them speak for you, question the way that the authorities go about doing their business\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nyeah but the hypocracy comes from the fact tha it is a demand. \"think for yourself...\" u know the rest\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nThe Third-Eye is acid and how he see's everything differntly.  And when Maynard is saying \"prying open my third-eye'' he is talking about having a flash back, also you gotta know it is about acid because they talk about it at the first of the song.  I really love this song by far one of my favorites.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nThe third eye is your psychic awareness center \"I do not recognize the vessel, \r\nBut the eyes seem so familiar \r\nLike phosphorescent desert buttons \r\nSinging one familiar song... \"\r\nMany third eye excercises use a mirror where you look at yourself and after a while your face will begin to look different except for your eyes this is not because of drugs either. If you have any belief in your third eye and pyschic powers you will truly connect with this song and read up on this stuff.\n\n\n", "comment_48": "\nYo, Phreek, you have to look past the drug thing.  Tool may seem like it's about drugs on the surface, but it's actually so much more.  You just have to look deeper in the music and deeper in yourself.  But, i can't help but wonder if in the lines \"I am just a worthless liar. I am just an imbecile. I will only complicate you. Trust in me and fall as well. I will find a center in you. I will chew it up and leave, I will work to elevate you just enough to bring you down.\" from Sober, he is actually talking about himself?  Or maybe in these lines he is actually talking about drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nI know what Deathsaurus5000 is saying is fact.  The term \"Third Eye\" is a reference to the central point of every persons psychic abilities.  I don't know a lot about the Hindu teachings but I do know that the \"Third Eye\" is also a major part in Daoisim.  They refer to the eye being located in-between and slightly up from your 2 normal eyes.  Training and excersise gradually opens (not literally) the eye.  The more open the eye, the easier to see receive \"inner light\" and see inside yourself and possibly see \"visions.\"  But in the Daoism teachings they believe that \"visions\" and other such psychic abilities that are seen while opening your eye are evil and should be discarded and not pursued.  They use the eye to circulate Qi (pronounced \"Chi\") throughout the body.  I learned this from a 48 hours course I took with my SiFu while I was in Shaolin Wushu training.  Just some thoughts I figured I'd share about what I know about the \"Third Eye.\"  I'm not exactly sure what Manyard was referring to, but I'm most definitely certain that he is not referring to drugs.  Like most Tool songs, the \"drug\" meaning is just the facade that covers the deeper meaning.  Just some brain food for you guys to think about.  Peace.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nHoly shit OceanOfChaos-----is that shit fucking real? Talking animals? \t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nok... Tool were big into Bill Hicks and to the best of my knowledge, I believe they were friends with him.  Hicks was a big acid/shroom user, and in many of his speeches he talked about his Third Eye which you get from these drugs.  The Third Eye gives you a whole new outlook on things, or so I've heard.  The Daoism and other Third Eye references may be correct, but I am pretty sure on this one.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nmmm, peyote... HE HE HE he he eh eheh eheh ehhe ehh eheh ehhe he heheh eh eh ehe he ehhe eh ehhe  hehe heh ehe eh ehe. \n\r\nSORRRRYYYYYYY\r\nMaaynard is a geeeennnnnnniiiiiuuuuuuusssssss!!!!!!\r\nI however was NOT chasing the tail of DOGMA! I am not hiding any more, My eyes are OPENNN!\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nDammit! There's a scratch on my Aenima cd right on Third Eye at about 2:30 mins! It fucks the whole thing up and now I'm upset!\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nfirst i would just liek to mention.. Rappo.. u are an imbosil... u are retarted.. do that crap on a backstreet boys song, but never ever put such crap on somethin as sacred as a tool song....\r\nnow that that is out of my system.. the meaning:\r\nthe song is about opening up your mind.. by saying prying open my third eye.. he means that he is opening his mind.\r\n i have no clue  what the other lyrics mean.. im still pissed at rippo for being a the dipshit that he is...\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nThis is by far the best 13 minutes of music ever. This song is the capstone for a PHENOMENAL album. After the need for change (Stinkfist, Eulogy, H) and the desire to change (46 & 2) and all the catalysts for change (Hooker, jimmy, Pushit) and the change itself (Aenima), the earth is cleansed by (-)ions and everything is washed away, and we are left to pry open our third eye and evolve.\r\nAs a christian, I can totally identify with the idea that you cant evolve your thinking or change yourself until you recognize all the BS clogging up life (Aenima) and you have to purify yourself (ions) before you can change (Third Eye). I love how accessible this album is. Tool doesnt present an agenda one way or the other, all they ask is that you listen with your mind. \t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\ni response to Nobz the noise at like 7:51 is a drum beat really quiet, and i like your comment about the \"row your boat\" thing...good call\n\n\n", "comment_57": "\nbut could anyone tell me if maynard is actually saying something at about 3:52 on Ã\u0086nima and 4:11 on Salival?maybe he's just yelling gibberish?\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nThe third eye is a wiccan/pagan concept too, its like he baptism for pagans. I dont really remember everything about it, something to do with navigation and protection. I had my third eye opened by my one friend when i was a wiccan.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\n\"Isn't acid fun?\" Thats what Maynard is saying\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nthis song is absolutly brilliant.someone (too lazy to look for it) said that it was him talking in third person.i think that he is finding himself but having some kind of difficulty...\n\r\nShrouding all the ground around me \r\nIs this holy crow above me \r\nBlack as holes within a memory \r\nAnd blue as our new second sun \n\r\nthis is a very metaphoracle verse that ive had trouble understanding.i think he speaks of his eye somehow...mabye he has blue eyes and the black part is the pupil.the third eye does see everything. \n\r\nI stick my hand into his shadow \r\nTo pull the pieces from the sand \r\nWhich I attempt to reassemble \r\nTo see just who I might have been \n\r\nbob frissall said that birth 'is a VERY traumatic expirience and that all the fright in birth changes people.it causes permenent fear in breathing,and in air is prana and without it we die and the fear of breathing blocks the flow or prana' so i think the lack of prana weakins people and changes them.\n\r\nI do not recognize the vessel, \r\nBut the eyes seem so familiar \r\nLike phosphorescent desert buttons \n\r\nthis is a tricky one...i think he is trying to remember himself or remember somthing....i cant tell...but they seem familier because its said that the subconscious mind records and remembers everthing...that causes de ja vu(sorry bad spelling)...\n\r\n\"I opened my eye and there we were\"\n\r\nonce you open your third eye all becomes apperent and you become reunited with yourself...\n\n\r\nplease note that i have read this information and just making a connection...it may sound weird but ive looked into it and it makes sence...no nevermind it doesnt really \n\n\n\n", "comment_61": "\ni love the opening of the third eye on the dissectional website i just saw it and it just did something to me\n\n\n", "comment_62": "\nTool was like a rich dessert.  A proper amount was perfect, but getting addicted to anything is bad.\r\nIt's great they got people to start thinking.  But I think they knew when they started that it would be time to call it quits when they could sell us a shirt that says \"Think For Yourself.\"\n\r\nI'm not saying that they are going to quit, but I think they should, and let us figure out why.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nI think they should come out with a crappy album to piss people off and then come out with a much, much, much better album.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI think that they should come out with a crappy album to piss people off and then make their last one as great or better than Lateralus\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nbetter,never. theres no better musical stuff than lateralus\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nIf you put this song to 7 minutes 50, and turn up the volume really loud, you can hear something, which, to me sounds like \"Wash out\", but its not, its the nearest English translation i can come up with.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\ni like the little snippets before the real song starts\r\nespecially the part where the guy goes:\r\n\"today a young man on acid realized that all matter is merely energy condensed into a slow vibration, we are all one conciussness....................And now heres Tom with the weather\" that to me is genius, its like hes goes off on some rant thats like totally wierd and just makes you think, then he just nonchalantly passes it off by going \"and heres Tom with the weather\" i love it\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nOK. Cuban711. You're right. This song isn't about drugs, but drugs play an important role. This song is basically about what the title says. The third eye. The third eye is \"the eye of psychic vision\". He speaks of beeing able to see and comprehend things, otherwise not possible. However. To be able to use his third eye he needs to use the effect of drugs as a gateway to access his third eye. Hence \"Prying open my third eye.\" \n\r\nThis picture here shows the Anja Chacra. Notice how it looks like an eye. \n\nkheper.net/topics/chakras/…\n\n\n", "comment_69": "\nIm surprised noone has touched on what im about to say yet....i read half way through the comments and noone said this...maybe im wrong.\n\r\nI think the song is about sex...\n\r\n\"Dreaming of that face again \r\nIt's bright and blue and shimmering \r\nGrinning wide \r\nAnd comforting me with its three warm and wild eyes\" \n\r\ndreaming of that face....thinking about having sex with her again. i dont know what blue is... grinning wide. Anyone who has had sex (or alteast seen female porn) knows that a vagina looks similar to a smile on its side or a mouth. 3 warm eyes....you should know this\n\r\n\"On my back and tumbling \r\nDown that hole and back again \r\nRising up \r\nAnd wiping the webs and the dew from my withered eye\" \n\r\nHes on his back while the girl is on top. The hole represents the female sex organ. he enters and \"rises up\" again which causes him to perspire\n\r\n\"In... Out... In... Out... In... Out...\" \n\r\nKinda obvious...\n\r\n\"A child's rhyme stuck in my head \r\nIt said that life is but a dream \r\nI've spent so many years in question \r\nto find I've known this all along\" \n\r\nHe spent years wondering about sex but finds out it isnt that hard... (too bad its not that true...)\n\r\n\"'So good to see you \r\nI've missed you so much \r\nSo glad it's over \r\nI've missed you so much \r\nCame out to watch you play \r\nWhy are you running?'\" \n\r\nHe is inside the women and cant see his....\n\r\n\"I stick my hand into his shadow \r\nTo pull the pieces from the sand \r\nWhich I attempt to reassemble \r\nTo see just who I might have been\"\n\r\nsticking his hand into the female trying to find the spot.\n\r\n\"I do not recognize the vessel, \r\nBut the eyes seem so familiar \r\nLike phosphorescent desert buttons \r\nSinging one familiar song...\" \n\r\nvessel is commonly a reference to a female sex organ i believe...the spot is slowly changing to pleasure to the lady. \n\r\n\"So good to see you once again \r\nI thought that you were hiding \r\nAnd you thought that I had run away \r\nChasing the tail of dogma \r\nI opened my eye and there we were\" \n\r\nperhaps he is taking advantage of the female and has a question of morality... and he opened his eye and therer they were......they both had their orgasms.\n\r\n\"Prying open my third eye\"\n\r\nDid i mention i thought the third eye was his dick? well the 'third eye' has to open up a little to let out an orgasm.\n\n\n\r\nThis is just a stupid theory i made up. If anything has something to add to some things i couldnt explain by all means post it....\n\n\n", "comment_70": "\nBest fucking song ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nHey vision do you believe in good and evil?  And do you think that having an open third eye is like being able to follow the energy you sense in your life, relying on that to make your decisions for you, because you can see that you are where you're supposed to be?\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nif you have a favorite tool song.. you really don't like tool at all!!\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nWell, I've scanned through all the entries, and the closest anyone's come to my theory is Sysys' comment about sex... This song sounds like child abuse. I don't want to go into too much detail - if you reread it now you might see it that way - but it sounds like the lasting effects of someone who was sexually abused as a child by somebody close to them. And that sux. But it is a great song, and evokes all kinds of emotions. I think Tool are the most genuine band in a long time, and this wasn't just for ratings. Just a theory.\r\n~T~\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nSo how exactly do i open my third eye?\r\nLook into the mirror long and hard at my eyes?\r\nGet some drugs and then try to get back to where they take me?\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nTHIS SONG IS IN MY OPINION -- BY FAR THE BEST SONG EVER WRITTEN!!!!!!!!!!!!!!!! I'VE SEEN TOOL LIVE 2 TIMES AND THEY WERE DEFINETLY BOTH THE BEST CONCERTS I'VE EVER SEEN-- ESPECIALLY THE LAST ONE I SAW WHICH WAS ON HALLOWEEN-- AND THEY PLAYED THIRD EYE!!!!1 IT WAS REALLY AMAZING. BY THE WAY CHECK OUT WWW.FLIGHTFROMWONDER.TK -- THATS MY BAND\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nTHIS SONG IS IN MY OPINION -- BY FAR THE BEST SONG EVER WRITTEN!!!!!!!!!!!!!!!! I'VE SEEN TOOL LIVE 2 TIMES AND THEY WERE DEFINETLY BOTH THE BEST CONCERTS I'VE EVER SEEN-- ESPECIALLY THE LAST ONE I SAW WHICH WAS ON HALLOWEEN-- AND THEY PLAYED THIRD EYE!!!!1 IT WAS REALLY AMAZING. BY THE WAY CHECK OUT WWW.FLIGHTFROMWONDER.TK -- THATS MY BAND\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nTHIS SONG IS IN MY OPINION -- BY FAR THE BEST SONG EVER WRITTEN!!!!!!!!!!!!!!!! I'VE SEEN TOOL LIVE 2 TIMES AND THEY WERE DEFINETLY BOTH THE BEST CONCERTS I'VE EVER SEEN-- ESPECIALLY THE LAST ONE I SAW WHICH WAS ON HALLOWEEN-- AND THEY PLAYED THIRD EYE!!!!1 IT WAS REALLY AMAZING. BY THE WAY CHECK OUT WWW.FLIGHTFROMWONDER.TK -- THATS MY BAND\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nyou open your third eye by taking mushrooms with 2 months of daily anti depressant pills... you will fell good and talk to a lot of people and hear what they have to say, then you will be smacked in the face by your mind opening and explaining how you really feel and then beat the shit out of the people with your mind in words that you got to know so well on the anti depressant pills... THEN finally your third eye will open and give you an oversight on the whole situation and eventually open your mind to a new kind of thinking and interperitation.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nkids kids kids go to this website read up\r\nthis is what tool is talking about\nastralvoyage.com/  there is a section on third eye,   this is by far the weirdest shit iv ever read about, im so curious to try it.  listern to parabol parabola lyrics\r\nand third eyes lyrics.  the piece's fit...  i know they fit. i watched them fall away,  its all about reality.\n\r\nok enuf of that,  i also thing there music leaves such a gap in it, u can create your own meaning it covers such broad.   i think maynard my be into the astral projection shit.   it would explain alot\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nI feel kind of guilty admitting to this, but I listened to Ã\u0086nima in its entirety when I was completely off my face on marijuana, alcohol, and acid. I can't remember all of my \"insights\" into the album and the Four Horsemen's music, but I remember thinking this song is about how we all have a third eye inside us that allows to see things as they really are, and not as the bullshit-cloaked mysteries we see every day. This eye can be opened, it can be utilised, but exactly how one goes about opening it is open to debate. Do we need drugs? Or can Eastern methods such as meditation allow us to see things through our third eye? Regardless of that, I have to agree with everyone who has said this song is a brilliant ending to a brilliant album. Without question one of the most important albums of the 1990s, and a fitting tribute to the late, great Bill Hicks.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nIf you read this song a certain way it almost sounds like he was abducted by aliens who operated on him and enabled him to open up his third eye.  \n\r\n\"On my back and tumbling\r\nDown that hole and back again\"\n\r\nThat could be something like fire in the sky where they pull you up into the ship and your tumling in the air as your being pulled in.\n\r\n\"Shrouding all the ground around me\r\nis this holy crow above me\"\n\r\nThat could be the ship above him.\n\r\n\"I do not recognize the vessel\"\n\r\nPretty self explanatory.  This probably isnt what the song is about but its pretty kick ass if you like aliens!  Grey ones expecially!\n\r\n-Spiral Out-\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nnot that i think this song is neccisarily about drugs but, when you use any sort of drug it opens up, or has affects on different parts of the subconsious mind, and the third eye is the embodyment of the subconsious mind, so drugs open up the third eye to let you see the world how it really is\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nSo the thing is. I'm afraid this song is about psychadelic drug use. The third eye is a refrence to drugs. And also the line \"like phosforescent desert buttons\" is a refrence to peyote. It says in those Don Juan books by Castaneda that when Castaneda was intoxicated with the peyote that the peyote growing all around him became luminous any easy to see. In case you don't know Castaneda's Don Juan books are one of the foremost books on the effects of psychadelic drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nIf you were wondering what the quotes in the biginning were, they are from bill hicks, a comedian maynard based a lot of muisc on. He really truely is an amazing comedian, here are the quotes for you...\n\r\n\"See, I think drugs have done some *good* things for us, I really do.\r\nAnd if you don't believe drugs have done good things for us, do me a \r\nfavor: Go home tonight and take all your albums, all your tapes, and all \r\nyour cd's and burn em'. Cause you konw what? The musicians who've made \r\nall that great music that's enhanced your lives throughout the years...\r\nRRRRRRRRRRRRReal fuckin high on drugs.\"\n\n\r\n\"Today a young man on acid realized that all matter is mearly energy \r\ncondensed into a slow vibration, that we are all one consciousness \r\n[experiencing itself subjectively], there is no such thing death, life is \r\nonly a dream, and we are just an imagination of ourselves. Here's Tom with \r\nthe weather!\"\n\r\n\"It's not a war on drugs, it's a war on personal freedom, that's what it is, \r\nok? Keep that in mind at all times.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nI think that if you're looking for Tool's lyrics to make complete sense without reading between the lines, you'll find yourself not knowing what the hell Maynard's talking about. Their lyrics go so much deeper than what you'd think. \r\n\"A child's rhyme stuck in my head \r\nIt said that life is but a dream \r\nI've spent so many years in question \r\nto find I've known this all along \"\r\nIf you know anything about Maynard and Tool, you know that LSD comes into play. And Third Eye is about just that. \r\n\"Today young men on Acid realize that all matter is merely energy condensed to a slow vibration. That we are all one conciousness experiencing itself subjectively, there is no such thing as death, life is only a dream and we are the imagination of ourselves.\" Also, if you know anything about Bill Hicks then you know he was all for the hallucinagines. Those of you who have never before ate acid, don't even think for a second that you could have any idea what it is like to feel a oneness with the universe as Maynard frequently talks about. Prying open his third eye. Maynard is not a \"stoner\", in fact, the only drug he even recognizes is LSD. \r\n\"A child's rhyme stuck in my head \r\nIt said that life is but a dream \r\nI've spent so many years in question \r\nto find I've known this all along \"\n\r\nIt speaks for itself, once you read deeper into the lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nIve been a Tool/Apc Fan for ages and when I used LSD it made \n\r\nSOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOooooooooooooooooooo much more sense!\n\r\nAll True tool fans must try it!\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nI just did a hallucenogenic drug for my first time last weekend. I know what this song is about now. When you are tripping on psychedelic drugs, your brain interprets what you see as a different reality...a different dimension...a parallel universe. Although it is just your imagination...The same thing goes for this reality. Reality is all a dream, no matter what reality you are in. If you have never done a hallucenogenic drug...try one. You will completely understand what this song is about after you do.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nI think the line\r\n\"Prying open my third eye\"\r\nIs about hallucenogenic use. Meditative practices and excersices can be used to slowly utulize your third eye. But by using these hallucenogens you immedietly begin to have the visions, but only temporarily (Unless you do too much then you can't discern what is \"Reality\" and what is this \"Spiritual Encounter\") so it is like forcing your third eye open to see the real world around you.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nYes, I think this song is related to the death of Bill Hicks. And yes, I think the \"phosphorescent desert buttons\" refers to Mescaline (Peyote).\n\r\n\"Shrouding all the ground around me \r\nIs this holy crow above me \r\nBlack as holes within a memory \r\nAnd blue as our new second sun \r\nI stick my hand into his shadow \r\nTo pull the pieces from the sand \r\nWhich I attempt to reassemble \r\nTo see just who I might have been \r\nI do not recognize the vessel, \r\nBut the eyes seem so familiar \r\nLike phosphorescent desert buttons \r\nSinging one familiar song...\"\n\r\nI do believe this could be an hallucinogenic drug trip. Probably Peyote, LSD, and Psilocybin.\n\r\nOther than that... I really love this song... Especially the ending.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nIt's basically Tool's \"goodbye\" to Bill Hicks. And saying that in following his theory of enlightenment and a shared consciousness, they will be together with him again soon. Or at least when they're stoned, haha.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\n...this song (and album) have driven me insane....\n\n\n\n\n\n\n\r\nbut in a good way...\r\nif thats at all possible..\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nThis is one of the most amazing songs written from the only great band left. Tool is the only band that can stand next to the greats like zepplin, floyd, and rush. a great song from a great band.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nAn interesting point on LSD. Tests have been conducted on people with schizophrenia where they have begin give this acid and tolld to wear a blindfold and left on thier own. They were cured. I havent taken this drug but people who have told me that its like dreaming whilst being awake and the comedown is like a dreamless sleep. This makes me wonder alot about acid and the power of the human mind. I think that we all have the potentail in our m,inds to see great insights without needing acid to bring the subconcious forward into the concious. Maybe our third eye is like our subconcious. This is to me quite a powerfull revelation because of the nature of the subconcious. What is deja vu but a future percieved as the present? Or the realisation of such a premonition?\n\r\nI particularly like the line chasing the tail of DOGma. He is definitley talking about finding himself. Or maybe parts of himself like the subconcious.\n\r\nAll in all i think this song continues well in the theme of evolution and self dicovery that carries itself through aenema. What it means to you is something you'll have to discover for yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\n\"Ive been a Tool/Apc Fan for ages and when I used LSD it made \n\r\nSOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOooooooooooooooooooo much more sense! \n\r\nAll True tool fans must try it! \"\n\r\n*laughs* That is some of the worst advice I have ever heard in my entire life.  Frankly, I'm sure I've done enough acid in some past life to last me hundreds of lifetimes to come.  I can't even smoke pot without experiencing slight schizophrenic symptoms...I will never try lsd, stop telling me to kill myself!\n\r\nBelieve it or not, I don't think that you have to do drugs to understand these lyrics! Like OMG! NO! Call me crazy...\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nThis song is just the beggining to the the spirtual journey, its the last song on aeniema and the birth of lateralus, everything that is said in this song is  something we cant quite understand without being maynard ourselfs, but at the same time we can relate, this song talks a lot about the present, future, and past lives, its his own self discovery which eventually leads to a whole new world of vision, if u really want to go on this little quest he goes on.... LOTS OF MUSHROOMS(O or 2), PIotee is the best...better with tequila so your passed out well it happens... or lsd works to, but lsd is chemical so its not as tradtional at the others... by the end u should no longer be blind....\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nThe great thing about Tools' songs are that they can be interpreted in many ways.  Some are like a musical mood ring, your mood brings out different things in them.\n\r\nAs for my interpretation:\n\r\nFirst off, \"Third Eye.\"  The title itself is of a non-physical feature..your Third Eye is the gateway to the astral, the beyond, alternate levels of conciousness.  During the song you hear the \"Prying open my third eye\" repeated many times.  At the beginning with the Bill Hicks bit, I would say that this ties in the use of drugs as a facilitator (prying open) to placing conciousness elsewhere.  Indeed, drugs can be used for such things.\n\r\nHowever, right after the Bill Hicks part, you hear the flowing white noise.  That is a binaural beat.  You put a tone in one ear, and a slightly different tone in the other ear, then the two halves of your brain are trying to listen to two different tones, which is difficult to do, and ultimately, they will work together to generate a third sound to your mind, which depending on the sounds and how it's done, can cause your brainwaves to change.  Commonly you have Alpha, Beta, Delta, Theta, with Alpha being alert/totally awake, Theta being deep deep sleep.  The idea is to use binaural beats to induce Delta/Theta levels of brainwaves while maintaining some form of conciousness...think of it like having a dream and you know you are dreaming.\n\r\nAnyways, onto the meat of the song.\n\r\n\"Dreaming of that face again, it's bright and blue and shimmering. Grinning wide...\"\n\r\nTo me that describes a non-phsyical entity, possibly someone deceased, but more likely someone that was known of before being born, or your higher self.\n\r\n\"A child's rhyme stuck in my head.  It said that life is but a dream.  I've spent so many years in question to find I've known this all along.\"\n\r\nThe guy who posted Row row row your boat wins.  But the lyrics speak for themselves here.  Life is but a dream.  It isn't the beginning or the end.  \"That's life.\"\n\r\nAnd then you have in the quotes, meaning someone else is saying it?\n\r\n\"\"So good to see you \r\nI've missed you so much \r\nSo glad it's over \r\nI've missed you so much \r\nCame out to watch you play \r\nWhy are you running?\" \"\n\r\nFor me, hearing that tears away every last problem in existance.  It's beautiful.  Someone on the other side, waiting for us \"...glad it's over\" \"came out to watch you play\" and then \"why are you running?\" which I would guess is the fading back to being alive.\n\r\n\"So good to see you once again \r\nI thought that you were hiding \r\nAnd you thought that I had run away \r\nChasing the tail of dogma \r\nI opened my eye and there we were \"\n\r\nVolumes spoken in just lines.  He (figurative guy singing the song) was looking and couldn't find him, they (bright blue shimmering face) were looking for us and thought we had fallen to the life of this world, to religion, to being fed a diet of control.  But not so..\n\r\n\"And you thought that I had run away \r\nChasing a trail of smoke and reason \"\n\r\nSmoke and reason?  Chasing something which you think should be right (reason) but yet is not a real thing to chase (smoke).  Superb.\n\r\nOne of my favorite songs.\n\r\nFor more about the afterlife, visit: afterlife-knowledge.com\n\n\n", "comment_97": "\nLook, I was perfectly happy reading all your brilliant definitions until someone mentioned talking animals. Now, I cower in fear. TALKING ANIMALS! That's fuckin scary! I'm never doing drugs. lol\n\n\r\nBut as for my take, I think it is about a person who uses drugs to \"open his third eye\", which is sort of like letting him in on all the answers and secrets of life that mankind has pondered for all eternity. And he finds that life is merely a dream.\n\r\nBut thats just my take\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nok, most of you people seem to think that to see the truth you need the aid of a narcotic. its been my experience that drugs make you see what isnt there as opposed to what is. all you have to do to see the truth is open your fucking eyes. although, today there is so many conflicting versions of the truth (weapons of mass destruction, children overboard etc) that it takes  closer scrutiny to see the actual truth. what better way to see with more depth & detail than with an extra eye (metaphore for indipendant thought & common sence). to me at least this song is imploring us to get up & pry open our third eye. to think for ourselves & not succumb to blindly accepting what we've been told. this song, to me at least, is all about waking the fuck up & seing what is happening in the world around us.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nThis is probably my favorite song, ever. And Tool is without a doubt the best band today. I would give anything to see this song played live. On Salival, this and Pushit are major standouts. I love the beginning with the tribal drum beats, and the nightmarish, screeching guitar. It builds up so much tension, and you're just sitting there listening to it in awe, but also like a kid who can't control himself. I've always wanted to take some kind of hallucinogen and just sit there and take this song in. I know I would be on cloud 9.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nLOL @ This is Tool's Stairway to heaven. \r\nwhat a buncha \"tools\" :-p\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nI've done acid, shrooms, and DMT, and yes peyote, the whole lot of them - and I can tell you that, from my own experiences, you absolutely DO NOT need these drugs to open your Third Eye, let alone to understand this song the way I do.\r\n  To me, Third Eye is about perceiving reality, or what is around you, differently and thus discovering different things about reality. Why are certain jokes funny to a high person only when they are high? Because of how they perceive it. Their perceptions of reality are different than a sober person.\r\n On a hallucinogenic, once again from my own experience, your perception of reality is altered immensely. You perceive reality as a different person, as who you REALLY are without the alterations to your person that you are normally acquainted with due to the everyday common thoughts of life. (Where can I get a job, how can I get a raise, where will I go to college?)\r\n Not only this, but you perceive things without expectation because you know that you COULD be hallucinating. So its like, 'well I'm not sure if anything about this object or reality is real right now, anything could be a part of my imagination' (Truly not much is as far as I'm concerned) so you really do perceive those objects and that reality in an incredibly different light.\r\n However, though I mentioned that you do not need to use a hallucinogenic to understand this song I was speaking truthfully as far as my experiences. But I will also say that I can DEFINITELY relate to and appreciate this song so much more because I really understand the, for lack of a better word, connotations of the things Maynard is describing.\n\n\r\n By the way, I really believe that hallucinogenics are fantastic if you use them wisely and intelligently. It should be iterated that these kinds of drugs really are not meant just to get 'fucked up.' For true appreciation,  become knowledgable and explore their uses and the wonders of the seperation of perceptions through hallucinogenics.\n\r\nAnd I'm spent. :o)\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\ni think third eye means the visions you see when .... thats right when ur listening to tool ... :-/...but yeah i had 4 cups of mushroom juice and the shi ti saw reminded me of this song... but whatever mayanrd is a genious u try to understand his songs ur head will hurt\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\ni tripped on lsd i tripped on my foot i like to lick balls of hay....tool is good remember this baby ah ha yeah ...\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nWhoa everyone, for those of you who think that MJK was drugged up when the song ws made, plzzzzzzz think again. I hate to disappoint, but the band does not do drugs. Sorry.\n\r\nI also hate to bust your balls, some of you, but this song could really be about nothing. Just shit to make you think, remember, when you listen to TOOL, take shit with a large grain of salt.\n\r\nBut the song is about something, its just to complicated to figure out, and I doubt anyone but the band will ever know the true meaning behind it.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\n\"I think psychedelics play a major part in what we do, but having said that, I feel that if somebody's going to experiment with those things they really need to educate themselves about them. People just taking the chemicals and diving in without having any kind of preparation about what they're about to experience tend to have no frame of reference, so they're missing everything flying by and all these new perspectives. It's just a waste. They reach a little bit of spiritual enlightenment, but they end up going, 'Well, now I need that drug to get back there again.' The trick is to use the drugs once to get there, and maybe spend the next ten years trying to get back there without the drug\". - Maynard James Keenan\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nThat was a quote from Maynard.\r\nI think his perception is clearly stated....\r\nAnd I'd have to agree.\n\r\n\"Prying Open My Third-Eye\"\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nAll I have to say after reading this is:\n\r\nVision....Thank you VERY much, that was so heavy duty I almost fell of my rocker, thx man\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nVision, that's exactly what I've always thought about the world, and I wonder why more people don't think about it. I suppose that they ignore it because of what you were saying...\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nI think the musical brilliance of Adam, Danny and Justin needs to be stated\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nWow blue rose's MJK quote, blew my mind once I refered to the lyrics\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nTool is the best band since Pink Floyd, and this is the best song since echoes.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\n\"dreaming of that face again........Thre warm wild eyes\" \r\nhes most likely meditating, which may have involved visualization of himself with the third eye\r\nthe next verse is about visualizing yourself on your back and the \"hole\" possibly refers to the third eye, rising up is his astral self projecting and hovering above himself and wiping the wiping the webs and dew from his withered eye is him opening it, the withered probably means its not fully developed.... too lazy to go through the rest\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nI absolutely love Maynard's brilliant writing, this is such an amazing song. The best closer I've come across. You don't need any kind of drug to experience the full effects of this song either which is another plus. It's just an experience all by itself.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nTo me, this song is about bringing subconcious into the concious and becoming aware of all the operations of your brain.  This happens for some people when taking psychadelic drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nSome of the ideas explained for the song and other ideas have\r\n been on the correct track in my mind.\n\r\nThe third eye is a Hindu tradition holds that all people have three eyes.\r\nThe third eye is located in the brain and is a PHYSICAL part of all human beings.\r\nScientists have struggled to find meaning to its use and have only concluded that\r\nthe eye is effected by light. (their are books available on this subject)\n\r\nThe relative nature between lsd and the song I think holds in the fact\r\nthat lsd can help you in the stages to open your third eye. By taking lsd\r\n doesn't ensure you will open your third eye to see the other realm.\r\nBut it can help to put you in a frame of mind for you to furthur meditate and \r\nexperiance what the song is talking about.\n\r\nI have taken strong lsd and have seen the visualizations that appear real but\r\nare only the brain opening up and using different paths.  If you were to successfully\r\nopen your third eye you would see the rather large difference.\n\r\nAnother drug to help is DMT.\r\nLike LSD but often more intense. \r\nSince it is not taken by mouth, \r\nthe effects come on suddenly and can be overwhelming.\n\r\nThe term mind blowing might have been \r\ninvented for this drug. The experience was \r\ndescribed by Alan Watts as like being fired out of \r\nthe nozzle of an atomic cannon (Leary 1968a p.215).\n\r\nThoughts and visions crowd in at great speed; \r\na sense of leaving or transcending time and a \r\nfeeling that objects have lost all form and \r\ndissolved into a play of vibrations are characteristic. \r\nThe effect can be like instant transportation to \r\nanother universe for a timeless sojourn.\n\r\nDO NOTE YOU DO NOT NEED DRUGS TO OPEN YOUR THIRD EYE it can be done\r\nthrough meditation.\n\r\nIf you really wanna experiance the power of the third eye this site may help\r\nteach you about all chakras including the third eye. (the vid clip for parabola\r\nat the end shows the human body opening all chakras within its body).\n\r\nWe all have the ability to do this so give it a try although will take some time.\n\nparanormal.about.com/gi/dynamic/…\n\n\n", "comment_116": "\nWell, I believe that eye imagery is overused as a metaphor, but it's Maynard and I'll let it slide this time.  Whatever the case, all the talk about chakras and expansion of consciousness are right on the money, but I don't think that this is supposed to be about drugs.\n\r\nDrugs will force your third eye open, change your consciousness, but they don't take much effort.  Eating acid isn't hard to do, and it will change your views of the world.  Does that sound like prying it open, breaking its iron-fisted viselike clamp, forcing duality upon you?\n\r\nTo PRY open one's third eye is to use all your strength and make it open, to jam a crowbar into the crack and break the seal that makes you think that this exists, the seal that makes you think that this frail, lusty, fragile meat is actually who you are.\n\r\n\"...the eyes seem so familiar, like phosphorescent desert buttons...\" obviously points out the metaphors that are drawn between the experiences of mescaline and those of actual opening of one's third eye, and the penetration of the veil of reality.  Drugs give you a similar experience, but they're not true, they're a hobble and a crutch at the same time, helping and hindering you so that you can never reach the full opening of one's third eye.\n\r\nThe change happens through force and discipline, and is a hundredfold greater than the mild awakening of hallucinogens.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nFor those of you who doubt that this song is essentially an homage to the potential of hallucinogenic drugs, in addition to recognizing and acknowledging the difference between what we perceive and what is real.  To anyone who chooses to contest me on this one I have but one thing to say: the only way to tell for sure is to eat some shrooms and crank up the volume to see for yourself.  That is not to say I condone the use of drugs for everyone - they can be extremely dangerous and even under the most controlled situations things can go in an unexpected turn, but I can say from experience that if you choose to see for yourself, if you have Aenima and Lateralus on hand, and listen to them at a volume loud enough to be enveloping, its easy to walk away a better person.  I am of the opinion that to truly understand and receive the full experience of the music, particualrly Aenima, Lateralus and Salival, then you must listen to them while tripping at least once, and odds are the experience will better you.  The essence of Tool's philsophy is betterment through realization, and everything they do, particualrly beginning with Aenima is in a sense a tool to that end.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nokay, some more fleshing out on my previous post and symbolism from the song:\n\r\nthe third eye is that aspect of our consiousness that is normally inactive, that which allows us to perceive the world and translate it into the form of language, which allows us the capabilty of conscious thought.  I say dormant because like the Tim Leary quote from the beginning of the salival version (Tim Leary being the motivating force behind the introduction of LSD and pscilocybin to society in an effort to bring on a transcendental experience), our strucure for reality is generally based on values taught (informing, forming in our mind), not values seen.  Essentially, hallucinogens awaken a part of our thought process that is normally ignored, as it needs no use if structure and language are given by a source of authority instead of found.  By taking a hallucinogen, you remove that structure, and are forced instead to define things in terms of a new structure, all at once wiping away all of the mistaken or added implications and assumptions of the previous system while replacing it with a system that makes fewer or no assumptions. It sounds kind of complicated, and once again, you have to really experience it to fully grasp the implication.\n\r\n\"so good to see you once again, I thought that you were hiding from me\" \r\nthis line (and its analogs) is written from the point of view of truth (or, as it boils down to the same thing, the physical drug) calling to him or perhaps more correctly the promise of a system that is best applicable for the individual.  the mention of dogma and reason are references to the structures that are in place and in a sense obsolete (chasing the trail of smoke and reason, chasing the tail of dogma).  It is forgotten that existence is independent of the concepts we give to it, and that any dogma or doctrine or structure is necessarily derivative of the world around us, not the other way around.  The drug serves to open the door to those kind of realizations.  \r\nPhosphorescent desert buttons = peyote, a mescaline bearing cactus\r\npulling the peices from the sand. . . this scene is in a sense a tribute to the renewal that hallcinogens bring - while they rip away the old structure, they replace it anew through discovery and realization, the pieces in the sand represent the shattered remnants of the old system, and when placed back together they form an image that is both the same and different from the original (I do not recognize the vessel, but the eyes seem so familiar).  The vessel is simply the recreation of the shattered pieces, and is a metaphor for himself, in that we are all vessels, waiting to be filled with structure and knowledge and the old one was destroyed and repaced and refilled anew. In essence, we are allowed to find the flaws and misconceptions in the old system through this process of restructuring, eliminating them and evolving the way we think.  The crow is the symobolic representation of the messenger quality of the drug, in that it brings the message that there is no message beyond what we create, that anything is conceivable, but only after the process of renewal.  Beyond that, the song is essentially a tribute to the potential of the hallucinogenic experience and what it can allow us to acheive, particularly in sweeping away the illusions that limit and pervert our understanding of reality.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nOh yeah, and just a little finishing point here, it is important to realize that while the song is in essence an homage to psychadelics, it also carries with it the implication that they are merely the first step, a shortcut to opening your third eye without the tedium and discipline of meditation, or the necessity of being indoctrinated into a system such as buddhism or hinduism that allows this kind of introspection.  It must be remembered that although this seems like the fast and dirty way to get something done that can be acheived without drugs (and it is possible to acheive these things without drugs), a persons access, particularly in our society, is limited in things such as a guru to guide you, or the time and committment to be able to break away from survival (obligations) long enough to acheive something through those methods.  To put it in perspective it may take a guru 50 years to acheive what one acid trip whlie listening to Tool could produce.  It must also be realized that the drug can develop interest in persons who previously had no idea or exposure to an eastern sense of reality and the concept of nirvana, or total peace with ones reality.  Once the thirst has been developed to a certain extent, the drug loses both its importance and its ability to change.  To deny that the song is about the potential of hallucingens is to blind yourself to the entire possibilty that Tool represents, and to deny that possibility is to denounce the band itself, as the band carries a very strong message of both evolution and improvement, and the ability to define things in terms of your own judgement and not others -to deny the possibility of drugs is to remain within a certain structure that places a stigma on drugs and not evolve into a new, more applicable structure.  Perhaps the reason why the drug is illegal is because of its unique ability to allow one to renounce outside authority for an interior one. . . .After all, every experiment Leary ever did with LSD while a professor at Harvard produced beneficial results - look up the research, its all published.  AND HOW CAN YOU IGNORE THE HINTS? Tim Leary, the father of the hippie movement, largest distributor of LSD the world has ever seen, has a space talking about this very thing at the beginning of the salival version, not to mention bill hicks from the aenima version ranting about the benefits of drugs.  How can this not be a central theme to the song when these quotes were purposefully included?  What other purpose can these quotes possibly have, than to bring out the point that drugs posses in them not just the capability for evil, but also good, making them two-sided, in essence a tool, much like the band itself is a tool for self improvement, should you be able to decipher its meaning.  Trust me, to deny the hallucinogenic aspect of the music is to rob yourself of the full meaning, making what should be a quick and relatively painless process of self betterment (and through self betterment the betterment of society at large) into a struggle to interpret that which cannot be interpreted in the context of our traditional systems, but which requires a new structure or system to comprehend.\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nCuban711 in refrence to your hindu connection to the third eye. \n\nangelfire.com/sc3/1010/…\n\r\n\"The author believes a circular magnetic field that forms in the frontal portion of the brain in them acts as the hidden third eye, which receives and transmits a kind of radiation that probably lye outside the range of known electromagnetic radiation spectrum.\"\n\r\ngood read let me know what you think.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nHas anyone ever seen the amazing Parabola video it links in with the theory of the third i think\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\none of the greatest songs in the world and one of my personal favourite tool songs. the live version of this song on the 'Salival'  album as it features maynards personal opinion at the beginning of the song 'think for yourself question authority' but the aenima version is also brilliant as it features bill hicks rantings at the begining (rest his soul) who the aenima album is dedicated to.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nmeditationiseasy.com/mCorner/techniques/…\n\n\n", "comment_124": "\nmeditationiseasy.com/mCorner/techniques/…\n\n\n", "comment_125": "\nI dont know if you all realize this, but Maynard isn't really into drugs. He has used probably close to every drug out there but he uses that drug and then tries to get back to that state of mind without the drug....though meditation and the strengthening on your third eye and other chakras.\r\nMaynard is so fucking deep in his music its unbelievable.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nMy view on this song is that in the beginning, drugs are needed for him to reach his third eye.  This is shown through when he is dreaming of himself with the third eye and then he talks of how the eye is falling away from him.   Then when he \"wipes the webs and the dew\", he has taken some sort of hallucinogen and his eye is reappearing.  Then the lyrical absence represents meditation.  Once he has finally achieved the full reopening of his third eye, he begins to relay to the audience his experiences through the spoken word.  When he sings \"so good to see you...\" he is speaking from the eyes of his third eye.  Then, when his displays internal duality, he is speaking from the role of the self and the third eye.  When he talks of \"dogma\" and \"smoke and reason\" i do not think that he is simply refering to physical reality but also the belief that drugs are the only way one can have the ability to see the true self and glimpse the third eye.  By him saying that he is prying open his third eye, he is obviously saying that it takes more than a simple pill to truly see the third eye.\n\r\njust my comment.\n\r\nCant wait for the new CD next year.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nThere are so many different interpretations of this song... noone's really seems perfectly right to anyone else, I don't think. There's always something missing when you read an interpretation. Maybe this song is about just that? That trying to figure out this song is sort of like prying open your third eye... no matter how much meditating or drug-taking or whatever you do, it never seems close enough to opening your third eye. I think that might be something this song deals with.... \n\r\nI've heard interpretations that this song is about chilling out and doing drugs, about a penis, about meditation, about chakras, blah blah blah... thing is, that none of these are probably right... if I wanted to, I could say that Maynard was insinuating about being gay, and that \"I came out to watch you play\" meant he was coming out of the closet... but that wouldn't be right either (and I don't actually believe that :p)... no matter who says what, I can almost guarantee only Maynard knows. Peace out. Have fun prying open your third eye.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nDo these guys do lots of acid?\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nThe third eye is the minds eye. Open up your mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\narg been a while but ive found new meaning. Since the entire album is essentialy about developing spiritualy and become more then just perfect. Philly said it right about the third eye. Its your minds eye. Its looking past the physical and looking past the illusion and seeing what the truth really is. In the live version they say it best \"Think for yourself, question authority.\" We all have the possibility to tap into the untold resources of god. But how many do? We have the capabilities to govern ourselves. We have the potential to free ourselves from this. To experience true freedom. Freedoms that this world could never supports. Why dont we? Why do we live this way? Why did i make this world? Why did i make a cage around me? Why am I? I am.....\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nIf any of you people have studied the chakras, while the Third eye, which is located between the two eyebrows, is in a postitive form it means that you are opening up to spitrituality and new expericances. baddabingbaddabooom. that prettty much explains it.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nthis song is infact about dmt. your third eye is also known as your pineal gland in your brain. the pineal gland if open releases dmt which is 10x stronger than acid. and he is talking about opening his third eye hence  prying open my third eye. as in trying to open his pineal gland.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nIt's definately about a chemical enhancement that opens up the third eye.  It's about seeing what can't be seen through a drug-induced vision (I can relate).  I can't say what he's speaking of, it could be anything from heroin to hallucinogens.  But it's a great song to listen to under the influence of anything...\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nlots of people are saying  \"listen to tool with drugs it enhances it\"\r\nwell seing how drugs open up your third eye, you are listening to it with your third eye open, thus you can understand it easier. i dont think that thier songs are ment to be listened to when you are high, but instead when your third eyeis open.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nPeyote was used by Native Americans, particularly shamans, to meet with spirit guides.\n\r\nI don't believe anyone mentioned anything about the crow, but I didn't read all the comments. Crows are often seen as representing illusions, the supernatural, knowledge, and shapeshifting. I also checked out a Native American site to see if I was forgetting anything and Crow is said to bring \"guidance while working in shadow.\" Think about it.\n\r\nAlso, to whoever said we \"only use 10% of our brains,\" that's incorrect. Only about 10% of the brain is ABLE to be used for thought process and the rest has to do with other things. We use all we're physically able to use.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\n...And there are other ways to \"open\" the third eye without the use of drugs. They aren't necessary.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\ni personally think that this song means all of these explanations, i mean why just have a song about only one topic why not add everything into it and make it a multitude of trips instead of just one thing, like an obssession? I really like the thing someone wrote (sorry I cant remember who there is so many pages of comments**) about the hindu third eye -chakra was it?- it was intresting- i went home yesterday and stared at it in the mirror and my face was shimmering with golden sand dunes of a beutiful desert. yall should try it... i also liked the part (that hoibbes typed) about the \"peyote as phosphorescent desert buttons is because if you look at it through some sort of heat vision (googles or whatever) they all glow a slightly different shade. \"\r\nand I think tool's periodic use of the third eye is because it symbolizes freedom from influence and casting away of doubt in yourself - and thinking for yourself, and knowing who you really are - not what you are... by the way Adam is so sexy!! - oh yeah-i went there...\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nWell I'm not sure how It all ties in, and perrott did touch on the subject... Located in the exact center of your brain is the pineal gland (im not sure how but some believe it is tied in with the location of the great pyramid at he center of the physical world), Anyways the pineal gland is believed to be sensitive to light, and bears a remarkable resemblance to our other two eyes, in fact in a few reptiles, this eye has developed to a fully functional third eye.  This has earned it the nickname the \"third eye\" The pineal gland's exact use has not yet been accurately discovered, but it is a fact that when stimulated it produces the drug, dimethyltryptamine (DMT). Which has been used by many ancient cultures and civilizations throughout central american, as a very powerful hallucinogen. some consider the trips more intense then acid.  Scientists have not yet proven if it is true, but it is believed this gland, and the drug DMT, play a role in everything from dreams, to out of body experiences, to alien encounters.  When people meditate, and experience visions, it is likely they have found a way to stimulate the pineal gland, and produce DMT, therefore prying open their \"third eye\" .. so i guess the point of all this is, like someone said before, Maynard is not a hardcore \"stoner\" so perhaps what he is referring to is the stimulation of our \"third eye\", since he does seem to be quite a fan  of sacred geometry, states of altered consciousnesses, and such..... who knows, just a thought... probably way off knowing the way he thinks lol..\r\nAnd sorry if none of that made sense its my first post\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nIm suprised no one has mentions this but has anyone read the yaqui way by carlos castaneda.  This song makes a hell of a lot more sense.  When i was first told that the song was written on a book it wasnt beliviable till i read the book.  Carlos trains with a shaman don jaun, who uses peyote as a teacher.  (A peyote button would be what they eat) Don jaun also turns into a holy crow and teaches carlos how to as well.  He meats mescalito who teaches him a song(just because thats what outherworld peyote entities do)  The middle line sounds like carlos when he searches in the desert don jaun watches him, the blue sun is the other world he enter her searches and finds mescalito which in the song it describes as peyote buttons that teach him a song.  Carlos runs away because of fear at the end of the book, he couldnt handle what he wsa brought in to.  Carlos ran because of fear and he needed time to put reason to all this insanity that he had entered.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nPoisonedUnicorn about your post your right you can get there without drugs but past people have found enlightenment by starving themselves, going through terrible pain to reach true moment of clarity where not only is your eye open your connected your one.  Using drugs might take you somewhere in a day that might take you ten years of deep meditation those that dont use drugs that get far usually dedicate years and years of there lifes.  Like monks and what not.  Drugs are bad, but using certain drugs properlly can show you things you could never understand without, also a good book zig zag zen by alex grey, talks about being tradtional or using drugs to get to an ecstatic state.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nThe heartbeat sound that is audible throughout the song is chilling. sounds like a meditation or trance or something like that.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nI remember a quote from Maynard about drugs...I can't remember it exactly but it goes something like this: An interviewer asked him about drugs and the third eye and Maybard responded with something like \"Drugs can be an effective way to open your third eye\" and the interviewer asked him if he used drugs to do that and he said \"I tried shrooms once but I try not to take the easy way to enlightnment.\"\n\r\nThat's more than likely not word for word, but it's close.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nThis is my favorite Tool song, yet I don't know any of the lyrics. Why? Because I don't care to know. It is musically Tool's best song and the music tells the tale better than the lyrics anyway. On Lateralus, every song has some ending part where Maynard says the meaning of his song. This ending part usually is completely out of tune with the music itself, sounds awkward and is forced. When I listen to Aenima, I get engrossed in the music itself. In Lateralus, I feel like I have to listen to the lyrics, go online for a few hours to study what other people have written about them, then post on boards like these to show that I've learned something. In essance, it's more about the meaning than about the music, making it not much of music at all. Aenima is awesome, Lateralus is alright. That is all.\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nLateralus is my favorite album.\n\r\nThe reason I'm a fan of Tool is that I can find meaning in the music. They don't just make amazing music...but there's also a feeling in it.\n\r\nGo ahead and try to find 6 pages of legit meanings on a Green Day song.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nTo me, I see this song as a documentary of a time when maynard (presuming he is the writer of these lyrics) had just returned to an addiction (and i'll say it's likely to be drugs, as the rest of you seem to agree), after being without it for some time. Thus, his referal to the comforting, 'three warm and wild eyes'. \r\nThe part of this song which hits me the hardest is the lines, 'So good to see you once again\r\nI thought that you were hiding from me\r\nAnd you thought that I had run away\r\nChasing a trail of smoke and reason'\r\nThis, to me, is him conversing with the addiction. The part about how it thought that he had run away chasing a 'trail of smoke and reason' to me says that he had attempted to stay away from the drugs/whatever it is, chasing an elusive normality and reason... and now he returns, to pry open his third eye again (and if this refers to a particular state of brain chemistry, or perhaps the sinister being inside of him- eg, three eyed monster, I am unsure) and be in the comfort of his addiction. \r\nThat's what I get from this song, anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nI do not recognize the vessel,\n\r\n We are truely spirits, who occupy physical bodies to participate in physical reality: without our bodies we couldn't be a part of it. We can consider the physical body as a vehicle, or using a modern word, a craft.\n\n\r\nHmmmmmmm, sounds like a vessel to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nI agree about this being tool's stairway to heaven. I've said it once, there is whispering in the backround of the track, and others, i wonder if its the voices in my head?\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\n10000 DAYS AHHHHHHHHH!\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nWell this entire CD is based on Jungian psychiatric theories and whatnot.\n\r\nRead this page: en.wikipedia.org/wiki/…\n\r\nYou will then see many correspondances with Jungian theories and this song and the CD as a whole.\n\r\nThe shadow mentioned in the song is an unconcious complex that everyone has (based on Jungian theory).\r\nIt is thought that the shadow and all other unconcious complexes emerge as characters in our dreams, hence  the lyrics where he dreams of a blue face with 3 eyes, his shadow, which is also the crow above him or whatever. The lyrics then state that he's reaching into his shadow. See the connection? This also supports the suggestion that the dialogue in the lyrics is the writer metaphorically communicating with his unconcious mind.\n\r\nAt least that's what I gathered.\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\ni disagree.  Tool wasnt on drugs when they made this....maynard said in an interview that one should try a drug, and then spend TEN YEARS trying to get back to that point w/o the drug....This may be it, because the music he madfe a decade earlier (CAD) was nothing but trippy.  Maybe also about him finding his mind after such a long time (plenty of evidence as to his losing it--his mother, his stepfather, the military, the world, god), and that the person he is talking to is himself....this kind of feeling is as amazing as the song....e-mail me (IAmTheDubTiger@Yahoo.com) for more, or if it isnt clear....\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nif anyone is interested in what Bill Hicks says atthe start here it is:\n\r\nThe 1st One:\r\nSee I think drugs have done some good things for us. If you don't think drugs have done good things for us then do me a favor. Go home tonight and take all of your records,tapes and all your CD's and burn them. Because, you know all those musicians who made all that great music that's enhanced your lives throughout the years? Rrrrrrrrrrrrrrrrrrrrrrrrrrreal fucking high on drugs, man. \n\r\nThe 2nd One:\r\nToday a young man on acid realized that all matter is mearly energy condensed through a slow vibration, we are all one consciousness experiencing itself subjectively, there's no such thing as death, life is only a dream and we are the imaginations of ourselves. Here's Tom with the weather. \n\r\nAnd The 3rd One:\r\nIt's not a war on drugs, it's war on personal freedom is what it is okay, so keep that in mind at all times, thank you.\n\r\nEnjoy.\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nI spent some time reading everyone's thoughts on this song. Most of them are good, just all different. This is the beauty of this song, and many artists like Tool. \n\r\nSo for my opinion:\n\r\nI see the Third Eye as a gateway to understanding yourself. Whether you experience this through drugs or meditation, when you start to truely look inside your actions, thoughts, criticisms, feelings, whatever they may be, you are able to understand the futile nature of life. On the other hand, without your experiences, you are nothing. You will not have the ability to question without a reason to do so. I really do not know what will be ahead for myself, but what I can see is that whatever it will be, will shape me however I let it. The third eye is the ability to let go of the confines of society; the ability to realize that everything is relative to your position. All information is valid, disagreement aside. Just listen to every new idea, enjoy the fact that it exists, and keep moving forward.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nI heard this song when I was younger and I really didn't understand all of it then. But my brother recently showed me this song and explained it all to me in a musical and philisophical sense. And above all I was shroomin, and earlier i started to think very abstract yet very basic and sensical thoughts that most people blow over on a daily basis. My body flowed with the energy this song made and was one of the craziest experiences with music i've ever had. And \"prying open my third eye\" kept circulating in my head along with lateralus' \"feed my will to feel this moment.\" I fell asleep with the cd on repeat and I remember hearing the songs in my sleep. But when i woke up the \"high\" had left and I couldn't remember all of the important things I had thought about the night before. Sucked ass to say the least. But yeah maybe maynard wasn't on any drugs when he made this song as \"prying\" is him trying as hard as he can to achieve it. I've heard a saying that says taking drugs takes you to the ocean of knowledge, but you drown because you have no control. But being enlightened is being able to get there and being able to swim.\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nthis song is fucking awesome, off of an awesome album, Tool rules\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nOne of the best 13 minutes of music you can ever hear, or will ever hear for that minute. it is a good song to relax to. the way the song builds up to this loud riff and then gets voilently silent (ironic i know) is amazing. the two quotes in the beginning are perfect match for this song, because it seem like maynard is on something when he wrote this song. i want to see them preform this song live on their new tour.\n\r\nBilly Hicks seems to be like George Carlin, in my opinion, both tell the truth the way it is, and they \"Think\". they break away from the mold the government says is proper and still break away from the mold people call moral.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nOk...I read a transcript from an interview with Maynard that clears the whole drug thing out. In the interview, the reporter asked Maynard's view on the use of drugs, specifically hallucinogenics.  Maynard replies stating that these drugs should not been relied upon to reach a heightened mental state. Rather, the drugs should be used once and then the person should then gain the ability to reach the same state without the drugs.\r\nHe said something along the lines of, \"One should use a drug like LSD and then spend the next 10 years trying to reach that same state\"\n\r\nI think that is the point that they are trying to get across here. When it is said \"like phosphescent desert buttons\", its saying that he reached his third eye once before with the aid of drugs, but now, he was able to reach his third eye through meditation (which i think is representative of the musical interlude in the middle).\n\r\nThe song is a time progression of the narrator's meditation...the beginning is the narrator beginning his narrator by attempting to remember what he felt previously when he was on the drugs,  the 'In' and 'Out' is him controlling his breathing during the meditation, the musical part is the meditation, the next parts is about the narrator getting close to reaching the third eye but fading before the realization is hit, after the first repititon of \"Prying Open My Third Eye\", he has finally reached his third eye and he then confronts his third eye.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nI agree with shnugen 17, the narrator (maynard?) opened his third eye using acid or shrooms or something like that and now he's doing it again using intense meditation \n\r\nOh and sysys nearly ruined the song for me, asshole :p\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nThis is truly an amazingly incredible song to listen to (on/off of drugs).  Though the lyrics are posted here I was wondering if anyone knew what Maynard is chanting in the song after the line, \"Chasing the tail of dogma\" when it goes into the next section.  It may just be me, but it almost sounds like he's chanting something in a different language... just wondered if anyone knew.\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nfuck yeah, drugs open your eyes. that is what i think this song is about. just free your mind man. maynard is fucking awsome\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nThe song is not about using drugs! \n\r\nThe song is about being able to NATURALLY, through meditation or other method, get back to a place that drugs only gave the narrator a glimpse of earlier in life. It is about the true realization of the self, through solely INTRINSIC METHODS, not drug use.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nFor me, this song holds a special place in my heart no other can fill, and its 13 minutes of heaven. The best track ever recorded of all times.\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nWell after reading 7 pages of this bull, I can see there is a profound debate on wether substances are an influence in this song...\n\r\nI firmly believe that we must look past the comedians speil on drugs and music, or the news report on the boy on acid but the simple quote that follows... \"It's not a war on drugs, it's a war on personal freedom. Keep that in mind at all times, alright?\"\n\r\n Now... Having used acid innumerable times throughout my lifetime I can relate to the whole third eye experience. but from the line above we see clearly that \"its not just a war on drugs\"...thats why people have brought up the \"question authourity\" argument.\n\r\nsee... my stand point is that this song is aimed at two sides of a particular group...the people who have been silently questioning authority, wether with drugs, or music, or their personal beliefs...\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nThe third eye is a metaphysical and esoteric concept referring in part to the ajna (brow) chakra in certain eastern and western spiritual traditions. In New Age spirituality, the third eye may alternately symbolize a state of enlightenment or the evocation of mental images having deeply-personal spiritual or psychological significance. The third eye is often associated with visions, clairvoyance, precognition, and out-of-body experiences, and people who have developed the capacity to use their third eyes are sometimes known as seers.\n\r\n     According to Max Heindel's Rosicrucian writings, called Western Wisdom Teachings, there are in the brain two small organs called the pituitary body and the pineal gland. This last gland is also called by medical science as \"the atrophied third eye\"; however, these teachings describe that none of them is atrophying: the pituitary body and the pineal gland at the present time are neither evolving nor degenerating, but are dormant. It is said that in the far past, when man was in touch with the inner worlds, these organs were his means of ingress thereto, and they will again serve that purpose at a later stage. According to this view, they were connected with the involuntary or sympathetic nervous system and to regain contact with the inner worlds (to reawaken the pituitary body and the pineal gland) it is necessary to establish the connection of the pineal gland and the pituitary body with the cerebrospinal nervous system. It is said that when that is accomplished, man will again possess the faculty of perception in the higher worlds (i.e. clairvoyance), but on a grander scale than it was in the distant past, because it will be in connection with the voluntary nervous system and therefore under the control of his will. (Also take a look at 46&2, same Idea of moving to the next stage in human evolution and enlightenment)\n\r\n[Shout out to Wikipedia for the details]\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nIt is awesome that Maynard can inspire so much thought, debate, and interpretation, sound like another work of art from centuries ago???? Anyway 10 years AA (After Aenima) I can read these lyrics daily and interpret them differently every time\r\nThanks Maynard I think you maybe opening alot of peoples third eye and they just don't know it!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nthe reason Maynards makes the quote on Salival about thinking for yourself and all that generally is what the third eye theory is all about - thinking with a higher conscience and pushing the envelope of our mind and assessing things with greater thought and not just looking at the obvious. We are all capable of alot more than we generally believe, and the third eye shuts out negative thought. Also we are not meant to know everything in this life, and i can tell you that most of it remains a mystery to us, but we should not only look with our eyes, but with our mind.\n\r\n\"I stick my hand into his shadow\r\nTo pull the pieces from the sand\r\nWhich I attempt to reassemble\r\nTo see just who I might have been\"\n\r\nthis looks to be talking about reflecting on how we change and hopefully becoming more open-minded and attempting to become a greater person, but realising what we would have been like if we were to despise the third eye.\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nThink for yourself...question authority....\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nbest song. I agree with bonzo, tools stairway to heaven\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nI must say while some of the theories associated with this song are quite interesting others are just plain stupid.  If you like drugs then that's your problem, but dont try to twist a great song's meaning to justify your addictions.  I also noticed that a lot of people get realy hung up on certain lines of the song.  Big props to the guy that clarified the \"child's rhyme\" bit.  When I read someone's comment on p4 about \"tumbling down that hole\" I just had to sign up for this site and add my 2 cents.  I guess people nowadays skip the fun part of being a kid, reading books.  the above line is simply a reference to \"Alice in Wonderlans\" or the world of fantasy if you must have a solid connection to the song.  Many of the lines in this song are almost straight quotes from works of literature, philosophy, religion and so forth.  While Maynard is definitely a freaken genius for putting it all together I think you put him on too tall a pedestal.  As for the song's meaning I for one found it pretty straight forward - look inside yourself, see past the everyday mundane life into the larger picture. Everything else is just fluff, great fluff mind you.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nToo1SyNcLiSt\n\r\nStep 1:\tCreate Playlist 1.\t(MusicMatch Jukebox)*\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\tEon Blue Apocalypse\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\tCesaro Summability\r\nâ\u0080¢\t(-) Ions\r\nâ\u0080¢\tEon Blue Apocalypse\r\nâ\u0080¢\tViginti Tres\r\nâ\u0080¢\tCesaro Summability\r\nâ\u0080¢\tLateralus\r\nâ\u0080¢\tThird Eye\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\tCesaro Summability\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\tEon Blue Apocalypse\r\nâ\u0080¢\t(-) Ions\r\nâ\u0080¢\tViginti Tres\r\nâ\u0080¢\tDisposition\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\t(-) Ions\r\nStep 2: Create Playlist 2.\t(Windows Media Player)*\r\nâ\u0080¢\tLipan Conjuring\r\nâ\u0080¢\tLost Keys (Blame Hofmann)\r\nâ\u0080¢\tRosetta Stoned\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\tEon Blue Apocalypse\r\nâ\u0080¢\tCesaro Summability\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\tViginti Tres\r\nâ\u0080¢\tEon Blue Apocalypse\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\t(-) Ions\r\nâ\u0080¢\tViginti Tres\r\nâ\u0080¢\tUseful Idiot\r\nâ\u0080¢\tEon Blue Apocalypse\r\nâ\u0080¢\tIntension\r\nâ\u0080¢\tRight in Two\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\t(-) Ions\r\nâ\u0080¢\tViginti Tres\r\nStep 3: Start Playlist 1. 23 seconds into the first track, start Playlist 2.\n\r\nEnjoy.\n\r\nâ\u0080\u009cBorn to bear en writ to all, for all the world to see.â\u0080\u009d\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nthis song is incredibly. It often finds its way onto my stereo just as the acid kicks in.\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nWHISPERING!\r\nI'm surprised no one has said anything about this.  I found this on another web page:\n\r\nOk guys, I got soundforge and I decided to try to figure out what the whispers were saying from 10:30 to 11:00 AND I STARTED TO FIGURE IT OUT! I'm so excited ok I seperated it into 2 different channels, changed it to mono, improved the sound quality and slowed it down and here is EXACTLY what I hear(it's not completely clear but I'm almost 100% this is what she says)\n\r\n\"It came from an Irish novel. Open it in the light. It came from a novel, now you will find it\" then near around 10:55 it says \"Open\". \n\r\nI havent found anyone or any site that knows the answer to this riddle though.\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nthis is a fucking brilliant song! the salival live verson gives it so much more. the feedback intro becomes more intense. the toolgasms are insane! and fuck me. i want sex with this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nREAD AND LISTEN TO THIS!!!\n\r\n7812569103411/67584131221911310/15\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nDuring the part where it sounds like deep breaths, that alarm like sound is actually saying \"In, out, in, out, in, out etc\" It's amazing I've only just realised this after all these years!\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nTool: The Cyclic Playlist.\r\n6,7,5,8,4,13,12,2,1,9,11,3,10 / 15 / 7,8,1,2,5,6,9,10,3,4\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nTool Synclist (complete)\r\n7,8,1,2,5,6,9,10,3,4 - 6,7,5,8,4,9,13,1,12,2,11,3,10 â\u0080\u0093 15,14 (or 14,15)\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nif you need to get online and look for definition for music, then you arent even listening....\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\n...Que?\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nThis song is about how Maynards father molested him. Im not going to go into describing every single sentence, but if you look at it with that point of view, it will make more sense than drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nDude, either you've got the wrong song or you must be on some hectic shit.\r\np.s: Can I have some?\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nno, I'm quite sure Im on the right song (Third Eye) and I havent done acid in about a year.\n\r\nit is very obviously about how is father touched/raped him...\n\r\n\"Dreaming of that face again\r\nIt's bright and blue and shimmering\r\nGrinning wide\r\nAnd comforting me with its three warm and wild eyes\"\n\r\nall he's thinking about is what his father does to him. bright, blue, shimmering...like happy, (possibly holding their breath) and shaking, as if ejaculating. comforting him because his father is trying to calm him, third eye referring to his penis.\n\r\n\"On my back and tumbling\r\nDown that hole and back again\r\nRising up\r\nAnd wiping the webs and the dew from my withered eye\"\n\r\non his back (for obvious reasons), getting up and wiping the cum from his face.\n\n\r\n\"A child's rhyme stuck in my head\r\nIt said that life is but a dream\r\nI've spent so many years in question\r\nto find I've known this all along\"\n\r\ntrying to get his mind off of whats happened/happening by reciting the row row row your boat rhyme in his head. he's constantly questioned why he's here...\n\r\n\"So good to see you\r\nI've missed you so much\r\nSo glad it's over\r\nI've missed you so much\r\nCame out to watch you play\r\nWhy are you running?\"\n\r\nhe's very glad his father is done...\n\r\n\"So good to see you once again\r\nI thought that you were hiding\r\nAnd you thought that I had run away\r\nChasing the tail of dogma\"\n\r\nfinally glad to see his fathers penis, because he knows its no longer inside of him...\n\n\r\nI think you can figure the rest out for yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nwow...\r\nTo give you the benefit of the doubt, this song most likely has dual, or multiple meanings. I may never listen to this song the same way again.\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nThe name Third Eye? It is talking about the 3rd person of life. What is this world? Why are we here? The beginning about acid talking about there is no such thing as life or death, life is just a dream. Its stating that were not real that there is a 3rd eye and its what we are. We just project ourselves\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nHe's singing about his third eye that has been opened. He 's going in and out of his consciousness, afraid of loosing it and running from it at the same time. He's just so frustrated, and I can feel the frustration cus I have been given the third eye. I have no idea of what's going on, Is this a holy gift he asks? (is this holy crow above me) depends on what you think holy is but, yeah the third eye is a gift from above..\n\r\n\"Black as holes within a memory\r\nAnd blue as our new second sun\r\nI stick my hand into his shadow\"\n\r\nHere he is singing about the entrance of the third eye or his consciousness.\n\r\nSomething I'm not so sure about but in my case the third eye has given me a memory back from my childhood - that I had forgotten and didn't want back.. Maybe that's what he is singing about here: \n\r\n\"A child's rhyme stuck in my head\r\nIt said that life is but a dream\r\nI've spent so many years in question\r\nto find I've known this all along\"\n\n\r\nSometimes It seems that the third eye is closed and then you get afraid of loosing it that's why he's singing \"Prying open my third eye\"\n\n\r\nThank you for this awesome song!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nhas any1 else looked up third eye and found something about chakras\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nCheck out the latest post in Lateralus. It will answer your question better than I can.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nprying open my third eye\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nExcellent song. I view Maynards lyrics from a Hindu Philosophical perspective. I see he is expanding his consciousness through transcendental meditation. An awakening of the seven cerebrospinal chakras ascending the human body from the coccyx to the medulla oblongata. Its interesting to note that in 'pushit', he goes down a hole and we hear at the beginning of the song the sound of 'violin' honeybees. This is the first sound one hears as the manifestation of the aum vibration present within all of creation, when the first chakra at the base of the spine is awakened. Each Chakra has a different distinct maifestation of this sound as you ascend in consciousness. Its not always a direct ascension, but an up and down motion, kinda like playing a musical instrument. In and out. Pushing and pulling.\n\r\n   The other neat thing I noticed in this \"Third Eye\" song is his comment about a grinning blue face with three eyes. Krishna is often seen in Hindu mythology as a 'face' of the creator, and he has a blue face. He is considered the \"Christ\" of the orient. He is the one who re-introduced the world to the techniques of yoga that can enlighten mankind. The next step of spiritual evolution for humanity. Realizing that this is the dream realm of the Creator, and that as such we share His consciousness, only divided from each other by delusional ego and outward illusory sense dependancy.\n\r\n  'Blue is our new second sun' refers to the vision one sees when the 6th chakra is awakened. Its the third eye (Ajna Chakra) opposite the medulla oblongata between the eyebrows. The 'eye' is a blue sphere, circumscribed by a golden halo. At it's center is a bright five pointed star. It's through that doorway that we can communicate with our higher self. The same God that lives inside us all.\n\r\nThis whole album and a lot of Maynards works in Tool and A Perfect Circle are (to me) one man's journey of enlightenment, and all the frustrations and joys that come with it. \n\r\nGreat job, Maynard! And Tool!\n\r\nNamaste!~~~Patrick\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nJade Dragon - NAMASTE INDEED. \n\r\nThanks for explaining so well.... I'm so exasperated at times at how misunderstood, or un-understood Tool are. They really are trying to bring us all UP.\n\r\nEveryone - look into yoga, or vajrayana buddhism, or tantra, or thelema, or hinduism, or even luciferianism or wicca for crying out loud. Many paths, one destination. You have two selves. Most of you haven't met, or are totally unaware of the other one. That other one is God. Turn around, he'd love to shake your hand.\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\ndoes every tool song some how mean the ways of the penis\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nVery deep song. Basically means using LSD to pry open his third eye to the spirit world. It has little do with drugs, more so with the Spirit Realm, but it's centered around using LSD once, and using that experience to connect himself with the an undiscovered realm, hence, \"Prying open my third eye\".  \n\r\n\"Like phosphorescent desert buttons\r\nSinging one familiar song...\" \n\r\nCan also mean the use of peyote, an extremely potent hallucinogen, probably the most intense thus far known.\n\r\n\"Shrouding all the ground around me\r\nIs this holy crow above me\r\nBlack as holes within a memory\r\nAnd blue as our new second sun\r\nI stick my hand into his shadow\r\nTo pull the pieces from the sand\r\nWhich I attempt to reassemble\r\nTo see just who I might have been\r\nI do not recognize the vessel,\r\nBut the eyes seem so familiar\r\nLike phosphorescent desert buttons\"\n\r\nThat whole Stanza basically meaning using LSD once, and years later try to bridge a gap between his own consciousness. Brilliant song, really.\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nâ\u0080\u009cShrouding all the ground around me\r\nIs this holy crow above me\r\nBlack as holes within a memory\r\nAnd blue as our new second sun\r\nI stick my hand into his shadow\r\nTo pull the pieces from the sand\r\nWhich I attempt to reassemble\r\nTo see just who I might have been\r\nI do not recognize the vessel,\r\nBut the eyes seem so familiar\r\nLike phosphorescent desert buttons\r\nSinging one familiar song...â\u0080\u009d\n\n\r\nI am only focusing on this one part because this was the only part of the song that got a little confusing.  I think I understand clearly what Maynard is talking about.  Currently I am reading a book that each page feels more and more like the mind of Maynard.  I can tell he has read and thumbed through this book more then once.  This book has many words and ideals that match a handful of Maynardâ\u0080\u0099s songs.  Book is called â\u0080\u009cAwakening The Third Eyeâ\u0080\u009d by Samuel Sagan.\n\r\n\tFirst Line; shrouding means to conceal, protect, or screen.  I think he is talking about living without the Third eye and how it is concealing what he could become in his world.  He is starting his meditation.\n\r\n\tSecond Line; Crow is a symbol for death and used with the word Holy it becomes a messenger.  He has come to help him resurrect his former self.  Also during meditated messengers (good or evil) come to contact you.\n\r\n\tThird Line; Maynard is talking about when you are young you experience life through your third eye.  Itâ\u0080\u0099s there but like they say, â\u0080\u009cYou donâ\u0080\u0099t use it you lose it.â\u0080\u009d  He is trying to remember how to open it but canâ\u0080\u0099t remember. (Trying to reach Astral Space during meditation)\n\r\n\tFourth Line; if you read the book, it talks about when meditating you enter the astral and/or astral space you see colorful light (Any color but majority of the time â\u0080\u009cPurpleâ\u0080\u009d).  I think in this line is where he starts the meditation and enters astral space.  Seeing a new world that comes in blue.\n\r\n\tFifth Line; He reaches out to this the holy crow to hear its message.\n\r\n\tSixth Line; taking that information, he tries to rebuild his former self. See what he once was.  Sand is used a lot in reference to time.  He looks to the past to rebuild what time has eroded from himself.\n\r\n\tSeventh Line; Same, he wants to figure out who he use to be and attempts to pull the past from his memories\n\r\n\tEighth Line; He looks into his former self and it seems so unfamiliar and realized he has changed.  Think about our bodies as vessels that carry our souls.  When you awaken your third eye your soul leaves your body for a short period of time.\n\r\n\tNinth Line; he knows it was once him because the eyes resemble himself even when the vessel is no longer recognizable.\n\r\n\tTenth Line; Maynard talks about how his eyes stand out above everything else, like a white dot on a black background.  Your Focus goes towards the white dot, drawing you in.\n\r\n\tEleven Line; His former self then communicates in a way that seems too familiar as if he can remember.  Trying to regain lost memories from the past. Comparing himself to the old self.\n\r\nI recommend reading the book, only if you like spiritual journeys.  Also if you want to take a look at a small path Maynard has adventured too.\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nto me this song seems like it is referring to someone's lives being a series dreams and each dream he has he is re-incarnated. He is talking about things being so familiar like he has seen them somewhere before but now he is catching on that he is in one of his dreams stumbling upon something he knows from his previous life. Not sure but that's just what i take from it.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nIt's amazing how short sighted people are. It's not about LSD, Shrooms or for that matter any kind of drug. I would think it is extremely obvious but apparently all of you are one track minded or completely oblivious.\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nTHIS SONG IS ABOUT a DMT TRIP i mean just liston to the words     the third eye its your pineal gland it produces DMT (DMT makes you dream) but when you smoke the extract(found in plant) you have a very intence TRIP!!!TRIP can be life changeing especialy when it comes to DMT \r\nlook up DMT on google videos joe rogan talks about it. \r\nthis is a great song!!! even better  when tripping b/c the lyrics are deep and make you think\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\ntin tin is pefectly correct about the meaning of this song. Maynard told me personally, his greatest influence was a dead hero by the name of Bill Hicks. You should all check out some of his work, such as the album Relentless...that is where maynard got the idea for the song Aenima\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nfurtherutilities, shutup, just shutup.\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nI think the beginning part is funny. Just beause it is like asking the question, \"What would actually happen when we do reach that 'next level' in evolution?\" Tool explains this through a simple news program like it's something that can just be shrugged off as 'fluff news'.\n\r\n\"Today, young men on acid realize that all matter is merely condensed through a slow vibration. That we are all one consciousness and sharing within itself subjectivly; there is no such thing is death. Life is only a dream in which imagination of ourselves.\"\n\r\n\"Here's Tom with the weather.\"\n\r\nHaha. Like it's nothing.\n\r\nCoincidentally, this idea of a, \"war on drugs\" started in the sixties. Where a Harvard Professor, who was studying the effects of LSD on test paitents affected by Schizophrenia, by the name of Timothy Leary told every kid in America to do drugs, specifically LSD, because of the \"great high\" that a person can get off of it. He tried it himself. The dude was (or still is, I'm not sure if he's dead) a nuttcase. Anyway, this inevitably brought on the hippie generation.\n\r\nActually Nixon said, \"Timothy Leary is the most dangerous man in America.\" We all know Nixon hates hippies.\n\r\nRemember that this was in the 60's, the closest time we ever used a mass nuke attack (Cuban Missle Chrisis) so saying something like this, instead of Soviet Russia, really ment something.\n\r\nAlso, I think it's worth mentioning the current \"Tool\" band of this era, The Doors. Who, much like other major rock bands of this time, frequently delved into the wonder drugs. In fact, the name, \"The Doors,\" originally came from a book called, \"The Doors of Preception.\" In this book, Aldous Huxley (author and also a professor) explains that in order to reach a higher preception of mind, one must dabble into drugs in order to do so.\n\r\nWeird, eh? I think Tool's insparation comes a lot from The Doors. So. Much. Alike. I feel Tool's work is more focused and polished, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nFUCK LSD acid is not as good as people say it is people think that acid is where colors apear from noises and noises are heard from colors but im only 14 and ive been testing the effects of all drugs i took 3 hits of acid and yes it does open your mind to a very unique way of responding and reacting to a normal day situation but my true drug that i have been testing alot is a drug called peyote it is a natural drug like mushrooms but it is a cactis that only grows in the desert of new mexico las vegas and mexico of corse and this is the drug that actuallyy makes corors turn into sounds and sounds into colors and this drug has no after effects even with the amount of natural mesciline in it and this drug doesnt effect the mind as strongly as lsd with the mind altering affects but u think alot more open minded while u are on it and u can think alot more scientific then on acid but it mostly effects the vision making it really difficult to see in day light cuz of all the random colors coming out of everything u hear and see and in complete darkness i could see everything in the room like it was as clear as day and it was very comfortable unlike acid with its wierd effects on movement and scences and in darkness it is alot more easier to keep track of the VERY VERY strong hulusinations and u almost feel sober while on it but with a slite mind alter but with a clearer way of thinking so yeah FUCK ACID haha peyote is the drug for everyone and i swear to u that it is alot stronger than acid for hulusinations unless u took like half a sheet of acid or something but yeah if u dont believe me becuz im only 14 test some peyote out and u will see that i know what im talking about and it isnt dangerous to do peyote even 3 times a weak haha i love TOOL best band for smart drug abusers haha\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nI'm not saying you shouldn't interpret a song in a way that inhances the whole experience of music but..\n\r\nyou guys kind missed it. \n\r\nThe songs about Bill Hicks, a comedian that sadly died in 1994.\n\r\ntheres album art in the booklet.. and the intro to the song is all from a recording of his performances.\n\r\nhe talks about how drugs open your third eye in a way that you find the truth; which is that we are always with god, we just have to wake up. there is no death in essence.\n\r\n...tool kicks ass\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nThis song is bread crumbs. It allows you to tie all the other songs together. Images of enlightenment, awakening, etc are seen throughout the entire album, its easy to see once you've read up on the right material. The 'you' in this song is Maynard's inner child which he is also talking about in jimmy. Also, because of the nature of the lyrics and the fact that I have dabbled with hallucinogens, I would tend to say that Maynard's awakening would have been drug induced..... Another reason I think this is because of lost keys (Blame Hoffman) and Rosetta Stoned... (read up on them.) Aenima, Lateralus, and 10,000 days are all, in my opinion about enlightenment, opening your third eye, and going against the 'norms of society.' If you want further proof read up on all the band member's backgrounds, as well as Alex Grey.\n\r\nOh, and novaselic666, I partly agree with you but.... I think they just used Bill's quotes to set the mood for the song, since that is what he was all about. Eulogy is entirely about Bill though.\n\n\n\n", "comment_202": "\nman ive listened to tool for a while just becuz of the theory of the third eye alot of their music is about using the third eye by drugs, openinng your mind to more wild weary thoughts and ableing the use of more of your brain\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nPEYOTE opens your mind enough to see another world OPENING YOUR THIRD EYE ive done that shit fucks you right up u feel like your gonna die for a while but then your hulusinating really fucking crazy  for a while\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nI THINK THE REASON THEY CALLED THE BAND TOOL IS CUZ MAYNARD SINGS ABOUT THE TOOLS TO OPEN THE THIRD EYE IN ALOT OF THE SONGS AND ITS ALL ZONED OUT DRUG MUSIC WITH MAYNARDS BELIEF IN OPENING THE THIRD EYE SO IT ALL FITS TOGETHER I BELEIVE IN REACHING THE POINT OF WILD THOUGHTS BY DOING DRUGS THATS THE WAY TO GO\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nAnybody else think Tool fans are mostly complete fucking morons?\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nallcaps man (bones666) seems to support that idea.\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nmaynard does too much acid. he also takes it in the ass\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nRest In Peace Bill Hills, both maynards hero and mine.\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nRest In Peace Bill Hicks, both maynards hero and mine.\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nMJK said \"you intrepred whatever it means to you\" Well i think this song refers to be aware of whats around you. for example when i tried shrooms, my third eye was squeeging. in other words i saw what was wrong in my life and what was wrong around me. example, my friend did shrooms and he realized why his life is going nowhere, his third eye opened and gave him a reality check\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nIm sorry but ya all are wrong if ya didnt notice in the begining of the song if you dont know who that was it is bill hicks a comedian and long time friend of tool go look up some jokes on youtube the soundbite will make alot more sense the actuall joke he is talking about mainly an LSD story thats always on the news about people jumping out of buildings im not going to go into deapth because it will take too long just go look at the vid but the 3rd eye is the portion of the brain located right in the middle of your eyes it is part of your unconcious mind and in life very rairly used and see thats were the LSD comes in because when this drug is taken it opens up the receptors in the part of the brain which many people believe brings so much insight on things at one time that they believe its a religious experience or enlightenment which i guess still is a religious experience\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nI'm a little disappointed to find out that, starting with the quote at the beginning, this is not satire. I was hoping the message was going to be that deep and abstract music like Tool's can be made without the influence of drugs \"and this is the proof of it\". As far as I can tell from this song, its lyrics, and reading many of your comments, the answer is NOPE!\n\r\nThe Mars Volta is a good example of a drugless music-making experience, but again, I can't be completely sure of that. Only hope.\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nSo...\r\nI'm leaving a party late at night.  Right before I left I drank some shroom-tang (not bad, by the way!) for the first time ever.  \r\nI'm driving and singing along to this album, which I had not at that time listened to in its entirety.\r\nThere's a long silence.  Then...\"I feel that drugs have done good things for us...\"  I was totally taken unaware.  It felt like some divine presence was in my car with me!  Maybe it was the shroom-tang.  But I completely felt Bills words.  And I agree!  I understood everything he said like it was my Self putting words to it. We are all one consciousness experiencing itself subjectively!\r\nI drove home falling in love with that song.\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nI think the song is about a peyote trip. Your third eye is the \"eye\" that is opened up when you do drugs (more specifically hallucinogens). You see a strange new world that cannot be perceived with your two real eyes. I dunno, it's hard to describe to anyone who hasn't done drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nI think some part of this song is about Lord Shiva .. cuz in the first paragraph he mentions some who is bright,blue and shimmering with three eyes.\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\na perfect song that surely everyone can relate to in some way. the way it sounds is just so amazing... I span fire poi for the first time to this song! I AM ADDICTED TO AENIMA!\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\n\"So good to see you\r\nI've missed you so much\r\nSo glad it's over\r\nI've missed you so much\r\nCame out to watch you play\r\nWhy are you running?\"\n\r\nMost beautiful verse.\n\r\nI've been questioning existence alot these past few days, Tool is a wonderful companion to this ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nVision - Thank you. That was beautiful. And true.\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nwhen the song begins, Maynard is talking about using psychoactive drugs again after a long period of time away from them.    one time Maynard said that you should only use drugs to see the goal, then reach them without their assistance.   as he admits his defeat, he takes the drugs and is tumbling down the rabbit hole, and wiping the dew from his \"third eye\" he hasn't used in quite some time.   the song is actually quite simple, dont look so deep. the answers are right in front of you\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nI think this song could be interpreted a number of diffrenet ways. for the most part its about intuition. its weird how hes kinda singing to himself with the whole \"to see just who I might of been\" thing. this song could also be about the rebirthing practice.\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nI really like how Tool used a clip from Bill Hick's positive drug story in the begininng of this song.  Bill Hicks and Tool are both awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nguess.\r\nlol\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nOdd where it sais\n\r\n\"So good to see you\r\nI've missed you so much\r\nSo glad it's over\"\n\r\ni could swear maynard sings \"So glad I'm sober.\" instead of \"So glad it's over\"\n\n\n\n", "comment_224": "\nDMT Dimethlytriptamine you get a dose of it everynight in REM and in reptiles its thier third eye. Strongest hollucinigenic known to man. Alex grey makes the tool album art for them he does it. research it its dynamite.\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\n\"So good to see you\r\nI've missed you so much\r\nSo glad it's over\r\nI've missed you so much\r\nCame out to watch you play\r\nWhy are you running away?\"\n\r\nTo me this is supposed to be when somebody is comming down from a drug like lsd, when i was on lsd i listened to this song and i related to it a lot. \"so good to see you, ive missed you so much, so glad its over, ive missed you so much\" this is when you come down from lsd and you are starting to see your consious self again, and your able to think right again. \"came out to watch you play, why are you running away\" taking lsd to have fun but when your on it you want to be back to your sober self so you can think clearly.\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nthis song is about DMT and its effect on maynard.  the opening jokes were from comedian bill hicks, an avid dmt user.  the \"third eye\" is within your brain and in reptiles it actually contains components of visible eyes including a retina.  dmt is stored in your brain and released during REM sleep causing dreams.\n\r\na good portion of tools work is about dmt primarily or to a lesser extent, acid.  if you look at the album art for 10000 days or lateralus especially, it is all dmt-inspired creativity.\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nI don't have much to add aside from that I interpret this song in purely philosophical terms as I feel (despite the obvious) references to drugs diminish the value of the song. The sort of nihilistic/existentialistic view presented, and the feelings of transcendence here when the speaker describes the opening of their \"third eye\" are too powerful a message for me to think of as attributed to drugs. \n\r\nJesus does that sound pretentious, but hey, it's just my personal view. \t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nWhile i know that the third eye hes talking about isn't the one in his crotch. the lyric \"prying open my third eye\" always makes me wince.\n\r\nImagine. someone prying open your japseye.  \t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\nThe whole \"third eye in the brain\" is a load of new-age crap, Maynard is referring to the \"third eye\" purely metaphorically.\r\nHis \"Third Eye\" allows him to see the world as it really is. Drugs can open up the third eye, but over-use of drugs can damage it permanently and close it shut - hence why you'd have to pry it back open by taking even more drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\ni got pretty high once and thought that this song was about god. but i dont remember how i came to that conclusion.\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\npersonly i think this songs meaning is smack bang at the start\r\nin the great words of Timothy leary\r\n(Think for yourself)\r\ni also dont think this is one of tools greater songs\r\nto draged out and slightly (repeditive)\n\r\nallthough i do recon it could have something to do with maynards first hand drug experiences\r\nnot that iv heard he has any for record.\n\r\nTool Kick freekin arse\r\nPeace\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\ni think i may actually know what at least some of the lyrics mean! namely, the bit that seems make the least in the whole song. \n\r\n\"So good to see you\r\nI've missed you so much\r\nSo glad it's over\r\nI've missed you so much\r\nCame out to watch you play\r\nWhy are you running away?\"\n\r\ni intially had no idea what this meant but after a little bored internet surfing, I came accross a personal description of what dmt is like. When dmt is taken, it is sometimes hallucinated that many different entities (called machine elves for some reason) have come to greet you, saying things such as-\n\r\n\"How wonderful that you're here! You come so rarely! We're so delighted to see you!\"\n\r\nThis obviously is very simillar to what maynard wrote in this part of third eye and these machine elves apparently go through you back and forth giving thousands of bits of information, present you objects that couldnt possibly xist in reality etc. This could fit in with- \n\r\n\"Came out to watch you play\"\n\r\nFinally when the trip starts to wear off these entities are seen to physically leave you untill they dissapear, which seem to fit with the last part of this verse- \n\r\nWhy are you running away?\"\n\r\nI do not know if any of this has been said before as i cannot be botrhered reading over 200 posts, but i am actually fairly certain that this is the real translation of that verse.\n\n\n", "comment_233": "\nThis song is litterally about opening your third eye. Doing so with EITHER drugs or meditaton. the blue shimmering face he refers to is the face of the three eyed godhead Vishnu many people have reported seeing once opening the third eye. He refers to himself as two people because once opening the third eye people experience what is called ego death where the lower personality of the ego seperates from the true identity thus \"I stick my hand into his shadow To pull the pieces from the sand Which I attempt to reassemble To see just who I might have been\" this part is about discovering the true identity that most of us use durring childhood. the feelingof meditating to open the eye is floating in a black space spiraling up tumbeling all arround weightless while the body lays comfortably on your back,as descried in the begining of the song. once opened the third eye shows us unlimited possibilities including an eternalbeing that we are inside indvidual vessls of bodies and tht life is the dream we imagine up. and again in the begining refering to row row row your boathe sais he found out hes known all along, like when we were children we all knew weve just fogotten. if you think any of thisis bulshit well open yourmind and try to open your third eye andsee for yourself before you argue it. Samuel Sagan has a free pdf book with direct instructions here clairvision.org/ckb/ckbe/ckbc/fol_0000_0700/cat_0000_2222/…\n\r\ngood luck \t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nim listening to this song for the first time at 3 in the morning and am loving this and the whole album.  \t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\nI thought the \"third eye\" was the source of creativity. It doesn't really have to do with drugs, although it could probably be achieved with drugs as well, but it doesn't have too. And I know this for a fact.\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\ni kinda think its about DMT dimethlytyptamine or something like that its a drug and after you do it they say it opens your third eye or something\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\n\"I think psychedelics play a major part in what we do, but having said that, I feel that if somebody`s going to experiment with those things they really need to educate themselves about them. People just taking the chemicals and diving in without having any kind of preparation about what they`re about to experience tend to have no frame of reference, so they`re missing everything flying by and all these new perspectives. It`s just a waste. They reach a little bit of spiritual enlightenment, but they end up going, `Well, now I need that drug to get back there again.` The trick is to use the drugs once to get there, and maybe spend the next ten years trying to get back there without the drug.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\n  you guys are close, but all the comments I have read are wrong concerning the meaning of the third eye. It is most literally the pineal gland. In reptiles the pineal has a iris and a lens, it's an eye. In reptiles it sits on top of the brain moderates the amount of melotinin released according to the light it receives. In humans the pineal has receded to the most protected area of te brain, and it's connected directly to all of the sensory nurons. It has been long theorized that the pineal is the seat of the soul, dmt is the sprit molecule. It is not sprit material ,but is used as a spiritual transport. To Fully understand tool you need to read \"dmt the sprit molecule\" by Rick strassman. He conducted the most conclusive research on dmt in new Mexico in the early nineties, and the effects of dmt are more pronounced and tangible than any other psychedelic substance on earth. Dmt literally transports you to a different deminson, it's effects are much more profound than LSD.   \t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\nIn a nutshell, people use psychedelic drugs as a short cut to their third eye, or spiritual peace. they Pry open their third eye, instead of achieving it natural through long methods of meditation.\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\nActually, \"Third Eye\"  is a synonym for brown eye.  \"Prying open my brown eye!\".  Lmbo!\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nFor all of you that don't believe this song has anything to do with drugs I'm sorry to say that you are sadly mistaken.  At the beginning of the song Bill Hicks says all that great music was made by high musicians..   Your third eye is like your 6th sense.  It's a vision that's a supernatural insemination of your subconscious beliefs or memories..   This song talks about getting into that state.   In this case drugs would be the entry way into the third eye state of mind..  (which can be inferred because of the Bill Hicks Allusion to his message about drugs)  \t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\nA third eye experience is like a drug induced Kundalini Awakening.\r\nBrought on by DMT or acid.\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\nThe first two 'stanzas' just scream Alice and Wonderland.\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\nIâ\u0080\u0099m supprised how no one mentioned maynard and bill hickâ\u0080\u0099s spiritual beliefs. \n\r\nA child's rhyme stuck in my head.\r\nIt said that life is but a dream.\r\nI've spent so many years in question\r\nto find I've known this all along.\n\r\nrow row row your boat gently down the stream. Merely merely merely merely life is BUT A DREAM! Bill hicks even used that for his stand up material and tried feverously to awaken our collective unconscious to this fact. â\u0080\u009cWe are all but one consciousness experiencing itself subjectivelyâ\u0080\u009d Or the way I like to say it, we are oneness  discovering itâ\u0080\u0099s infinite subjectively. The heavens expand through and within all of us.\n\n\n\n", "comment_245": "\nI dont know if anyone has said this but the first few lines \"Dreaming of that face again\r\nIt's bright and blue and shimmering\", Reminds me of Bill Hicks's shows \"Relentless\" and \"Revelations\". If you watch the dvd editions, the stage is lit in a blue light, and bill is wearing black clothes, making his face appear very bright. Probably doesn't mean anything, but it was the first thing i thought of.\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\nFinding peace of mind?\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\nThis song is completely about a DMT trip, and if you do some research on DMT and people's experiences (namely Terrance McKenna's) you'll see all the pieces come together. It took me up until 2010 (when I started researching DMT) to figure this out.\n\r\nDMT, or dimethyltryptamine, is a chemical found in our pineal gland, right in the center of our brain, or otherwise known as our \"third eye\". Pineal glands in reptiles have a cornea, retina and lens. Literally, a third eye. It's released when we dream, and right as we're born and right as we die. Our brains naturally produce it, as do certain plants and other animals.\n\r\nPeople's experiences on it are so similar, and most report coming into contact with blue beings (Maynard talks about dreaming of that face again, its bright and blue and shimmering) and when those beings see you there, in this other dimension (your 'trip') they say how glad they are to see you, and how much they've missed you. (Maynard sings \"But the eyes seem so familiar, Like phosphorescent desert buttons\r\nSinging one familiar song... \"So good to see you, I've missed you so much So glad it's over, I've missed you so much\")\n\r\nand then the whole \"prying open my third eye!!\", is basically what you're doing when taking DMT.\n\r\nthere's a reason why they start the song with those few references to drugs by Bill Hicks...  do some research on DMT and you'll see just how sick this song really is >: )\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\nTo me this song is referring to the infamous DMT. DMT is the chemical produced by your pineal gland in your brain that makes you dream (for those of you who are unaware)and is the strongest known psychedelic drug, it produces 5-10 minute trips in which in some occasions you may feel like your \"returning home\" = \"ive missed you so much\". the pineal gland is also known as your third eye, but it doesnt see in a normal sense, its sight relies on DMT which is powerful enough to be its own alternate reality... opening the 3rd eye can take years of mental training or one long hit of DMT = \"prying open my third eye\". when one is under the short lived influence of DMT the user very commonly falls backwards into a trance after letting out the hit = \"on my back and tumbling.\" a DMT trip can be such a profound experience that people who have been atheist for years will become religion lovers over night, or maybe in some cases it shows you how religion is itself a false deity = \"and you thought that i had run away, chasing the tale of dogma\" a DMT trip can sometimes also have its own personality/wants/needs. it seems to enjoy when you give it attention = \"so good to see you, ive missed you so much\" that would be the DMT speaking to maynard..? who fucking knows haha\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nI like this version better.\n\n\n\n\n", "comment_250": "\nI've listened to this song thousands of times and know the lyrics, however I hear the words \"lying open my third eye\" Instead of \"prying open my third eye\" every time.\n\r\nI also hear \"remove my eye\" when the song is really saying \"open my eye\".\t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\nObviously a tribute to Bill hicks.\n\r\nBut looking deeper. The third eye is a symbolic element part of philosophies and religion. The third eye is meant to represent the observation of another, more spiritual, realm. One certain \"drug\" comes to mind when discussing the third eye and the spiritual realm: DMT.\n\r\nDMT is interesting from a scientific standpoint. All forms of life contain DMT. Including humans. Our bodies release tiny amounts of DMT when we dream. Now comes the interesting part. Right before we die, our body releases a large amount of DMT. This may scientifically explain why people have \"near death experiences\". The body thinks that it is about to die, and releases DMT. Due to the miracles of modern medicine, people have been brought back with these experiences engraved in their memories. We have literally taken people back from the spiritual realm. This song may link the mind state of Maynard caused by the death of Hicks. Constantly trying to find him again by searching for him within that spiritual realm through DMT. Trying to search for him with this third eye.\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\nIt's not a war on drugs, it's a war on personal freedom is what it is, okay\t\t\t\t\n\t\t\t\t\n\n", "comment_253": "\nThis is a beautifully written song about the search for meaning, literally through the spiritual third eye, metaphorically through whatever means seem best to an individual person. To each his own on how he finds meaning in life. Best lines:\nShrouding all the ground around me\nIs this holy crow above me.\nBlack as holes within a memory\nAnd blue as our new second sun.\nI stick my hand into his shadow\nTo pull the pieces from the sand.\nWhich I attempt to reassemble\nTo see just who I might have been.\nI do not recognize the vessel,\nBut the eyes seem so familiar.\t\t\t\t\n\t\t\t\t\n\n", "comment_254": "\nFrom my viewpoint, there is no real person involved, when it's about \"so good to see you once again\" a.s.o . Of course there is this personal relationship and tribute to Bill Hicks but I feel that this is not the core of the meaning.\n\n Bill Hicks is even misplaced on a live-version by Timothy Leary. \n\nAlso the aspects of a fairy tale (blue guy, crow, new sun), are an inner view, a dream, or a trip a visionary mind state etc. And I must admit, I dont see what they stand for in particular or weather they just want to draw pictures of a certain mood.\n\nI think the stress is on that inner experience that you could describe by \"removing webs\" - finding something that is there all the time but neglected ever since.\nFinding It by forcing and strongly trying to approach or open it. \nSomething, that when its there, reveals things, shows things under a different light from a different angle. \nCall it Third Eye or what ever you like.\n\nBut once you find it doesn't mean you can keep it as a permanent condition.\nIt is slippery, wordless, not concrete enogh to hold it, to grab it or explain it. And that makes it so hard to keep and you have to chase it over and over.\n\nIt always seem to be \"running away\"\n\nIt does not fit in a \"dogma\", its not verbal, not easy to find with the sane and awake brain its not made \"smoke and reason\" like our daily language.\n\nBut on the other hand it is familiar, it has been there ever since, as a child you knew it, until education drew your attention away from it.\n\nWhen you really listen hard, closing your eyes, back straight, breath with the rhythm, stay completely silent from song 14 to Third Eye, than the song literally shows you what it is about - it really digs inside you! \nIt's something you find in meditation, in drugs, maybe in the woods, or in other forms of deep contemplation.\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\nThis interpretation is just as brilliant as the song. Thank you so much, you made my day. It's hard to figure Tool out so well and yet here you are, doing such an amazing job. There's no way I could have figured this song out in such detail, I guess I am facing the threat of being turned into a Google-dependent maggot. Well I have diagnosed it and hope to do better. Thanks a lot.\t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\nGuys and Guys oops yeah girls aswell.\n\nSee this is all about \"Lord Shiva\" a kid was talking about Buddhism  every religion is derived  from Hinduism---  and yes if its all about drugs. he he . learn about him.. MJK knows it .. and the reason we all love him :) .. peace.. do whatever you wanna do ;) !!\t\t\t\t\n\t\t\t\t\n\n", "comment_257": "\nNot Buddhism, but Hinduism. The third eye of the dreaming deity Vishnu (he who pervades) resides where man cannot see. The song seems to describe the destructive effects of brief moments of creative transcendence. The sexual connotation is likely intentional. Toward the end it seems to suggest that Maynard's relationships seem like projected, empty experiences.\t\t\t\t\n\t\t\t\t\n\n", "comment_258": "\nThis is such a beautiful song, over the years it has meant many different things to me. It's capable of tearing you down and then comforting you like no other piece of music.\t\t\t\t\n\t\t\t\t\n\n", "comment_259": "\n\"Came out to watch you play,\nWhy are you running away?\"\nThis part of the song always gives me goosebumps because of the extremely foreboding tone. Something about the way he sings it just sounds so desperate and maniacal and it gives me chills. This song has such good progression and contrast.\t\t\t\t\n\t\t\t\t\n\n", "comment_260": "\n@abcurl1988 You may be right about this interpretation or not. I don't want to argue with anyone here by claiming or blasting that this song is about third eye in Buddhism. But, your interpretation about the third eye and the cycle of life is almost correct. What I would suggest is please keep on thinking on this. Search about it. You will always fall on the right path if you think for yourself. \n\r\nWhat's wrong about everyone here is stating that Buddhism is a religion. It's not religion. Buddhism is a Philosophy. Lord Buddha never asked us to forcefully follow whatever he said. He always have mentioned to always think for yourself before believing whatever you heard saw or sensed; even a thing Lord Buddha said. It's obvious that some will not accept a revolution. Because everyone's cold and lazy. They'll always make statements to justify their foolish beliefs.\n\r\nStaying without harming others is fine. But it won't help you with anything. It's like staying away from the road while all the vehicles go by.you won't ever cross it. You won't fall into trouble. But you'll just be there like a potato. It's up to you to decide whether to try find a way to cross it. By this I'm not saying to harm anyone or yourself. And Buddhism doesn't say find your own way either. Because Lord Buddha has told the right way -this is called \"Buddhism\" (because he took the decision to find a way to cross it)\n\r\nI'm not here to market Buddhism not to make any argument either. I'm posting this comment so that atleast someone will try to think for themselves laterally (Lateralus) and help themselves find a liberation out of this never ending cycle of life and death.\t\t\t\t\n\t\t\t\t\n\n", "comment_261": "\nThe name says it all\t\t\t\t\n\t\t\t\t\n\n", "comment_262": "\nMusically, one of the greatest Tool songs ever.  I don't know what MJK is saying, but I'm sure it written with a drug induced brilliance!\t\t\t\t\n\t\t\t\t\n\n", "comment_263": "\nThis song is the best Grand Finaly to an album ever made. It just shows the musical brilliance of Tool and the fact that they beat the crap out of all mainstream bands, in talent, musical ability and ability to write lyrics that make no sense whatsoever:). I especially like the little recordings at the begining of the song, (that for some reason are not mentioned here) they bring it all together.\r\nIf Mozart were still alive he'd be proud.\t\t\t\t\n\t\t\t\t\n\n", "comment_264": "\nI mike the salival!version0because of the arunch of  guitars folloued by txe defeaning silence at the first \"pryinf open mh third dye\". i ban imagJne the gnergy tJat must've been fillingthat auditorium, and i uish i could've ceen the`e somehnw\t\t\t\t\n\t\t\t\t\n\n", "comment_265": "\nthis song is the greatest....i luv the song and the band.....whoever doesnt  sux..and they can go die in a little dark hole in the ground somewhere deep in the woods.....any ways......and the song is great to get stoned to...peace out\t\t\t\t\n\t\t\t\t\n\n", "comment_266": "\nthis is a pretty good song and the third eye picture is so god damn freaky, haha\t\t\t\t\n\t\t\t\t\n\n", "comment_267": "\nOk, sorry if i am repeating anything but i havn't read all of the comments on this song.\n\r\nThis song is basically about life, and death.  Atleast to me.  But like most of tool's songs it is open to almost any interpretation.  I'll attempt to explain my view on the song by breaking down the song:\n\r\n\"Dreaming of that face again\r\nIt's bright and blue and shimmering\r\nGrinning wide\r\nAnd comforting me with its three warm and wild eyes\"\n\r\nHere, tool is describing what it is like after death to be reunited with \"god\".  Some other names for it may be the oversoul, one conciousness.  It is himself.\n\r\n\"On my back and tumbling\r\nDown that hole and back again\r\nRising up\r\nAnd wiping the webs and the dew from my withered eye\"\n\r\nOn my back and tumblind down the hole refers to life.  And as he dies he is wiping the webs from his withered third eye that was closed while he was alive, but is open again now that he is dead and reunited with god.\n\r\n\"In... (of life)Out... (of life)In... (of life)Out... (of life)In... (of life)Out... (of life)\"\n\r\n\"A child's rhyme stuck in my head\r\nIt said that life is but a dream\r\nI've spent so many years in question\r\nto find I've known this all along\"\n\r\nHere he is saying how he has spent so many years during his life in question about existence to find out that, now that his third eye is open once again that he is reunited with god that he has known this all along.\n\r\n\"\"So good to see you\r\nI've missed you so much\r\nSo glad it's over\r\nI've missed you so much\r\nCame out to watch you play\r\nWhy are you running?\"\n\r\nthe soul is saying how good it is to once again be reunited with god.  but alas, he must live once more.  why are you running away, god?\n\r\n\"Shrouding all the ground around me\r\nIs this holy crow above me\"\n\r\nas he is reborn the holy crow, god, is closing his third eye.\n\r\n\"Black as holes within a memory\r\nAnd blue as our new second sun\r\nI stick my hand into his shadow\r\nTo pull the pieces from the sand\r\nWhich I attempt to reassemble\r\nTo see just who I might have been\r\nI do not recognize the vessel,\r\nBut the eyes seem so familiar\r\nLike phosphorescent desert buttons\"\n\r\nhe is trying to remember who he was in a past life.  it is not himself, but yet it is so familiar.\n\r\n\"Singing one familiar song...\"\n\r\nand as his third eye is opened again....\n\r\nthe rest of the song is basically repetitions except for two lines:\n\r\n\"Chasing the tail of dogma\r\nI opened my eye and there we were\"\n\r\nit is the way it has to be, the cycle continues.\n\r\n\"Chasing a trail of smoke and reason\"\n\r\nstill, it continues.\n\r\n--\n\r\nthat is what i got from the song anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_268": "\nI could analyse the shit out of this song. But I'll just give you a little taste of what it means to me. The song is obviously very heavily influenced by psychedelic drugs and it describes the effects of tripping; feelings, hallucinations etc. \n\n\r\n\"Dreaming of that face again\r\nIt's bright and blue and shimmering\r\nGrinning wide\r\nAnd comforting me with its three warm and wild eyes\"\n\r\nI think is describing an entity, maybe a god,  the spirit of a psychedelic drug. It's three eyes mean it's enlightened and it is embracing a new psychonaut on the path to enlightenment.  \n\r\n\"On my back and tumbling\r\nDown that hole and back again\r\nRising up\"\n\r\nThe act of laying on the floor in darkened room while on psychedelic substances. It is meant to eliminate all sensory distractions so you can concentrate on the trip fully. This technique was originally made popular by Terrence Mckenna.  \n\n\r\n\"A child's rhyme stuck in my head\"\n\r\nAn auditory hallucination, often common with high doses of hallucinogens.\n\n\r\n\"It said that life is but a dream\"\n\r\nBill Hick's famous theory that life is \"Just a ride\"\n\n\r\n\"So good to see you\r\nI've missed you so much\r\nSo glad it's over\r\nI've missed you so much\r\nCame out to watch you play\r\nWhy are you running?\"\n\r\nThe feeling of yearning to trip and then having an overly intense trip, being scared away and slowly yearnign for a trip again. \n\n\r\n\"Like phosphorescent desert buttons\r\nSinging one familiar song...\"\n\r\nLike has been said, this is a reference to the \"Peyote\" cactus which contains the psychedelic mescaline. \n\n\r\n\"And you thought that I had run away\r\nChasing the tail of dogma\"\n\n\r\nNot having an experience for a long time and starting to question less, the dogmatic religions like Christianity.\t\t\t\t\n\t\t\t\t\n\n", "comment_269": "\nidk i was told a long time ago from someone that this song resemble for someone you love but in the end when its all over you realize that there was actually something behind more cryptic on that person you known and loved so much, prying open my third eye is believing on the flaws that the person you thought was perfect. that the person you love wasnt anywhere near perfect. accepting thats its over and done and will never be back to the way it was after realizing the truth about the one who got away or you had to give up. sorry i cant explain it that will im pretty wasted right now =)  \t\t\t\t\n\t\t\t\t\n\n", "comment_270": "\nThis song makes me kind of sad. to me it means that in order to achieve some kind of satori, you must use drugs. in the case of this song, \"prying open my third eye\" seems to me like drug use has become drug abuse.\t\t\t\t\n\t\t\t\t\n\n", "comment_271": "\nI'm coming down from an acid trip and this song perfectly embodies it. i feel that i pried open my third eye. everything is so much more beautiful than we perceive it to be.\t\t\t\t\n\t\t\t\t\n\n", "comment_272": "\nCuban711: Daoism? WTF is that. It's spelled Taoism. You clearly have no clue.\t\t\t\t\n\t\t\t\t\n\n", "comment_273": "\nmaynard should compose a drinking song\t\t\t\t\n\t\t\t\t\n\n", "comment_274": "\nim atheist as well as maynard i think , but in my opinion this song is talking about a creation or something that created us , as in a god , with the lines \"So good to see you.\r\nI've missed you so much.\r\nSo glad it's over.\r\nI've missed you so much\r\nCame out to watch you play.\r\nWhy are you running?\"\r\nin my opinion is that the \"god\" in a way fucks around with us and in the part of the song its showing in a way , that people who believe are fearful of god and all that shit , and in the salvia version of the song , each time they do that part it gets more potent in a way , and if there is a god it abandonded us along time ago , as in forsakin , and its evil in genral , as well as the whole song being called third eye , in a sence to succed to open your third eye its to connect with the more spirtual part of yourself , and to get to that state it takes alot of patients and practice , but what you succed in it , life does really just feel like a long dream to you and this song is quite close to describing alot of the details about it , i was really stoned when i thought of this but just remembered it quite well :)\t\t\t\t\n\t\t\t\t\n\n", "comment_275": "\nTHIS SONG IS ABOUT MAYNARD REMEMBRING HIS BILLY WHEN BILLY CAME BACKSTAGE TO HIS 1ST TOOL CONCERT, AND ALSO DREAMING ABOUT HIM, MOST OF THOSE DREAMS MAY NOT ACTUALLY BE \"DREAMS\", BUT ACTUALLY VISITATIONS.\n\nMAY-MAY \t\t\t\t\n\t\t\t\t\n\n", "comment_276": "\nI love Third Eye. This is in my opinion the greatest song ever recorded. It's 13 and a half minutes of musical bliss. It ends AEnima (brilliant album) with a bang. Maynard is God. We are his followers.\t\t\t\t\n\t\t\t\t\n\n"}