{"comment_0": "\nYay first to comment on Mariahs amazing new single!! Its gonna be a hit, well heres hoping! Its the same kinda style as her classic material! Its brilliant! I think its about, her whole breakdown and getting through it!\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\ni really like this song n it has a great message. shes saying that no matter what, no one can you put you down and that you have to keep going to keep the faith that you can make it through the hard times.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nawwww this song is sooo amazing!! loool\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nyeah..this is good, but am head over heels on her song I ONLY WANTED from her new album. i cant even add the lyrics here coz the artist already exists.. anyway, mariah is truly a classic...she'll never fade despite her breakdowns and stuff.. we're talkin real talent here!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nthis is a really greatsong, i love it. Its so inspirtational\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI love this song because Mariah got through her toughest time and she made it through all the hard times with the \"breakdown\", changing labels, and her breakup. I love Mariah she is so strong.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nwell i do appreciate her songs ! Does anyone can tell me where is she from . Thanks a lot\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\ni have loved mariah sinse i was like 5 she has such an amazing talent and i think thw whole meaning in this song is about her breakdown and shes going to make it on her own even though there is no one there to help her up and aven if she falls down again she'll get back up on her own and mend again well that my interpretation i might be wrong but mariah is still fuckin awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\ni have loved mariah sinse i was like 5 she has such an amazing talent and i think thw whole meaning in this song is about her breakdown and shes going to make it on her own even though there is no one there to help her up and aven if she falls down again she'll get back up on her own and mend again well that my interpretation i might be wrong but mariah is still fuckin awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nwell i am convinced that this song is very heplful for a peson who's going throught a bad time , to give you an example in the song she says ' And if you keep falling down donâ\u0080\u0099t you dare give in\r\nYou will arise safe and sound' that means you have to struggle to get thrgought the problem , also she says, when you're in a problem and no one gives you support you can stand up on your own .\r\ni think this track is about her breakdown in 2001 with glitter, she means that she can back up on her own and be the same famous singer as she used to be.\r\nbesides that , mariah is the best singer of the 90's , nobody sings the way she does and she has sold more than 150 millions records worldwide, in 2005 mariah's album was the best of that year , in other words  MARIAH CAREY  is one of the best singers of the world\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nIt's finding the strength in you to get up, believe, and love yourself because when you can do that, then you can overcome anything. It's a simple message, but a challenge for some who find themselves at their lowest point. It's definitely uplifting and inspiring when this song plays at the right moment.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis song is amazing\t\t\t\t\n\t\t\t\t\n\n"}