{"comment_0": "\nHe's just saying he cant believe that all these shitty musicians r getting popular(he's probably talking about like nelly and them). And the only ones that he thinks are actually good and should be popular r Reggie(redman?), jay-z, 2pac, biggie, andre from outkast, jadakiss, kurupt, nas and then of course, himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nOk, to answer a few of the questions raised...\n\r\nThe list are people he respects in the industry.  People that rap with meaning to what they say and aren't JUST about bling and bitches.  For the most part the people in his list don't make the Crunk type music and rap with feeling.\n\r\nAs for the Jada remark it was a diss to Benzino.  Basically he means that Benzino had to get someone else on his album just to sell records.  No one bought the album because of Benzino but only because of Jada being on it.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nOk, to answer a few of the questions raised...\n\r\nThe list are people he respects in the industry.  People that rap with meaning to what they say and aren't JUST about bling and bitches.  For the most part the people in his list don't make the Crunk type music and rap with feeling.\n\r\nAs for the Jada remark it was a diss to Benzino.  Basically he means that Benzino had to get someone else on his album just to sell records.  No one bought the album because of Benzino but only because of Jada being on it.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis song is the shit. The clapping makes it addictive.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI am not a fan of rap by any means, but Eminem is incredible.  His lyrics are so strong and meaningful, and he is never afraid to make a different in an industry where he must work twice as hard to earn the respect of his peers.  Great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nTo that one person wondering: 'Bobby and Whitney' is referring to Bobby Brown and Whitney Houston.\n\r\nHis list: Reggie(redman), Jay-Z, Tupac, Biggie, Andre, Jadakiss, Kurupt, Nas and Him is just his list of top rappers who are still rapping and are actually solid, at least thats how I see it. Solid as in, not rapping about bullshit and actually RAP ABOUT SHIT other than bling and bitches. \n\r\nJust my two cents: if this song came out later, I would think Lupe Fiasco would be on that list :D\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nFirst off the obvious, the song is about not giving up regardless of what others may think or say.\n\r\nNow to the hot topic(for the last 8 years which is crazy) the list of rappers. He says:\n\r\n\"Cause I'm at the end of my wits with half the shit gets in\"\n\r\nHe is talking about all of the whack rappers that are famous(foreshadowing for Soulja Boy and Lil Wayne I assume)He then goes on to say \n\r\n\"I got a list here's the order of my list that it's in\r\nIt goes Reggie, Jay-Z, Tupac and Biggie\r\nAndre from Outkast, Jada, Kurupt, Nas and then me\"- \n\r\nHere he is listing who he admires in the game. He isn't dissing any of these guys or putting them in a ny particular order, just what flows best in the song. The next line goes\n\r\n\"But in this industry I'm the cause of a LOT of envy\r\nSo when I'm not put on this list, the shit does NOT offend me\r\nThat's why you see me walkin around like nothin's botherin' me\"\n\r\nHere he is saying that if a magazine or TV show or whatever has a list of best rappers like he talks about in the previous line but they leave him off then he doesn't care. He is going to continue to do what he does until he dies.\n\n\n\n\n\n", "comment_7": "\nIt means that he's not going to stop doing what he's been doing, no matter what people say or do, until he collapses.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nDO i ever agree with SoyFarra I hate rap But EMinem Just Kicks Ass,strong lyrics that keep u attached,and addicted\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nWho is the Reggie that he refers to?\n\n\n", "comment_10": "\nprobably redman, he's done a song with him, so yah.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nthis is the best song on the new cd, i don't care what anyone says. it's an addictive song. I love the clapping sound effect. Pretty cool song\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\n THIS SONG HAS A GREAT BEAT TO IT AND THE LYRICS AR AWESOME\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nNate Dogg kicks ass in the chorus.  Tight song.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nwhats he talking about his list? this song is awesome and the beat makes it even better. I dont think its the best on the new cd but a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nwow i cantbelive no one has comented. this song kicks ass and im not even a eminem fan. he finmally is singing about some real isues. nice beat and great lyrics. There ya go man, u can still be good without killin gur wife!\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis song is fucking sick! It gets me so pumped and its definitely one of the best tracks off the eminem show along with sing for the moment, sayin goodbye to hollywood, and squaredance!\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nYeah seriously. I'm no eminem enthusiast but this song does kick some major ass. My normal music is like KoRn, Adema, Disturbed, Cold and othe rrock you know, but eminem is surprising me with some of this shit he is doing with the new album.\n\n\n", "comment_18": "\nOH MY GOD CAN THIS BE MORE TRUE? THAT IS WHAT I LOVE FROM HIM. HE DOESNT HIDES THE TRUTH, HE JUST DOESNT CARE ABOUT THE PEOPLE BUT TO BE TRUE TO HIMSELF. I LOVE YAAAAAAAAA\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThis song is fukin great. It has so much meanin in it. You could learn a whole shit load from this song. I mean, he's basically tellin you to never give up on ANYTHING whether other people have a problem with it or not. And thats exactly wut hes doin. Eminem is tha shit man \t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nthis song is great but I don't understand what his list of rappers is for?  could someone please explain it to me? thanks\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nYea, the list of rappers has got to be explained. I just don't understand that part.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nWait now I'm reading the lines above it and it says: \"Cause I'm at the end of my wits with half the shit gets in \r\nI got a list here's the order of my list that it's in \r\nIt goes Reggie, Jay-Z, Tupac and Biggie \r\nAndre from Outkast, Jada, Kurupt, Nas and then me.\" Is he saying that he doesn't think their music should be released or somethin'?\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\ni agree with duck2k2, i think he is letting us know who he thinks are the good rappers\n\n\n", "comment_24": "\nNate Dogg makes any song. hes not all that great as a solo artist, but the best damn hook lyricist and voice ever. hes got an extrremely addictive tone to him. the march-like beat means he dont plan on stopping anytime soon, so get used to him being around.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nTo the comment about Nelly sucking: Damn right! I've never seen a bigger sell-out in my life.... but anyway, this song is tight.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nthis song fuckin kicks ass all u haters suck my cock\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nActually, I think the list was from a magazine article, listing the best rappers, and he was like 9 or 10...which is fucked up!  Anyway, that's what I heard, it could be wrong, but it makes sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nEminem is starting shit up for his next album. He is starting a rap battle between the best rappers out there. I think that is what the list is for. He won't quit till he is on top...\n\r\n\"Cause I don't really think that the fact that I'm Slim matters \r\nA plaque and platinum status is WACK if I'm not the baddest, so\"\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nThe list just means that those are the artist who are known to be the greatest rappers for now and he isnt part of that list because he doesnt think he gets the prop he deserves.....\n\n\n", "comment_30": "\ngreat song, i love the lyrics and the beat a solid song, eminem just keeps commin up with great stuff\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\ni love this song. eminem is by FAR the best rapper.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nIt's not often in the rap world that you hear a song that is motivational but Eminem certainly manages to put one out in this song.  The world is full of weak minded quitters who would just give up at the first sign od trouble.. I think this song is Eminem saying \"Fuck that, I'm never going to give up!\"\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nthis song kicks ass..this is the only rap music ill listen too cuz eminems dope\r\nthis is by far the best song off the cd\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI don't like most of Eminem's music.. but I love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nthe part where he lists the rappers he's saying that all these artists are ahead of him, but he doesnt care because so many people envy him\r\n\"But in this industry I'm the cause of a lot of envy \r\nSo when I'm not put on this list, the shit does not offend me \r\nThat's why you see me walkin around like nothin's botherin' me \"\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI looked up this sing just to figure out what his list means and I'm glad that I did, because I read a lot of good explainations. I think I agree with you BrandNewJersey. The list part is confusing, because at first he says he's \"at the end of (my) wits with half the shit that gets in\" and then he goes on to list rappers that I thought he liked...well, except from Andre from Outkast. But now it makes sense.\n\r\nThis song is one of my favorite on \"The Eminem Show\", along with \"White America\" and \"Square Dance\".\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nWho's the \"Bonnie and Whitney\" he refers to?\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nAt least he has the balls to say wat hes thinkin thats way cool.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nAs far as the list goes, I'm not sure who Reggie is, but he's hurled disses at Jada before (\"You put Jada on a track that's how much you suck\"), and I don't think he's fond of Andre. But it's a known fact that he looks up at Nas and Jay Z.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nthis song is the shit\r\none of the best on the cd along with squaredance and goodbye hollywood\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nwhat does eminem have against andre?? i never understood that. also on the song \"business\" he talks about it being him and andre's carnival. what does that mean?\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nOn Business, he's talking about Andre (Dr. Dre).\r\nOn Til' I Collapse, he's talking about Andre (Outkast).\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI love the beat to it...but I must ask why we are stating the obvious: he's going to keep going till he collapses. he says it himself:Ima rip this shit till my bone collapses\"\n\r\nalso...I think its \"till my high wears out\" not \"am i high-perhaps\"\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nwhen Antacular quoted that line from nail in the coffin,(\"You put Jada on a track that's how much you suck\")\n\r\nthey forgot to put the rest of the lines:\r\n\"You put Jada on a track that's how much you suck\"\r\n\"Dick in the industry.\"\n\r\nso no, he doesnt hate jada\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nsimply great...\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\ngreat song, though the fact that its next to 2 really similar songs on the album (when the music stops and say what you say) makes you pay less attention to the lyrics, and as a listener i preferred my dad's gone crazy.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nin reply to Antacular - He doesnt have beef with 3000, since they actualy toured together one time. (Check the HHC old issue when its about bizarres album, bizzy mentions it.)\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nIt's hilarious how the first verse with all the multis is correct and then they fuck up the simple hook.\n\r\n\"Am I high perhaps?\"\n\r\nhahaha.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\ni really enjoy this song, i like the begining where he is telling me to pull out my inner strength to accomplish what i wanna do.  I've listened to this song on occasions wehre i was gonna just fall flat on my face but then listend to what he is saying and pulled that strength out of me.  \n\r\nI also love the beat to it\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nThis song is cool. The beat is awesome as well. Very We Will Rock You which is awesome!\n\r\nDid anyone get that feeling when they first heard it and it just made you wanna sing Queen? :P It did for me\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nThis is a awesome song to workout to\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nThis is a awesome song to workout to\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nthe list is his top rappers, he is not trying to beef with anyone. I think the reggie is redman, cause his real name is reggie. He is saying that he doesnt care if people dont put him on his list of top rappers. Jadakiss is considered a top rapper by many people such as Q-Tip, so its not unusal to see him with the big names em says.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nSecond Favorite Eminem Song Next to Say Goodbye TO HollyWood. Definantly touching.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nHe comes out so RAW here, I miss this Eminem, this shit is powerful\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\naround the time of the release of this album/song, there were alot of rappers that were considered amazing, yet not so much, and Eminem makes his list, no surprise Jay-Z being number 2 behind the Redman, and then Tupac and Biggie are often disputed as the best, so them being 3 and 4 makes sense as well.  Andre, Jada, Kurupt, and Nas are all amazing as well, so it would be something Eminem would say.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nThis song is about not giving up.  It is used as a motivator, especially with the lyrics at the very beginning.  When he mentions those rappers on his \"list\" - Reggie (Redman), Jay-Z, Andre, Jadakiss, Kurupt, Nas, and then him - he is COMPLIMENTING them, not insulting them.  Eminem mentions right after that when he doesn't make this list, it doesn't bother him because people are very envious of him.  Ultimately, he says so many people have a damn problem with him.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nthis song is just so amazingly bad ass!!\r\ni dont care what anyone says\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\ndoes anyone here think that Nate Dogg was offended when eminem didn't put him on the list of the best rappers?\n\r\nnot sayin that nate dogg should be on that list (because he definitely shouldnt be) but do u think he was the least bit offended? haha\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nThis song gets me pumped.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nWasnt a huge M&M fan, but he has rubbed off on me, hes by far the best rapper to have ever picked up the mic, and I do not like rap, only Eminem.  This song is my fav eminem song, the list is about him not being mentioned as one of the best back in 02 I believe, and the list he mentions is a list from a mag and he also agrees with them as being top rappers, but he thinks he deserves his share of being one of the best.  Well he did it, and he is now the best known rapper and hes white, thats funny. Just like the best Golfer is black & the tallest b-ball player in the NBS is from China, lol now thats some funny shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nNBA not NBS, my bad....... As for jbizzle5, I do not think Nate got offended, thats business man regardless of how good of friends they are, you have to also think he never mentioned Dre, so people can make up their own conlclusion about who should and who shouldnt be on the top list.  Dont 4get this topic about him not being a top 5 rapper was back in 2002, if they had a pole now he would be by far number 1, Dre would be on there for sure and maybe Nate, Proof etc  This song does kick ass, cant stop listening to it.  Cant wait for him to comeback, which he will it might be a few years but he will be back with another CD when his daughter is in school and shit, you havnt seen the end of Eminem, thats a promiss!!!!  M&M kix A$$  Peace!\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nTo change \"back and forth\" to \"forth and back\" in But I don't wanna go forth and back in constant battles\r\nto make it work in the song and people to know what hes saying without missing a beat is incredibly smart\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nDAMN! niceeeeee\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nExact thoughts spudly, first thing I noticed listening to this song...\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\ni usually hate rap, but eminem is amazing and his lyrics are awesome.\r\nand the beat to this song is addictive.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nThis has gotta be one of the top motivational songs I have ever heard in my life. This and never 2 far are my fave songs by him. \n\r\nI know that this has got nothing to do with the interpritation of the song but if you can't figure that then your just retarded. \t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nok fool why would slim mention both Tupac and Biggie i mean they hated eachother and biggie was acussed of killin Tupac.\r\nam i missin sumtin\n\n\n", "comment_69": "\ndefinitely one the best rappers in the world! he is so smart when it comes to rhymes it just blows me away.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nyeah i think hes refering to the problem ppl have cuz hes a white rapper. hes saying that no matter what ppl say he will always rap until he collapses. meaning he will never give up despite what ppl say\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nEminem also sings about the government and how they use subliminal messages to spread the idea of new world order (which is more than just an idea)\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nYes reggie is Redman but I do not agree with the list. Em should be first followed by Pac. Then Redman and Biggie, Kurupt, Andre, Nas, Jay-z and then Jada. And I could actually think of a few other people that should be on there other than the last two. For instance Cee-lo.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nThe he fils like he never gets credit for some of his songs and the this others rapers are getting more credit\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nDon't know if this has already been said but anyone wanting to know about the list this is what he means. The list is all the people who have had 4 or 5 mics in The Source magazine because Em only ever got 3. Hes talking about getting publicity in the mag and how it made them.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\ncan someone explain these bars to me please? I can't really understand the message that Eminem is trying to convey in his lyrics:\n\r\n\"Cause when I am not, then I'ma stop pinnin' 'em\r\nand I am not hip-hop and I'm just not Eminem\r\nSubliminal thoughts, when I'ma stop sendin' 'em\"\n\r\n???\t\t\t\t\n\t\t\t\t\n\n"}