{"comment_0": "\nMy interpretation of this song seems to revolve around the idea of evolving one's own identity and breaking free from the socially accepted norm. People always get wrapped up in their own worlds and perceptions; sometimes we forget about the other people around us and their personal development. The first verse, \"let my roots take flight, Watch me from above like a vicious dove\" kind of eludes to the idea that someone is starting to make a name for themselves and those higher up on the social scale who can certainly be \"vicious\" sometimes, but seem innocent like \"doves\" are watching this underdog flourish (and anyone who has been to high school, I'm sure can relate). The next couple lines just reiterate this concept. The well endowed, popular, self-involved crowd can often miss out on the spectacular people around them who are beginning to shine. But the person on the rise doesn't care about what others seem to think. They can't \"blame\" the others for not seeing, as they've never tried to look before. The second verse with the lines, \"From your slanted view see the morning dew, Sink into the soil, watch the water boil\", I understand it as a request to open one's eyes in order to see the simpler things in life. Get out of your twisted, \"slanted\" view on the world, and just look at the beauty within the simpler things for once. The rest of the verse relates back to how if someone isn't truly looking around them, they miss out on other people, opportunities, and life in general. \"Nobody else can take [us] higher\" other than ourselves. We, as individuals, have the ability to bring ourselves up to the highest potential. We don't need others' approval to get ahead, to become what we truly are destined to be. We all tiptoe around people, step on eggshells and dim ourselves in order to fit in sometimes. But it's time we step up and take the social pedestals by storm and make our way to the top. One step or tiptoe at  a time. Don't \"fall asleep\" and let others step all over you and your success; instead \"tiptoe higher\" without \"letting 'em know we're coming\". You don't need to get a big, hot, egotistical head to succeed. If you take your time, \"simmer down\" and \"keep your head down low\", you'll surprise everyone around you. (In saying that, I just disagree with the \"keep your head down low\" lyric - I think you should keep your head held high! In this context though, it's referring to the sneaking manner needed for tiptoeing and going unseen). These are all just my own opinions. Would be awesome to get someone else's thoughts on this addictive tune.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI thought this was about a spy tip toe-ing around and stuff but the enemy base can't see him since they can't catch his eye  o_o\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI think that this song has a pretty straight-forward meaning and message. To me, these lyrics represented something or someone coming out of their shell, or standing up to something they fear. \n\nThey don't see me come, who can blame them?\nThey never seem to catch my eye but I never wondered why\n\nthis part of the song shows how the others treat the person. As a piece of trash that doesn't deserve their time. \n\nHey yeah, tiptoe higher\n\nThis part shows someone who is slowly (tiptoeing) up to the top (as in, standing up for themselves and getting more confidence about themselves)\n\nThese are only MY interpretations\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nOkay, so I saw a lot of long-winded and kinda odd explanations and I just wanted to put in my two cents.\n\r\nSo, the first verse:\n\r\nIn the morning light let my roots take flight\r\nWatch me from above like a vicious dove\r\nThey don't see me come, who can blame them?\r\nThey never seem to catch my eye but I never wondered why\n\r\nThis suggests to me that the narrator is an underdog in this situation. \"They don't see me come, who can blame them?\" is a reference to the fact that no one cares about him and what he has to contribute to the world.\n\r\nThe chorus:\n\r\nHey yeah, donâ\u0080\u0099t let 'em know weâ\u0080\u0099re coming\r\nHey yeah, tiptoe higher\r\nTake some time to simmer down, keep your head down low\r\nHey yeah, tiptoe higher\n\r\nThis sounds like there's now a second underdog in the mix. Whoever the narrator is talking to, they have the same issues as the narrator. And the narrator is telling him, \"Don't let 'em know we're coming,\" as in, We're the underdogs already so why let them know that we're going to come up on them and be greater than them? The line \"Tiptoe higher\" goes back to the line \"Don't let 'em know we're coming\" but it also would mean, Be as good as you want, show off, be better and do well.\n\r\nThen the next verse:\n\r\nFrom your slanted view see the morning dew\r\nSink into the soil, watch the water boil\r\nThey wonâ\u0080\u0099t see me run, who can blame them?\r\nThey never look to see me fly, so I never have to lie\n\r\nThis is going back to the underdog thing. I don't know exactly what the first two lines mean, but the second one is essentially: They don't pay attention and see me getting better, but I never had to tell them about my plans to be better than them one day.\n\r\nThen the rest of the song either repeats this or goes back to these meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\ni love this freaking song\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nTo me, this is about being underestimated.\n\r\n\"Tiptoe higher\", I think, is saying take your steps even lighter, because then they won't hear you coming. It's him saying, fine, underestimate me all you want, because I'll come up from behind and I'll rise to the top.\n\r\nPretty inspiring to me. I listen to it to jazz me up before I take a big test.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\n\"Vicious Dove\" -oxymoron\r\nDove is sign of peace\n\n\n", "comment_7": "\nDid anyone notice the sampling of the tone from Legend of Zelda, when you're down to half a heart?! Link certainly was a vicious dove... ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI think it says Higher!! Not Hey Yeah!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis song is about Ninjas.\n\nThey come in the morning, no one sees them come, they tiptoe. It all fits!\n\nIt all depends on weather it should be heard as \"Hey yeah, they don't let them know we're coming\" or \"HIYA!!!! Don't let them know we're coming,\" however.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI think that it is a song about routing for success and making sure no one gets in the way of you making your dreams come true and being successful. By using the word tip toe it could interpret that they don't want anyone to know that they are going for their dreams - a song about not giving up perhaps\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThe other comments on here are actually pretty insightful interpretations. The one line in the song I always love - \"Let me fall above, like a viscous dove.\" \n\r\nFall above - is to Rise, but with one caveat - like falling, nature will pull you, just in the \"upper direction\"\n\r\nViscous dove - Technically the dove is a sign of hope, fidelity or peace, depending on interpretation. However peace has been redefined by 20th century hippies as a lack of armed conflict, which really skews how to interpret this line. To me, the dove is a symbol of hope; peace to me is synonymous when defined as a spiritual state. An interesting fact is that many doves have actually earned combat medals in both World Wars.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nFor me, it is talking about being underestimated.  It is about using your anonymity to work your way to the top, to create your own future, and someday everybody who ignored you, or scorned you is going to look up and see you.  You are going to be there, successful, and they aren't going to have forseen it.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nwell im not posotive but im pretty sure this song is about the youth kind of like what others have commented earlier, i think that it is about like secretly making the world a better place because they are refering to tiptoeing and never falling asleep never giving up. this song is great i personally just luv it\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nIf you notice, he says \"vicious dove\" I personally don't think doves are vicious.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nTo me, this song is very intimate and even sexual in some parts. A relationship where they are sneaking around and are only themselves when they are together.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nFun with the thesaurus - another way to say a \"vicious dove\"?\n\r\nA \"foul foul\" lol \n\r\nSynonyms and homonyms oh my!\t\t\t\t\n\t\t\t\t\n\n"}