{"comment_0": "\nDoes anyone else get scared when she says \"I will hunt you down\"?\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nShe likes this guy a lot and wants him to touch her body...And to not ever tell anyone about it!\r\nI love this song, I repeat it over and over. lol\r\nIt's so fun to dance and act sexy to.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ni love the wendy william referrence and the youtube referrence\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nLOVE this song.\r\nI think its pretty self explainatory.\r\nShe wants to please this guy without no one bein all up her business, just between the two of them.\r\nahhh \r\nawesome single\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI thought they said \"any place to pee\" when they said \"in the place to be\".\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nwait...what's this song about? it's really deep and metaphorical. i don't get it.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nbest song to make out to\r\nvery sexy\r\nhaha to segould \"any place to pee\" thats gold :P\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nFav line to say to a guy\r\n\"I will hunt yoouu down *puuurr* . . \"\r\nlolz.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nhahaa, i adore this song ( :\r\n♥\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nthis song is sooo hot man. lol i'll touch your body alright!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nShe's met a guy, and although she never wants to see him again, she reallly wants to just have one night with him. But, seeing as she's a celebrity, she's worried he'll tell people, so if he does she'll \"hunt him down\"\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\ngood to know women think like this. very nice\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\n\"I best not catch this flick on Youtube\" - LOL, now we all know what Mariah searches for on the internet.\n\r\nGood song though, it's sexy and funky.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthis song is awsum =]\n\r\nits alwayssss stuck in my head\n\r\nits about how she likes a guy and she wants him to \n\r\ntouch her,have fun and yeaa l0l self explanitory\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nFucking pukefest\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nSuch blasphemy!\n\r\nGood song tho =)\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nLMAO best not catch this flick on youtube... there are like 5 different people with the Touch My Body Video clip... be careful, she has $225 million dollars to hunt you down with ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nthis song is about bodies and how to touch them\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nAt first I thought she said:\n\r\n\"Let me wrap my thighs\r\nAll around your FACE\r\nJust a little taste\"\n\r\nCause that would be awesome!!!!\n\r\nHow can she still be so hot!?!!?\t\t\t\t\n\t\t\t\t\n\n"}