{"comment_0": "\nTo me this song is a prayer. I know it's hard for non-Christians to accept but stay with me here. You might just find a bit of yourself in this. This prayer is from a person who is feeling alone, as most of Tyler's songs are.\n\r\nAs Christians, we are taught that we are supposed to build a relationship with God. We are told that God hears all of our prayers.\n\r\nHowever, it's obvious that while he was writing this song, Tyler felt disconnected from God, like God was standing just out of reach, leaving Tyler alone. I myself feel this often. That's why I relate to this song so much.\n\r\n\"Silent, in the trees.\" That's how God is described in this song. Tyler's lyrical metaphors are amazing. If you think about someone hiding in the trees, they would easily be able to see you, but would be hidden in shadow, and would be very hard to spot. The person in the trees would probably be purposefully avoiding contact with you. This is how Tyler feels God is toward him, watching, but choosing not to show himself. This is accurate for me personally. Whenever I try to talk to God, I don't get a response, and that's a bit frustrating to me. Prayer is supposed to be a conversation, and it takes two to have a conversation.\n\r\nAs for the part that says:\r\n\"And that's where I am, silent, in the trees.\"\r\nTyler is most likely alone at this point. But what really matters is that he is silent. He is alone with himself. Using knowledge from his other songs, especially Car Radio (which is a great song), we can infer what's going on here. In Car Radio, he says two important things that we need to remember for this song. \"I ponder of something terrifying, cause this time there's no sound to hide behind.\" and \"Oh dear, I don't know if we know why we're here; Oh my too deep please stop thinking.\" These two lyrics mean that when Tyler is in silence, his thoughts turn dark, and he is scared by them. He'll do anything to get rid of them, even stop thinking at all. It is likely that he would pray to God as an outlet for his emotions and a source of comfort. \n\r\nHe is scared by his thoughts, and his emotions almost overwhelm him; hence \"I can feel my death.\" and \"Why won't you speak where I happen to be? Silent, in the trees, standing cowardly.\" Tyler is close to the breaking point, alone with his thoughts. He is asking why God won't talk to him, even when he is at his weakest. He might even be fighting suicidal urges at this point.\n\r\nSo really this song is a prayer to God, asking him to just show himself already. Tyler is scared, and he is looking for a source of comfort and relief. He is frustrated by the fact that God won't respond to him, despite his faith. \"I want to know you, I want to see, I want to say hello.\" Tyler isn't holding anything back here. He is giving his full being to God. But we don't get a happy ending like we do in Ode to Sleep. The song ends with Tyler calling out to God in his panic. Hello? Hello? Hello? Hello? Tyler doesn't get what he wants. He doesn't get a response. He is still alone at the end of the song.\n\r\nThis song really is lyrical genius. It makes me personally wonder what happened to make him keep his faith in God. I need one of those moments. Major props to Tyler for taking my most difficult thoughts and making it into music. And major props to him for surviving whatever he was going through to make him feel this scared. And to you reader, major props to you for surviving. Whatever your situation, the trees are never as lonely and scary as they seem. Despite my struggles with faith, I believe that God is there for us. And so does Tyler.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI know this is way off but I like to interpret this for social anxiety, which I have. Saying I can feel you is kinda like thinking in your own mind that they're hovering over you making myself nervous.\n\r\nThe wanting to know you and saying hello is perfect for me.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThe religion thing throws a lot of people off, but I felt it was easy to relate the song to the story of Zacchaeus in the bible. The song to me signifies a dialogue between Jesus and Zacchaeus where Jesus notices him in the tree standing cowardly. Zacchaeus knows that Jesus see's him and says how he feels his breath and death. \n\nZacchaeus was a tax collector who wanted to see Jesus. But he was a very short man. Maybe the point that he is a tax collector in that time and age meant that he wanted to stay in the tree cowardly. Yet, he still wanted to see Jesus the great Nazarene! Ultimately, the song ends off by him giving this utterance of how he wants to say \"know\", \"see\" and \"say hello\" to Jesus. \n\nreference Luke 19 : 1-10\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI think the best way to interpret this is as a dialogue between the singer and God.  He is saying \"I know where you stand, silent in the trees\".  He then says he is also there.  Then the writer asks, \"Why won't you speak?\", obviously looking to hear an answer from God, and many of us know sometimes it is hard to hear God.\n\nHe says he can feel God: \"I can feel your breath\"\n\"I want to know you, I want to see\" is pretty obvious.\n\nThen ultimately, he just wants to say hello.  Just wants to see God.\n\nI don't think God is being compared to trees or anything, but just that trees are a part of his creation and is the example the writers used in this song.  I love this song and really speaks to me, as I have struggled throughout my life to hear God's voice when I need it most.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nIt's none other than Genesis 3:8-10 and the lyricist wanting to speak with God like Adam did in the Garden.\n\n\"And they heard the voice of the LORD God walking in the garden toward the cool of the day; and the man and his wife hid themselves from the presence of the LORD God amongst the trees of the garden. And the LORD God called unto the man, and said unto him: 'Where art thou?' And he said: 'I heard Thy voice in the garden, and I was afraid, because I was naked; and I hid myself.' \"\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI like to think that's its about lack of hope.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI feel like this song is about seeing who you want to be and seeing who you are.  But you don't know how to be who you want to be so you're stuck.  \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI think this song is about social anxiety. I have it and everything he says sounds like something I think when I want to make friends.\r\nFor example, when he says \"standing cowardly,\" he's scared of what people think about him. Another example is when he says, \"I want to know you\" and \"I want to say hello,\" he wants to know them as a person and he wants to say hi and be their friend.\r\nThis song always meant something to me but I never what it was until I analyzed the lyrics more today.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nSometimes when we're going through something hard we want God to show up in a thundercloud. Sometimes he's silent when we feel vulnerable. That's when we need to have faith. \n\nI think Tyler is portraying this feeling of his prayers bouncing off the walls. Even though he can feel God's presence he isn't satisfied.  Hello.\n\nStay Alive\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nTo me this isn't a prayer, I myself am not very religious. I feel it is as if in this song Tyler is expressing that he is hiding from himself in a way that is anxiety. We have doubts about ourselves and we easily hate on ourselves. When he says, \"Why don't you speak where you happen to be? Silent in the trees standing cowardly.\" I see it as him criticizing himself over and over again about how he doesn't act on how he feels. I feel that it is a metaphor when he says \"feeling his death\" that he is almost promising himself that he will fail with himself and his life. He is hiding from himself in the trees to show that he is also embarrassed/ashamed of who he is, this is why he is hiding in a forest (pun intended) to try to connect with his thoughts and who he is alone. When he screams hello he is finally accepting who he is. A lot of people poke holes in themselves constantly being mean to themselves when really they are awesome! Towards the end of the song he starts to stop criticizing himself and starts thinking to himself in silence in the Josh Dunn solo. He them makes up with himself and becomes in touch with his motions by screaming hello.\nIt could be a prayer but again, I am not a religious person so I find it hard to connect to. This is why I like TÃ\u0098P, a lot of people have their own opinions about how the songs mean to them, no one argues that their opinion is the best, we are just a crowd of voices sharing opinions baced on just a few words in a pattern. I find that fascinating.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nNo offense to the Christians on here but this is definitely not about God, or Jesus or faith. This is about Tyler who they do not know, this is Tyler Joseph expressing his self-doubt and social anxiety. The other standing in the trees is not a Christian figure as you all seem to want to believe, they represent anyone you want to approach but you don't have the courage to reach out to. This is not God, this is not Jesus, or any biblical figurehead. This is the fear of putting yourself out there in its simplest form. \t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nMaybe he's just looking for bigfoot. \t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nso, to me, trees is Tylers message to the listeners. he himself has gone through a lot so I feel like this is him saying that you, the listeners, are not alone. I wants to help and get through it together, but sometimes you can be so far gone, and he knows what that's like. he just wants to help and let us know he's there because he knows exactly what it's like to feel alone and scared like you're in a dark forest trying to run away from your problems or find peace. he just wants to find you and help you and let you know he's there and he knows \t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nTo me, the song is about reaching out to God during quiet times alone. My favorite part is, \"I want to see\" -- a common plea from Christians. We want to see Him! I picture standing outside, my arms raised high, feeling the wind (His \"breath\") and feeling the Holy Spirit (the \"death\" God gives us - death to ourselves), and calling out to God. I want to say hello.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nTyler Joseph himself said in an interview that this song is about finding who you truly are. He's talking about how himself at the moment and himself in the future are in the same body, but his future self won't talk to him and he can't say hello to his future self. He can't say hello, because he doesn't know where his future self is or what he looks like, but he know that version of himself is on the rise. He just want's to know who he will become. It's purely a song about trying to find your true self, and being so close yet so far away.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThe meaning of a communication towards God is very interesting and sounds right, but can it also be that he is trying to talk with someone he loved and who died, and whom face is fading,and he is sad bcz he doesn't want to forgot his existence ? It could also be someone that he knows is dead but that he didn't know, like some war heroes, and he would have knew him.\n\nThen I maybe not interpret very well and clearly (bcz it's less easy being french x) ), but personal interpretation is important too, even if it's not the one in the singer's mind ^^\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nIn my opinion, \"Trees\" is about death. The point of view is the person who has died, most likely in a tragic accident. Something unexpected. \"I know where you stand, silent in the trees.\" A loved one is looking in on the accident, or has just heard about it, and is in shock. So much shock that they can't say anything. \"And that's where I am, silent in the trees.\" Unable to say anything, the ghost of this person stands watching their loved one, next to them. \n\n\"Why won't you speak?\" The ghost is wondering about why their loved one isn't saying anything in response to their death. \"Where I happen to be silent in the trees.\" The ghost is trying to make the person realize that they are there with them, but it is no use. \"Standing cowardly\" The ghost is afraid that they have hurt their loved ones by leaving them on Earth.\n\n\"I can feel your breath\" The ghost is fully aware of their loved ones reaction to their passing. \"I can feel my death\" They are also aware of their own situation. \"I want to know you, I want to see\" This part references how the ghost didn't get to know the person as much as they wanted to before they died, and now they are going to get some answers. \"I want to say hello\" The ghost wants to let their loved one know they are there but cannot.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI think it's about My Neighbor Totoro. :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI'm pretty sure it's actually about Slender Man if I'm honest....\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nTo the above below comment. I disagree. I understand the analogy to God, but why would God hide? If anything it is referring to Adam and Eve hiding from God and God asking them why they are hiding and not speaking as He called for them in the garden. Also if we are speaking of God why is evolution even a part of the conversation/debate/argument? Evolution is a strict disagreeance of God's Word and is irrelevant to the song and it's message. I believe personally that the song is about how mankind sinned against God and hid themselves from God out of fear of punishment. \n\r\nI also agree with the above above comments referring to Zaccheus the tax collector wishing to see Jesus and then being afraid to speak and reveal himself to Christ because of the sin of his heart.\n\r\nAlso the reference to social anxiety if you look from a secular point of view but I always look at their songs as spiritually influenced because of their faith and previous works.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI find pretty amazing some interpretations. Like the one of Adam in the Garden or Zacchaeus. But I don't know, this doesn't seem to be one of those songs (even though the album it's called Vessel, which could show us how the human it's just a vessel for the soul).\nAll being said, I think this song is about the anxiety of trying to meet someone. The trees, in this case, could be the people. You can see it pretty easy in every verse. Except from \"I can feel your breath, I can feel my death\"... but this could be a metaphoricaly death, after a kiss. \nIf you are in love you may understand that.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\ni think the song can relate to a large multitude of things and can relate to whatever your dealing with in your own life, everyone has that one unreachable person or voice they long to connect with.\n\r\nto tyler this could be anything but based on what he has said a bout the bluryface album i believe he intended the song to be about this blurryface charactor who he was still dealing with. The song implys that he knows who and what bluryface is and this has been a long emotional jorney for him to figure out, but now he knows how does he connect, deal with and identify his altrenate self who represents his incecurities. It is a jorney of discovery, the woods represent the emptiness and the personal connection with blurryface only he can truly feel.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI see lots of suggestions referencing Biblical stories and I believe it is very likely at least one of those are right considering Josh and Tyler are of Christian belief.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nDefinitely a reference to Adam and Eve in the garden in Genesis.  More specifically, a song to reflect on our \"fallen\" state ie. sin nature yet still wanting to be connected to God even though his first reaction was to hide from God among the trees.  \n\nGod speaking:\nRead Genesis 3 and specifically look at verse 8.\n\n\"They heard the sound of the Lord God walking in the garden in the cool of the day, and the man and his wife hid themselves from the presence of the Lord God among the trees of the garden.\"\n\nI know Where you stand Silent In the trees And that's Where I am Silent In the trees\n\nAdam speaking:\n\nWhy won't you speak? Where I happen to be Silent In the trees Standing cowardly\n\nI can feel your breath I can feel my death (Adam is now aware of his sin nature) I want to know you I want to see I want to say Hello\n\njust my 2 cents worth\n\ngreat song btw!\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nTo me this song is about a person that is ignoring him. \"I know where you stand, silent in the trees, and that's where I amâ\u0080¦\" This part to me means like they know he's there but refuse to acknowledge his presence.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI see this song from a less religious standpoint. I've always seen the social implications of the song with real people, although I know Joseph usually has religious themes in his song.\n\nI see this more as him feeling alone and slightly outcast and seeing someone else that seems to be in a similar situation and he's intrigued by this and is trying to get to know that person. The visual I get in the beginning of the song is being alone in a crowd and feeling a connection to another person that is obviously feeling the same way.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI thought that this was a romantic song, and not about any religion at all.\n\r\n\"Why won't you speak\r\nWhere I happen to be?\"\r\nI take this as a boy falling in love with a girl, which is where he happens to be in the relationship, but the girl doesn't feel the same way.\n\r\n\"Silent\r\nIn the trees\r\nStanding cowardly\"\r\nI think that because the girl is there in \"the trees\" with him, he feels very awkward, scared, and shy around her.\n\r\n\"I can feel your breath\r\nI can feel my death\r\nI want to know you\r\nI want to see\r\nI want to say\r\nHello\"\n\r\nI interpret this that the girl is still not noticing him, but the boy really wants to approach her, to know her, to see her, and to say hello.\n\r\nI also think that \"the trees\" really is talking about the state of being single.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nSo interesting to hear everyone's interpretation of this song. I can particularly relate to the social anxiety aspect, but for me it makes me think of trying to connect with someone you've lost. I lost my brother 10 years ago. I'm not super religious but I do try to talk to my brother often. And that's what this song means to me. Trying so badly to talk to someone that's no longer here. I like what someone else about the fact that we can't see them up in the \"trees\" but they're always up there watching over us. I'm interested to hear what everyone else thinks. \t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nPersonally, I think some of you have it backwards.  I do not think it's man trying to talk to God, but God talking to Adam.  It fits perfectly.  \n\nThink about it like this:\n\n\"I know where you stand\"\n\nThat's right.  God KNEW where Adam was when he was hiding after eating the fruit.\n\nGod was there also, waiting for Adam to come out.  Not because He didn't know where Adam was, but because He wanted Adam to admit to his wrong doing.\n\n\"Why won't you speak? Where I happen to be...\"\n\nGod was waiting for Adam to confess.  \n\n\"I can feel you breath.  I can feel my death.  I want to know you....\"\n\nAs I stated, God knew where Adam was.  God also could feel His own death through Jesus.  Remember, in the Trinity God is three persons in one.  HE would send His son Jesus to die for our sins...The first sin was committed at this time, so He knew that Jesus would have to die.\n\nGod still wants fellowship with us.  That's where the \"I want to say Hello\" comes in.\n\nThat's pretty much the whole song.  Yes, it COULD be man seeking God, but I think it's God talking to Adam.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nThe Christian interpretation is right, as is the social anxiety interpretation. (Both could be the same thing, no?)  Any interpretation is right.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis song is definitely my favourite song by these guys.\nI don't want to make people who don't believe in God annoyed, but it really is about Him.\nIt reminds me of that quote from the book The Screwtape Letters by C.S. Lewis, where the demon Screwtape writes \"Do not be deceived, Wormwood. Our cause is never more in danger than when a human, no longer desiring, but still intending, to do our Enemy's will, looks round upon a universe from which every trace of Him seems to have vanished, and asks why he has been forsaken, and still obeys.â\u0080\u009d Tyler is looking around for traces of God, and he knows God is always at his side, but he can't see any visible traces of God. He longs for God, he wants to say hello, but God remains elusive. He is testing our faithfulness probably. God moves in mysterious ways... \n\nNow I think this song has a double meaning, which makes me love it even more!\nWhen Adam in the Bible sinned, he felt unworthy to walk with God, so he hid in the trees. That is what we metaphorically do. I feel when I sin (again and again) so undeserving to be called a Child of God, and there seems to be a barrier between us. I long to cry out to Him, and walk with Him again, but I am ashamed. I long to say hello, as whoever calls on the name of the Lord will be saved.\nI love this song so much, as it is so applicable to life.\nIf you're still reading, thanks so much for reading my first post. I hope you like with my interpretation :)\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nDoes anyone else think it is impressive how he makes us think this way? I honestly doubt he meant for this to be the meaning (could be possible though he is a genius). But he did write this song in high school after all\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI interpret the song as someone who is denying God, or distancing themselves from Him. Similar to the story of Peter in the bible, even though Peter still loved Jesus, he still denied him three times. Peter kept his distance while Jesus was beaten. He was scared and fearful for what would happen to himself if he stood up for Jesus.\n\nI think that many Christians at one time or another, especially at younger ages, try and distance themselves from God out of fear of what others may think of them, but still try to have a close relationship with Him. \n\"I know where you stand, silent in the trees, and that's where I am\" - God is always with you, even in your weakest moments\n\"I can feel your breath\" - You know he is still there and with you\n\"why won't you speak\" - It's harder to hear God when you are living in sin.\n\"I can feel my death\" - Someone knowing that if they live a life where others can see that they are living for Christ, they may be persecuted for it. This is also why he is describing himself as being in trees, away from where others can see him and describes it as cowardly.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI think its about internet friends who can never meet in real life due to huge distance. They like the same music, have the same social problems, help and encourage each other doing things, but can never meet in real life. They talk daily and fall in love. They feel: 'I want to know you. I want to see. I want to say hello'. It's tragic because it will never happen, 'Silent in the trees'. They make themselves suffer by falling in love, 'I can feel your breath; I can feel my death'. whatever this song means, it's sad. Whatevs interpretation you have it's about tragic shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI just want to say that I respectfully disagree with those who think that this song was written to go with the bible, or was written about God. I say this because in the twenty one pilots self titled album, there is the song Explicit Demand For Proof in which it features Tyler singing about how he doubts God's existence so much as to try to get God to harm him just to prove that he exists. \"Rain down, and destroy me.\" \r\nIdk, just my thoughts. \t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI don't see what this has to do with God. I think it's about liking a person. \"why won't you speak where I happen to be\". you think you aren't good enough to be talked to by them. \"I know where I stand silent in the trees\" you blend in with everything and they just don't notice you. idk. that's just what I think the songs message is\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nGod is living through the life of a primate in the trees.  Silent in fear.\n\r\nI know\r\nWhere you stand\r\nSilent\r\nIn the trees\n\r\nGod is one with the primate in fear but wants to speak yet can't.\n\r\nAnd that's\r\nWhere I am\r\nSilent\r\nIn the trees\n\r\nGod can't face his fear of speaking until he climbs out of the tree. \n\r\nWhy won't you speak?\r\nWhere I happen to be\r\nSilent\r\nIn the trees\r\nStanding cowardly\n\r\nThe primate begins climbing down from the branches.  God feels his old soul dying.  \n\r\nI can feel\r\nYour breath\r\nI can feel\r\nMy death\n\r\nGod evolves from being to being within the primate family.\n\r\nI want to know you\r\nI want to see\r\nI want to say\r\nHello\n\r\nConquering evolution by harnessing it in one word.\n\r\nHello\t\t\t\t\n\t\t\t\t\n\n"}