{"comment_0": "\nIf you watch the music video for this song it seems like this may have been written about their music career and how it will eventually die but he'll take pride in it while its still here.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\n\"Now the night is coming to an end, the sun will rise and we will try again\"\nHere the guy with suicide thoughts is talking. He's saying that the next day he will try to stay strong.\n\n\"Stay alive, stay alive for me. You will die, but now your life is free, take pride in what is sure to die\"\nHere his friend is talking. He's telling him to don't give up. He's telling him that he should be proud of the life he lived and what is going to happen, even if he's going to die.\n\n\"I will fear the night again, I hope I'm not my only friend\"\nHere the suicidal guy is talking. He'll be scared in the dark. He hopes that this night he won't be sad and won't commit suicide. He hopes that he's not alone.\n\n\n\nThis is just what I think...\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nSimilar to what people are saying but here it is...\n\n\"Now the night is coming to an end\nThe sun will rise and we will try again\"\nIn \"Holding on to you\" they say how usually your darkest thoughts come at night, so this person is feeling those negetive thoughts, but you must think positively--that you'll go to sleep and tomorrow will be a new day for you to try to be your best and to try to be happy.   \n\n\"Stay alive, stay alive for me\" Saying it to someone who feels like they want to end their life.\n\"You will die, but now your life is free\" You will die one day because you're mortal, But right now your life is wide open and full of possibilities.\n\"Take pride in what is sure to die\" Take pride in what you do because one day it will be gone (when you die or when your'e no longer able to do certain things).\n\n\"I will fear the night again  He knows that even though he's trying to think positively, there will be more nights he'll feel this hopeless. \n\"I hope I'm not my only friend\" Just hoping others will be there for you if you ever need them.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI love how desperately he's trying to keep everyone alive. \"Stay alive for me\" in this and \"friend please don't take your life away from me\" in friend please.\n\nI'd like to think he wrote it to anyone who ever had suicidal thoughts. Not a particular person. Sang it so softly too, I want to cry. \n\n\"sun will rise and we will try again.\" what a beautiful thing to say! No matter what happened today, there is always a brighter tomorrow. And WE. OMG. You are not alone. So soothing.\n\nThe night is used as a symbol for depression or simply bad thoughts. \"I will fear the night again.\" It's not clear whether if he fears because he worries about the depressed people or he is depressed himself too. I think the latter. In friend please he says \"till we both see the light\". There is an understanding, his familiarity with this concept takes the song to another level.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nthis song to me is definitely about depression/suicide/etc. it talks about how you are going to die in the end, so spend this time taking pride in what you're doing and be happy.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI find it very interesting that (depending on how you interpret them) the songs of the album Vessel are a struggle with himself and God, whereas Blurryface is a struggle with self.  Both tell deep stories of struggle.  That's all I've got ahah.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI always saw this song as if it was written in the POV of someone who had a suicidal loved one. \n\n[Now the night is coming to an end\nThe sun will rise and we will try again]\nSomeone special to them has tried to commit suicide, and they are now recovering\n\n[Stay alive, stay alive for me]\nPleading them not to end their life. \n\n[You will die, but now your life is free]\nWe all eventually die, but right now, you're alive. You are free and have your future ahead of you. \n\n[Take pride in what is sure to die]\nAgain, we all die. Take pride in who you are, and don't let your life go to waste. \n\n[I will fear the night again] \nFearing that they will take make another suicide attempt\n\n[I hope I'm not my only friend]\nIf they commit suicide, they will be alone without them.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song is the last song on their album vessel. The whole album seems to be about Tyler's inner darkness and how it consumes him, kind of like blurryface. Being that this song is the final song, I think it's about Tyler's ending of this darkness for a time. His light and dark are making a truce.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\n\"Stay alive, stay alive for me\r\nYou will die, but now your life is free\r\nTake pride in what is sure to die\"\n\r\nThe chorus is basically telling the listener that your life is precious and even though you may be suicidal, there is still so much out there so while you are alive, you should take pride in what you have because one day you wont have it anymore.\n\r\nas for the first line, \"Now the night is coming to an end,\" I believe just ties into the entire story of the album Vessel. Ode To Sleep, for me, takes place just as Tyler is about to go to bed but he stays up all night because \"the dark's not taking prisoners tonight.\" So the entire album to me feels like it takes place all through out the night and Truce is kind of his way of finally giving into his sleep and going to bed but signing off with the very important message of \"stay alive.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nHe's talking about us. That is a common theme in their songs. He rallies people together, and somehow makes \"We're broken people\" sound less like a sad cry for help, and more like a rallying battle cry to uplift and inspire us. He is well aware that the majority of their fanbase is mentally ill teenagers and young people.\n\n\"Now the night is coming to an end\" a lot of suicides take place at night. It is when people are alone with their dark thoughts in dark places. But you made it through another night. \n\"The sun will rise and we will try again\" 'we' is everyone. All the people in the world, all those that barely made it to morning, will do their best to make it through another day.\n\n\"Stay alive, stay alive, for me.\" This is Tyler pleading to us to stay alive, for him. In Guns For Hands, when he says \"I'm trying to sleep but I can't when you all have guns for hands\" is him worrying about us. Afraid for us. He cares about us. He stays up late worried about it. When he says this lyric, especially the second time, he sounds so emotional, so vulnerable, so desperate.\n\n\"You will die, but now your life is free\" so he talks about being free a lot, and to me, he means being free from yourself, being free from your mind, and all your problems. But I don't think that's what he means here. This is different, and is saying that you are already free. That your life is free. And the thing is, your life IS free. You can do whatever you want, whenever you want. I am not saying without consequences, but you can still do all these things. You can turn your life around, you can get better, you can do whatever you want. So, out of all the things you can do, don't choose to kill yourself. You WILL die someday, but not now. Death is guaranteed, so don't force it. Avoid it all you can. Because once you're dead, that's it. That's the end of the roller coaster. No. Live life all you can.\n\n\"Take pride in what is sure to die.\" You're sure to die, not now, but someday. Take pride in yourself. You've done so much in your life, even the little things are something to be proud of. Take pride in yourself.\n\n\"I will fear the night again\" He's knows it, he's accepted that his depression is a part of his life, and that it affects him at night. He doesn't let it control him, though. He's still hopeful. And if he'd killed himself when he was a teenager, look at what would be different today? Some of us wouldn't even be here. My point is, take a lesson from that. Your life is going to be amazing, but you have to be here to live it, and other people could even benefit from it.\n\n\"I hope I'm not my only friend\" He's feeling insecure, like we all do sometimes. I hope I'm not my only friend. I hope other people care about me as much as I care about them. I hope they don't just fade out of my life and leave me all alone. I hope I'm not really just annoying and all my 'friends' aren't just too nice to tell me I'm not theirs. I hope someone else will someday understand me, and that I'm not my only friend.\n\nThis is a genius song, and even though it's so simple, it's important, and I love it so much. \n\nIf you are reading this, stay alive. For me.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nWe all know how metaphorical Twenty One Pilots is with their songs. To me, I interpret the song as this:\nTyler Joseph is clearly talking about death and as doing so he is metaphorically comparing death to night and day. But he doesn't exactly look at death as a negative thing but more of something to take pride in.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI had a gf that was suicidal and this song made me think of her. Then another gf with cancer, \"Stay alive for me.\" has a special meaning to me. \n\nBut after reading the interpretation up top by omorf13, I realize that I had it all wrong.\n\nOmorf is totally right. It's so simple and clear.\n\nHe is singing to personification of his career as \"The\" Tyler Joseph.\n\n\"The sun will rise and we will....\" We'll keep trying for as long as it lasts\n\n\"you will die, now your life is free\" means he'll lose popularity and we'll be able to live a normal life.\n\n\"Take pride\" even though it's not going to last\n\n\"I hope I'm not my only friend\" after the fame has gone.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\n\"now the night is coming to an end / the sun will rise and we will try again\" he is talking about a friend he has that is suicidal and he's trying to help him stay alive. and sometimes his friend relapses so he has to keep trying to help him.\n \"i will fear the night again / i hope i'm not my only friend\" when tyler goes back home or away from his friend he has a constant fear that his friend is going to end his life. they are also tyler's only friend, so if he dies, he will have no friends.\n\"you will die, but now your life is free / take pride in what is sure to die\" this is why it's a truce. he's telling his friend that if he does die, he doesnt have to live with his problems but he has to decide if his life is that bad or if his problems are too big in order for him to kill himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\n[Now the night is coming to an end\nThe sun will rise and we will try again]\n\nHe tried to Commit Suicide the last day. But it didn't work. Then he had to go through the night. Then when the next day came, he'd try again.\n-------------------------------------------------------------------------------------------------------------\n[Stay alive, stay alive for me]\n\nHe's being told not to do it. To stay alive for the ones he loves, and who love him back\n-------------------------------------------------------------------------------------------------------------\n[You will die, but now your life is free]\n\nYou will die naturally when the time is right, right now, you have the freedom to live. \n-------------------------------------------------------------------------------------------------------------\n[Take pride in what is sure to die]\n\nFeel proud of what you've done in you life before you die, and make sure it dies after you\n-------------------------------------------------------------------------------------------------------------\n[I will fear the night again]\n\nHe scared of his insecurities and who will judge him during the night, because he can't suicide in the night, only the day\n-------------------------------------------------------------------------------------------------------------\n[I hope I'm not my only friend]\n\nHe hopes there are some of his old friends that appreciate him in the after life\n-------------------------------------------------------------------------------------------------------------\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nEveryone has tried to analyze the whole song, but i want to focus on one part. \"The sun will rise and we will try again\". I think that is my absolute favorite quote ever, or one of them at least. I'm atheist. But i know both tyler & josh are religious. And i think thats great! But me personally, i feel like they make their music for others to interpret in their own way. So, the way i see it is, he's talking about depression. He's saying that tomorrow is a new day. Tomorrow you can start over and try to be better than you were the day before. I've been dealing with depression for about 5 years now, and i got that lyric tattooed on my forearm. Twenty one pilots gave me a purpose. & i know this sight is for explaining lyrics, but i feel like this quote is something everyone can relate to. We've all done something we weren't proud of whether it be while depressed or just in general. This quote is saying that you can walk up tomorrow and wash all of that guilt  and depression off of you as the morning sun rises. Hes saying its a bad day, not a bad life. So, forget what you did the day before & try your best to move on and have a good day\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI don't have much to say because I agree with most of your thoughts, but if you know tyler you know that in his lyrics he tries to make a \"picture\" that other people can understand, with this I mean that he wants to make songs that we (FPE) can get related to.\nSo I think that when he says \"I hope I'm not my only friend\" I think that he not only means that he is scared of being alone but that there are more people like him and that feel the same, so he is not alone in this feelings.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI agree with a lot of these interpretations but I think we should also take into consideration where Truce falls in Vessel. Tyler starts off Vessel with Ode to Sleep which is about his demons that come at night and him trying to fight them. Truce is the last song on the album and I think Tyler definitely had a purpose in putting it there. I see Vessel as being a fight with his inner demons and the lines \"Now the night is coming to an end. The sun will rise and we will try again\" is saying that neither Tyler or the demons won the battle but the battle isn't over yet. All he can do for now is call for a truce.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThis is similar to the other comments, but a little different. I believe this is from the view of a friend, or someone who doesnâ\u0080\u0099t want the person to commit suicide. When it says â\u0080\u009cNow the night is coming to an end, The sun will rise and we will try againâ\u0080\u009d this is fr the outsider saying how the night is almost over and they could try to be happy again in the motioning. Then when it says â\u0080\u009cStay alive, stay alive for me. You will die, but now your life is free. Take pride in what is sure to die.â\u0080\u009d Is the outsider talking about how this person should stay alive for them. And that they will eventually die but they should take pride in the life they were given. â\u0080\u009cI will fear the night againâ\u0080\u009d is either the view of the suicide not wanting to have those thoughts again. Or the outsider  saying how they are afaraid if wheat this person will do in the night. Then â\u0080\u009cI hope Iâ\u0080\u0099m not my only friendâ\u0080\u009d is the person speaking that they hope their not alone in this.\n\n\r\nJust my thoughts\t\t\t\t\n\t\t\t\t\n\n"}