{"comment_0": "\nPersonally I don't like to use the phrase 'This song is about.....' as whatever inspired the lyrics be it cancer, heroine or personal demons it means different things to different people. For me this is one of the most powerful songs ever written, not just by Metallica, but anyone, obviously James Hetfield has drawn on personal anguishes but kept the source of the pain hidden making it easy for each and every one of us to relate it to the lowest point of our lives. \r\nWhen I first heard the lyrics I was amazed at how it explained exactly the pain I was currently feeling as if he'd got inside my head and put into words the absolute agony I was suffering, esp 'Hold me until it sleeps' suggesting that I'd get through but never exorcise the underlying causes. I hope i've made sense!! You can see why I need lyrics to express myself, I just cant project the same depth of emotion!\n\r\nEither way this is my favourite Metallica song and possibly fave song ever.\n\n\n", "comment_1": "\nI think this song represents a struggle with a darker side of a person, that was cause by a lot of pain, such as Jame's Dad's cancer. The lines seem to be talking about a horrible thing inside that,..\"hates you\" it could mean the person is lashing out at people, because of all the pain they hold inside.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nthough the song may have been written about his mother's heroine addiction or cancer or his father's cancer, or his battle with abusing alcohol, or what ever, this song is truly for the listener, in a sense that it is for your interpertation, like for however it speaks to you personally. here are some of the lyrics and what they mean to me:\n\r\nI RUN BUT IT STAYS RIGHT BY MY SIDE\r\nhe tries to escape the addiction but he cannot\n\r\nDONT WANT IT, WANT IT, WANT IT, NO....SO TEAR ME OPEN BUT BEWARE...\r\nthe point in addiction where you know you shouldnt do it and you know its bad, but the horrible temptation is there and you give in\n\r\nTHERES THINGS INSIDE THAT SCREAM AND SHOUT\r\ninside him he knows he is torn because of the addiction;this embodies his two sides, the sane and addicted sides, providing almost a bi-polarity\n\n\r\nso much for analyzing it...i love metallica anyway they come!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nWhen i hear the song it kinda sybolizes darkness and depression that lives in us. It never leaves and always has grip on you. (where do i take this pain of mine, i run but it stays by my side) Thats exactly how i feel.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\ni definitely think that the fact that jaymz was raised as a christian-scientist has a lot to do with the pain and religious anxiety in this song.  this song has gotten me through so much.  last summer i sat down with a razor blade up to my wrist.  as if from nowhere my stereo turned on skipped to disk 4 and to the track until it sleeps.  i dropped the blade, began to cry, and sang my pain out.  this song can carry your burdens.  it's like bleeding your heart with a leech.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI was thinking what HijoDelMetallica wrote. Clearly it's about the struggle to overcome an addiction (more generally, it could also refer to compulsive, destructive behavior).\n\r\nThere's nothing in this song to suggest anything regarding cancer, so I'm not quite sure where others are getting that from (other than some mysterious quote from James than no one seems to have a link to).\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nTo me this song is about dealing with depression. How a person struggles to break free from it but is consuming him.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis sounds like somebody coming down off of whatever...amphetamines, alcohol ect. They desperately want comfort but it's a false sort of comfort...they'll go right back to doing what they do once they feel alright, until then they sincerely want/need somebody to help them deal 'until it sleeps' I don't believe the person sincerely wants to be helped, even though they promise to reform (I'll tear me open make you gone, no longer can you hurt anyone) they're just seeking any form of comfort they can (hold me until it sleeps).\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nIt's about cancer.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nIve heard that this song is about the death of James's dad, i think from cancer.  But i think it also goes deeper than that.  It has to do with general interal pain and loss and the inablily to make sense or cope with it.  But if youve ever seen the video, which was based on a painting, you've seen the recuring scenes of Jesus's death and Adam and Eve's fall from grace.  To me it represents the redemption given by Chirst's sacrifice on the cross and the remorse of having sinned.  Its one of their best songs i think and has comforted me in tough times.  I cant get enough of it.\n\n\n", "comment_10": "\nIt is another dealing of Jaymz with the Christian-science. It was written by James to cope with the illness of his father by cancer. \n\r\n\"So tell me why you've choosen me ...\" \n\n\n\n", "comment_11": "\nWhy haven't many people wrote anythin bout this song I really admire the reason 4 why it was written and Im glad that this song was released 2 share wiv us his pain. This songs lyrics r superb and on the S&M version it's so powerfull a really gr8 song from a fantasic band nice1. Metallica rule\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nto quote james himself...\"once you're messed up...well...\"  hinting, you're messed up forever...so we all need something to comfort us to calm down the shit inside us...\"so hold me, until it sleeps\"\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI feel that James is just trying to cope with the fact that his father was chosen to have cancer. It is hard for everyone who goes through something like this, and I feel that by expressing how you feel about something like this can really help you 'make peace' with yourself. Great song, by the way!  :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nJust think about this for a second:\r\nI agree with the theory of cancer in James father, but read the lyrics and think of it as a persons fight with drugs and what it makes them feel inside.\r\n\"Theres things inside that scream and shout.\"\r\nWithdrawls from the drug may have meant, \r\n\"Hold me until it sleeps.\"\r\nThe drug may be referred to \"it\"  when they say,\r\n\"it grips you, it stains you, it holds you, it hates you.\"\r\nThe person is trying to quit the drug and does not know where to go and therefore says,\r\n\"Where do I take this pain of mine?\"\r\n\"I run but it stays right by my side.\"\r\nThis person gets the high once and then is addicted,\r\n\" You feed it once and now it stays.\"\r\nHis feelings about others while high,\r\n\"Theres things inside without a care.\"\r\nHe's desperate to get rid of the withdrawl,\r\n\"Tear me open...\"\r\nEven though the person has quit the drug the unwelcome feelings are still there (dirt referring to the drug),\r\n\"The dirt still stains me\"\n\r\nI would like feedback guys.  Give my suggestion some thought and let me know...Thanks\n\n\n\n", "comment_15": "\njus 2 question. Does james write all the lyrics?\n\n\n", "comment_16": "\nI couldn't agree more w/brettlessard. Been there....done that!\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nYes he does 4saken. Well he did...on the new album he doesn't.\n\r\nI think this song is about a struggle to cope with the pain after the ones who you could always take your pain to and be comforted by (i.e. parents) are gone. When you're little you always get comforted by your parents, you take your pain to them.\n\r\n\"Where do I take this pain of mine?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI always thought it was about drugs as well. The line \"Don't want your grip\" kinda indicates that, and the line \"So wash me until I'm clean\" seems to imply that as well. I dunno. Also the bit where he's saying \"So tear me open\" kinda reminds me of when i've been feeling a pain so strong that I feel like being torn open because that would divert the pain. I think it's about drugs anyway. Although the cancer theory seems likely.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI also think that he is talking about drug use. It's talking about how you get so addicted to drugs that you will run from them, but yet they will be beside you staining your life.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nyea, it sounds  a lot like drug use, just listen to it and think about it that way, it's easy to see scenes about these drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nHeHe its just a kick ass song man :) thas all that matters\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nHeHe its just a kick ass song man :) thas all that matters\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nThis was the last new Metallica song I liked.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis song was entirely about James' dad, not just his cancer but all the things he did to Het, and all the emotions he's come to terms with ever since he died. He lost both his parents to cancer, unless I've been led astray in my knowledge of Metallica by a trusted source, and wrote songs about both of them. Angry songs, filled with deeper pain. The one about his mom was The God That Failed. This one, not so much about cancer as inspired because of it, is as I said about what his dad did to him when he was younger. The video, on the other hand, is about/inspired by a painting called The Garden of Earthly Delights, which in actuality isn't about Adam and Eve at all. It's a great video, my personal favorite. Oh, and that reminded me... on another post for a different Met song, someone said \"But what video of theirs isn't about the lyrics?\" I think it was Fuel... well, there's your answer.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThis song is awsome, its really soothing.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nMy favourite Metallica song at the moment.. It's.. Amazing. Both song and video is a piece of art.\n\r\nAs other people has written, James wrote this song, when his father died (or so I have heard). It's a very emotionel song, and you can easily feel the pain, James felt at the time.. Besides from his father dying, his alchohol abuse was also very bad at the time, so of cause he went through a lot of s**t at that time..\n\r\nI really love this song.. And I just can't wait to see the 'Tallica boys.. Only five days to go.. :D\n\r\n- By the way.. I'm from Denmark, so my english spelling isn't that good. Hope the above made scence. ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nwhoah, dude! i totally agree with brettlessard!\r\n(soz, thats all i can say!)\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nthis was the song that got me addicted to metallica. go on them\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\ni did get bored of this song but still kicks ass!!for me its about losing the faith in everything and consatntly being assaulted by painful memories.james is sayin GO AWAY to all those memories and thoughts\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nAlthough I think that this song is about his dad's cancer....I although would like to think that's about the inner pain that he feels. It can be the pain caused by drugs, cancer or even maybe the lack of faith in others,,,,,\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI think that this song is just about the dark side all we have inside of us.There's nothing clear to think it's about drugs or cancer.It's just about the evil inside of us.\r\nGod Bless You all!!\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI dont know what has happened to James as far as scenario wise for this song to be made but hes talking about whats called in spiritual teachings as the \"pain body\".  The pain body is when some scenario comes up it can be as small as a simple thought, to a breakup, to someone dying and when its activated it takes alot of time to heal from it because it stresses you out.   I believe this is what hes talking about hence the fact hes talking about a pain that grips you and wont let you go.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nCancer... Drugs..... It's about pain... pain everyone can feel... some ignore... others can't.... pain is pain..... pain hurts... pain eats away at you..... pain is always on the inside.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nactually all other reasons that say this song isnt about cancer are wrong. its about cancer. staright from james's mouth. read the book so what. its in there.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nJust cause this \"book\" says that James wrote these lyrics about his father's cancer, it doesn't mean that these lyrics are restricted to that one meaning.  To me, this song is about assuaging the cries of your inner demons that \"grip you,\" \"stain you,\" and \"hate you.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nUntil It Sleeps - Metallica \"And the fear still shakes me So hold me, until it sleeps\" that line.. I love it. It's sensitive and sweet, and it makes you just wanna give James a big hug.despite that he's ugly.... a) because his dad has/d cancer and b) the line is just so... yeah.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nCan someone settle this for me and my brother? The guy on the cross is actually Kirk, isn't it?\n\r\nApart from that, I agree with idungotnosn. James may have written the song about his father's cancer but I believe it's also about drug addiction. And if you watch the video, certain band members act as though they are tripped out. Lars screaming and looking generally irritable and Kirk scratching his nails over his chest and stomach are common symptoms of speeding.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI think this song was written about a few of things that have been discussed earlier. But I prefer to use the song for something more relevant in my life. I was abused as a kid, so with lines like, ''So tell me why you've chosen me, Don't want your grip\r\nDon't want your greed,'' Is to me the real pain of wanting to forget it, but knowing that you never will. Other hard hitting lines are. ''Now tear me open make you gone\r\nNo more can you hurt anyone,\r\nAnd the fear still shakes me\r\nSo hold me, until it sleeps''\r\nWanting to just feel some comfort for what happened until you die.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nSorry I know I mentioned this before but I'm not sure if I made myself clear.\n\r\nIn the video for this song, there is a guy on a cross. Is the guy Kirk or is it someone else?\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nYes, the guy on the cross is Kirk. Can anyone explain the meaning of the video clip?\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nIt sounds alot like drugs. And I would know cause I've been there. Almost all of the lyrics can relate to drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nThank you GATE 9 ORIGINAL for clearing that up for me. :D\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nThis song is very powerful... When i was desperate i heard this song over and over again... i never get bored listening to the lyrics. \r\nEnter Sandman it's not about drugs.. James Hetfield said tha it's about cancer.. I didn't understant the meaning of the videoclip yet\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\ngreat song! I love the video!\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nthis song is great!!! so is the video...and by the way  AVeryGreenHell James Hetfield is fuckin sexy\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nIt seems to me, the song is talkinng about his mom and also dad, who both died.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nthis song means something to me, cos i have a dual personality, it is a very special song and i dont beleiv it is given adequet prise. EVERYONE WHO DON'T LIKE IT CAN FUCK OFF!!!!!!!!! dkujckcukuk adam >.)\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nahhh to me its about pain....pain that wont go away. whether this be in form of cancer, broken relationships, watever it is from, the pain makes you messed up inside and it wont go away....kinda like saying youll never forget the pain. also, just because james meant it to be about cancer, everyone who hears the song can take from it what they will, there is no 'right' of 'wrong' of what the song means to different people?\n\r\nTHIS SONGS ROCKS\n\r\npeace out\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\non furthur thinking, it sounds almost schitzopgrenic (dunno how to spell) but like,,,james is saying that theres a bad side to him, that kinda sumtymes threatens to take over, hurt people. he sounds scared almost....and its like this dark bad side of him is all the bad things hes done and the bad thoughts people think about him.......\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nthis is a great song, but the video is kinda trippy what the fuck is the with giant frog thing eating the red person?\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nTo answer a question from a good while ago (sorry, I'm a new member so I'm a little behind) James wrote all the lyrics up till the new album...except one song.  The lyrics of \"To Live Is To Die\" were written by the late, great Cliff Burton and used in the song in memory of Cliff\n\r\nThe song to me is about dealing with your inner demons, which are never easy to fight by yourself.  The thing is, the song means one thing to the writter and another to the listener, so find your own meaning to the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\njames has said himself that the song itself is about cancer and how it killed both of his parents. Being of the Christian Science faith, neither of them sought medical treatment. Believing that faith and God would heal them, both of his parents succumbed to the disease.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nthe song also kinda describes demon possesion \r\nThere's things inside without a care,\r\nAnd the dirt still stains me\r\ndirt = sin or evil and it all fits\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nIt has nothing to do with cancer!!! Its about drug withdrawl\r\n\"I run but it stays right by my side\" He is dealing with the withdrawl \"You feed it once and now it stays\" Hes addicted.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\ntoo lazy to think about what this song means but its pretty good, possibly the only decent song they've had in the past 10 years besides I Disappear.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nthis song is about the devil and how if u sin once the devil stays with u(u feed it once and now it stays)\r\nand how hes sinned and he is asking jesus to forgive him(and the dirt still stains me so wash me until im clean)\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nI feel this song is about anorexia and the struggle to deal with the torture of it...it means alot to me..\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nI think this song is about human instinct or a desire that cause a deeply religious person suffering. Christianity just like Buhddism sees instinct as a sin. Each of us gets hungry or needs sex, home or even a house and thus is greedy and dependent on material stuff. When we don't get what we desire, we become sour, selfish and angry, thus 'evil'. The hero of the song is angry with the desires but can't do anything, because they are part of him. To destroy them would mean to destroy his material self. Too philosophical song. Yet very lyrical. In my opinion what metallica wanted to say: it is good to resist (up to a certain level) any desire or selfishness.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nthere are a lot of ways to interpret a song. especially when the song we're talking about is like this one. it talks about pain and the sense of loss. you could lose someone you love or even yourself. i used to listen to that song after a rejection. it's therapy.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nthe song is about cancer but the anger it brings out in a person who is reluctant to have it\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nThe meaning of this song has always been very clear to me.\n\r\nWhile it may have been inspired by the death of Jamesâ\u0080\u0099 father, it is clearly written from the point of one of  Christâ\u0080\u0099s followers with some lines being sung to Christ, and some to Satan.  \r\nThe lyrics are the pleading of one of Christâ\u0080\u0099s followers to â\u0080\u009chold himâ\u0080\u009d and give him strength until â\u0080\u009citâ\u0080\u009d sleeps.  The â\u0080\u009citâ\u0080\u009d is the devilâ\u0080\u0099s temptation.\n\r\nWhere do I take this pain of mine.\r\nI run but it stays right by my side.  â\u0080\u009cThe pain of sinning and being tempted by Satanâ\u0080\u009d\n\r\nJust like a curse, just like a stray.\r\nYou feed it once and now it stays,  â\u0080\u009cSin.  Once you sin, the next is even easier to commitâ\u0080\u009d\n\r\nSo tear me open but beware\r\nThere's things inside without a care,\r\nAnd the dirt still stains me   â\u0080\u009cDirt.  Sin that has stained his soulâ\u0080\u009d\n\r\nSo tell me why you've chosen me  â\u0080\u009cSinner asking Satan why he has been chosen for temptationâ\u0080\u009d\n\r\nNow tear me open make you gone  \r\nNo more can you hurt anyone,        â\u0080\u009cTelling Satan that he has been savedâ\u0080\u009d\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\n\"i definitely think that the fact that jaymz was raised as a christian-scientist has a lot to do with the pain and religious anxiety in this song. this song has gotten me through so much. last summer i sat down with a razor blade up to my wrist. as if from nowhere my stereo turned on skipped to disk 4 and to the track until it sleeps. i dropped the blade, began to cry, and sang my pain out. this song can carry your burdens. it's like bleeding your heart with a leech.\"\n\n\r\nLMAO XD!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nI love Metallica, but I think this is one of my all-time favorite songs of any band.  James' voice just has such pain in in when he says \"tear me open, pour me out\".  I know it's about cancer, but I think anyone who's ever hated something about themselves can relate to it.  LOVE this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nThis song is about the death of James's mom, she died from cancer.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nThis song is one of their best in my oppinion.\n\r\nThe song is about his mom and dad dying from the cancer that ate away at their bobies. It's also about their beliefs: christian-scientist. That if they prayed their cancer would be healed, but instead killed them.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nthis is probably, by far, my all time favorite metallica song!\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nthis song is one that relate to many people in general I dont know what they were thinking of when they wrote it but I think it has to do with inner torment that you try to escape wheather it be on the outside world or your own personal suffering I think of mental anguish when I here it I think of someone in a personal hell and they cant get out judging not only the song but also what they potray in the video\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nI can see how this song would be about cancer and I can also see some of the other suggested meanings but for me personally the lyrics reflect my own anger. Sometimes it feels like this beast inside thats sleeping and when it wakes, well, things aint pretty. Hope you all see what I mean here, just think of a deep dark anger when you're reading the lyrics and you'll see what I mean.\n\r\nAnywho, a good song should always be open to many interpretations by different listeners, so I'm not knocking anybody elses ideas, this is just what I get from the song!\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nI think it's talkin about drug addiction and how it craddles u and makes u feel good and pushes his demons down but in the end it bottles up the demons and if u pull 'em out or wen the bottle gets full the demons are powerful and can consume u.it's a song of moral value to stop doin drugs before they consume you\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\ni suffer from an eating disorder and my friend who also does, her mom showed me this song. And she said that it seemed like parts of this song were from the point of view of the parents of a child with an ed, the sufferer and the ed itself. it was distubing. ofcourse this song could have many other meanings aswell.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nAccording to online sources, James's mother Cynthia (or his father, whichever) died from a cancer that could've been cured, but due to his family's belief in Christian Science, the cancer was not treated. A lot of songs, like \"The God That Failed\" and \"The Struggle Within\" are James's attitude towards God, since he was raised in the religion of Christian Science, it seems that he believes that is what Christianity is.\n\r\nSuch is not true.\n\r\nOne of the four Gospels was written by the disciple Luke (or St. Luke, to some of you). Luke is known as \"The Beloved Physician.\" He even used medical terms when writing the Gospel. What did physicians practice, even that far back? Medicine.\n\r\nSo one of the disciples of Jesus Christ practiced medicine. I sure wish James was raised in better circumstances and didn't have to lose a parent to a curable disease because of such a flawed religious practice.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nJames said it was about cancer, but I really think it's about addiction.\r\nEspecially the line: \"Just like a curse, just like a stray. You feed it once and now it stays\". You give in to \"only one\" drink, and it spirals out of control.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nyup true this song really is about cancer. james said that this song was written after his mom died of cancer. i understand the lyrics completely it makes perfect sense especially in the lines where it says: \n\r\nSo tell me why you've chosen me\r\nDon't want your grip\r\nDon't want your greed\r\nDon't want it\r\nNow tear me open make you gone\r\nNo more can you hurt anyone,\r\nAnd the fear still shakes me\r\nSo hold me, until it sleeps\n\r\nthis means that cancer chooses its victims and holds on with a strong grip and u feel nothing but greed and nobody wants it and that sometimes wen ur greed u feel like u wana b cut open so that it can be gone and once they cut u open ur scared if its still there. THIS ANOTHER METALLICA CLASSIC!!! I LOVE THE SOLOING IN THE BACKGROUND THAT KIRK HAMMETT DOES IN THE BACKGROUND IN THE VERSES. I ALSO LOVE THIS SONG!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nI seriously thought this was about drug addiction, and trying to stay clean after recovery. But...maybe not.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nIt's actually about his mothers addiction to heroin.  Im surprised no one knew about that...\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nThis song is about cancer.\r\nJames' mother died of cancer after refusing treatment due to her religion.\r\nThis and \"The God That Failed\" describe how James feels about the decisions his mother took and the cancer that ultimately ended her life.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nPeople can't decide if it's drug use or not. I personally think it is about his fathers death, and when he's trying to get over it. The song is so strong and also relates to christ dying for sins, like the lines and the dirt still stains me so wash me until i'm clean. Whatever it is about, I think its one of Metallica's best songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nthis song is defently about cancer there is no doubt in my mind that it is about cancer and i think im gonna get a tatoo saying \"until it sleeps\" because my grandma died and my other grandmother is dying from it now\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nThe song is definitely about his father dying from cancer. Having said that, I think the song can relate to anyone struggling with any kind of pain. I never thought to listen to the song a whole lot until fairly recently, but now I can't stop listening to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nA very beautiful song. I love the hard, thrash metal Metallica, but wow some of their Load/Reload even some Black songs (Nothing Else, Unforgiven) are just beautiful masterpieces of music.This is why I love Metallica so much. I can listen to some of their stuff to go get absolutely jacked up out of my mind, or I can listen to songs like Until It Sleeps to relax and reflect on life. God bless Metallica.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nThis song somehow reminds me of unrequited love.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nWatch the video, It's about sin. Like wanting to go f*** all the whores downtown.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nThe song is about is mother dying from cancer and taking anger out on his father. Thats what he wrote the song about. Meaning there are several. I take from it is that over time keeping everything inside takes that person over the edge  and cry for help (tear me open and poor me out) telling someone everything and try look for closure (until it sleeps)\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nThis song is obviously how dark forces can take over and influence a person's soul. The music video has a ton of symbolism in it - serpent and the apple (garden of Eden anyone?) A demonic figure (minotaur) holding Eve which represents an evil force possessing Eve. \"The dirt still stains me\", means the evil and darkness staining the soul.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nThis song Hefield wrote as a way to cope while his father was battling cancer.  He is discussing the physical pain his parents went through during their battle with cancer (they were both Christian Scientists and didn't believe in taking medications) as well as the emotional pain he went through watching them suffer.  For those who don't know his mother died from cancer when he was 16yrs old and his father died during the \"Load\" tour in 1996\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nit's about a pain that is cozinh him some person, who entered unexpected in his life (i can relate to it) so he probably fell in love, the person opened a heart of his, and now like always the person broke his heart, and he is struggeling with this pain that he cant runaway from..the pain comes periodically, unexepected with no certan reason, and evan the heartbreake happend long time ago the pain keeps coming back, and he hates it, coz he cant find certain reaso why its coming back, why can't it disappear once for good...\n\n it's a classical song about human pain cozed by love, fear of love and all the pain that itz cozing him..love is a catalyst, it just cozes unexplainable pain, fusion of a bad emotions(fear, pride, hate..) that sudenlly keeps coming in to you and of course you hate it, you hate the person who has that much power over you, and you cant do nothing anymore about it\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nIt's about someone's battle with cancer.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nPersonally, it could apply to deep grief over losing a person very close to you. The pain \"sleeps\" eventually. It never goes entirely away, but it lessens or \"sleeps\". And a well-meaning (or ill-meaning) friend can easily wake the pain back up again by saying the wrong thing. That is my personal experience anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nJames Hetfield wrote this song because of his mother. His mother Cynthia Hetfield died by cancer in 1979 when James was 16 and then james went to live with his older brother david.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nThis song sounds like drugs, but I wasn't interested until the MTV of my region says that the record studio or something receive a treat of bomb after the releasing of video. I 'm not following any religion but feel attracted to the study of it. Meanwhile I couldn't find the exactly meaning of the video, but very symbolic isntead,my mother feel it offensive to their beliefs so I find it pretty interesting.So video seems satanic or evil to say something.Fell like video linked to video somehow.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nThis song sounds like drugs, but I wasn't interested until the MTV of my region says that the record studio or something receive a treat of bomb after the releasing of video. I 'm not following any religion but feel attracted to the study of it. Meanwhile I couldn't find the exactly meaning of the video, but very symbolic isntead,my mother feel it offensive to their beliefs so I find it pretty interesting.So video seems satanic or evil to say something.Fell like video linked to video somehow.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nI believe that this song is about James' mom's cancer (as evidenced by the description on load) and it's about how there are evil things inside of James. \"No longer will you hurt anyone\" this event probably led to James being a douche, which he was for a good bit of the 90s, and it follows the theme of bleeding me where James just wants to get out the bad. He tries to kill the bad inside him, to \"wash off the dirt\" and as a result he ends up fighting, but he doesn't know where to put it,so he takes it out on people close to him, this is probably why jason left, his mom died, and he had no control because there were no doctors, so he tried to control him to protect him,\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nI love this track, we all have something nasty we know is bad for us but have to have it at any cost to our health or liberty, from the person that cannot stop eating junk food to the vile abuser who cannot stop themselves hurting others. It's a nice powerful song about \"habit\" and the mental reward system hardwired into our brains.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\ni have personal demons all sides of my family fighting rough childhood rough teenage years this song comes to mind when i feel lower than dirt so i think until it sleeps covers all that ranged of demons\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nAs several people have said what it means to them, and wow, so much creativity! Being a deeply spiritual person, but not drawn to any specific faith, the video really stood out. An innocent person being made to pay the price. All I'm going to say is I'm glad to be alive in the 21st Century and not during these troubled times when even children are butchered. But we still have a long way to go to end human suffering,,, \t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\neverybody knows the meaning of the most of the metallicaÃ\u0082Â´s songs.   Ã\u0082Â´the comun factor is the calling to fans to fallow the devil. because thats something metallica owes to devil.  \t\t\t\t\n\t\t\t\t\n\n"}