{"comment_0": "\nMaynard is a man who know much about psychology, and I totally agree with him on this one. The civilized mankind today is overprotected. Yet we feel unsafe, and most of all bored. To keep our mind of things we watch television and read the paper to hear the news from this world. \r\nWhat Maynard wants to say is that: WHY IS THE MOST INTERESTING STORIES IN THE NEWS THE SAD AND HORRIBLE ONES? People feel safe when they hear about other peoples deaths. And thet need to hear it. It is something satisfying about it in a non-maschistic way. Don't get me wrong here... we aren't vicous killers. \r\nThis world is filled with violence. We hate it, but we love to hate it. \n\r\nThink about it... When you see a newspaper with a big fat title \"Stabbed by husband.\" you don't go like \"hm... who cares.\" You grab it, buy it, read it, and go \"I'm glad that wasen't me.\" og \"pfft! what are the odds of that happening to me?\" Then you go on with your life with one less worry. \n\r\nViolence is like pornograhpy for your mind. \n\r\nI hope you understand.\r\nand please don't get for a murderer, or a suicidel dumbnut ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nBrainNevelle, if you just want to hear Maynard sing without the other 3 members then you aren't a Tool fan. Tool is one of if not the best band out there because of all it's members. Danny Carey may be the best drummer ever, and without his complex and powerful polyrythms Tool and Maynard would have no backbone to their songs. Same goes for the gripping and thundering guitar riffs and baselines by Adam Jones and  Justin Chancellor. You have no right to call anyone a fake fan.. if people are true fans, they listen to the whole band. Not just Maynard, don't get me wrong, I still think he is a god, but you have to get the whole picture. If Maynard wanted himself to be more prominent he would have done so. You probably have no appreciation for songs like Reflection on Lateralus.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nRegarding what BrainNeville has pointed out, I also agree that vocals in the song are on the background. But this is not something new for Tool at all. There are many examples where Maynard used his voice like an \"instrument with words\". My examples would be Reflection, You Lied, No Quarter and parts of other songs to. \n\r\nInterviews have also shown that Tool has aimed to use Maynard's voice like an instrument via effects and tricks. My counter argument is that we have to stop idealizing Maynard which makes us unable to concentrate on the music that these 4 talents make. \n\r\nThis is teamwork and why do we always have to see an idol, a frontman. Maynard is no Kurt Cobain. It's his style. Every single individual in Tool sees that all the other guys have suplendid talents and they like to present the whole picture. I appreciate and agree that Maynard has a extraordinarily divine voice and love listening to him like I'm hearing messeages from above. \n\r\nHowever, due to the reason that Maynard is not a frontman in Tool, and should not be, Maynard's voice should not override those of others. And still, I believe there are adequate (although when it comes to Maynard I never get enough) songs to hear him. \n\r\nI hope this new album will be another chance to hear Maynard's voice both infront of all others and as an instrument by himself. I take it either way.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis is more down to earth than usual from Maynard. It hits hard because it is not about hidden meanings. At first, the lack of mystery is almost disappointing for a die-hard. But the song itself is devastating and true tool. The meaning, as I see it: we consume information about the world's tragedies like vultures because, in part, it satisfies a need of ours. Why can't we just admit it? Because this vicariousness is horribly shameful. So we (la, la, la) lie about it. Maynard tells us to accept the truth, though, he really doesn't need or want to 'say it all again'.\r\nThis is a song about a human need that Maynard thinks is timeless ('so it is, so it's always been'): living vicariously off other people's tragedy. He does not hope for change, he demands recognition of this ailment. Because maybe we really should be ashamed.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think that this song is about the hypocrisies of today's society. How everyone is entertained by death, as along as it doesnt effect them. \t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nSimple enough, as human beings we watch others to judge our own behaviour in comparison. The problem is that in today's 24 hour media society we've become obsessed with the miniutae of watching others suffer but we can do it \"from a safe distance\" and no one needs to know how much we enjoy it.TV, newspapers, websites, it's all there, all the gory, nasty detail we could ever want to revel in and with no strings attached! You ask anyone if they enjoyed it and they will all say, \"Oooh no! It's disgusting and tragic. I can't understand why.\", just admit you enjoyed watching someone else suffer and be thankful it wasn't you!\n\nBrilliant track.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nWhen this album first came out I was listening to Vicarious while driving. I was stuck in traffic behind a taxi that had an advertisement on it for an exhibition called \"The Human Body\", where various aspects of the body are studied and put on display, like muscle/bone structures, skin fibres, vital organs etc etc. Funnily enough, the photo on the ad was very much like the cover of Lateralus, with the photo of a human being illustrating the layers beneath the skin.\r\nWhat really caught my attention were the words in bold italic underneath the image: \"REAL BODIES ON DISPLAY\"\n\r\nThis song really made sense to me after I saw that: I could picture people at the exhibition bypassing all the fake plastic skeletons, respiratory system drawings, etc etc, and heading straight for the \"real bodies\" where they would stand in droves and \"stare like zombies\" at this dead body on the table. \n\r\nI could also imagine that people \"wouldn't give pause\" to even consider going to the exhibition until they learn that real dead bodies are on display. And the fact that the advertisers found it necessary to even mention it on the ad as if that makes the whole experience more \"appealing\".\n\r\nBut the funny thing is: I am no different. I would have been there front row centre, looking at the dead body. Even though it's wrong, you can't help but look. \"Why can't we just admit it?\"\n\r\nWe are all \"Part vampire, Part warrior. Carnivore and voyeur.\" We are infatuated at the misfortune and suffering of others. \"Like blood to a vampire\"\n\r\nWhat genius. Thank you Tool.\n\r\nAnyway, I was late to work that day. But who cares!!!\n\r\nOne last parting thought: Think about all those times you watch TV, or watch a movie, or even watch a motor race and hope for a crash, a murder scene, etc. We are all monsters. We just need to admit it.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nWoo, first comment.\n\r\nIncredible song, I'm pretty sure it's about how we all sit on the couch, hypnotized, watching TV and all the tragedies that are broadcasted that we take pleasure in viewing. Vicarious shows a sarcastic view of this.\n\r\nI can't wait for the new album to be out!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThe song isn't about getting up and doing something though, Luca303. It isn't about thinking we're better off than the people we watch on TV.\n\n\r\nThe song is about how we all love to watch the garbage on TV, even though many refuse to admit. There's no point judging people who relish in it; we can't change. \r\n\"Your desire to believe in\r\nAngels in the hearts of men\r\nBut pull your head on out...\"\n\r\nThe world is dying and there's nothing we can do except sit back, watch, and enjoy from a distance.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThese lyrics are not correct, try these ones.... the only thing that might not be 100% is the, \"She used a poison, in his tea, and kissed him goodbye\" but I know it's not \"he used to poison, and in his dreams\" or whatever you got up here, another thing, it's, \"Credulous, Divest\" not \"Credulous at best\"\n\r\nTool - Vicarious \n\r\nEye on the T.V. 'cause tragedy thrills me. \r\nWhatever flavor it happens to be like.. \r\n\"Killed by the husband\", \r\n\"Drowned by the ocean\", \r\n\"Shot by his own son\", \r\n\"She used the poison in his tea \r\nand kissed him goodbye\". \r\nThat's my kinda story. \r\nIt's no fun until someone dies. \n\r\nDon't look at me like I am a monster. \r\nThrown out your one face, \r\nBut with the other. \r\nStare like a junkie into the T.V.. \r\nStare like a zombie, \r\nWhile the mother holds her child. \r\nWatches him die. \r\nPleads to the sky crying: \r\n\"Why, oh why?\" \n\r\nCause I need to watch things die... from a distance. \r\nVicariously I live while the whole world dies. \r\nYou all need it too - don't lie. \n\r\nWhy can't we just admit it? \r\nWhy can't we just admit? \n\r\nWe won't give pause until the blood is flowing. \r\nNeither the brave nor bold, or writers of stories told. \r\nWe won't give pause until the blood is flowing. \n\r\nI need to watch things die.. from a good safe distance. \r\nVicariously I live while the whole world dies. \r\nYou all feel the same so.. \n\r\nWhy can't we just admit it? \n\r\nBlood like rain come down. \r\nDrown on grave and ground. \n\r\nPart vampire. \r\nPart warrior. \r\nCarnivore and voyeur. \r\nStare at the transmitter. \r\nSing to the death rattle. \n\r\nLie (4x) \n\r\n(Background news headline) \n\r\nCredulous, divest your desire to believe in \r\nAngels in the hearts of men. \r\nPull your head on out. \r\nYour head believes it give a listen. \r\nShouldn't have to say it all again. \r\nThe universe is hostile, \r\nSo impersonal. \r\nDevour to survive, so it is, \r\nSo it's always been. \n\r\nWe all feed on tragedy. \r\nIt's like blood to a vampire. \n\r\nVicariously, I live while the whole world dies. \r\nMuch better you than I.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI think that there is a lot of hidden meaning in the song, just on another level.  If you follow tool, you know that MJK gets a lot of his ideas from many of Jung's psycho/metaphysical theories.  Jung talks about a \"shadow self\"; that part of all of us that harkens back to a more primitive time when we were animals that killed to survive.  The shadow is that part of us that we connect with as we are walking through a woods say, and we come upon a baby bird on the ground (I got this from a brief overview of Jung I found on the internet - can't remember the reference), anyway we find this baby bird, a part of us naturally wants to rescue the chick and nurture it back to life. But there is that part of us that thinks just for a moment \"I could crush the life out of this thing\", and thrills at the prospect.  Jung said the more we deny our shadow, the more evident it encrouches onto our psyche.  So we deny we have this dark part of our souls, well then we start dreaming of marching through the woods stomping on baby birds.  So I think that is a lot of what the song is saying, that we can't deny our shadow self, we need to just admit we are dark souls in order to identify it and deal with it.  \t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI think that in addition to this song being used to discuss the problem of the world living \"vicariously\" through their televisions, and not experiencing the world for what it really is, it also talks about how the media refuses to report on anything that isn't tragic.\r\nIn addition, I think it also talks about the hippocratical nature of humans, in that they view people who enjoy violence as \"monsters\", but then glue themselves to the television, hoping to hear of a bloody murder.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis song is about the obvious need for tragedy and how humans are naturally more interested in horrible things than good things. Thats why the news is all bad things because more people watch the news if its full of horrible tragedies. Shakespeare also, we still read his stories today over and over and they are all horrible tragedies.\r\nHumans are born needing to watch people suffer, as much as we hate to admit it we cant get enough of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI love how disappointed people get when Tool has a transparent song despite the fact that \"Hooker With A Penis\" exists.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI think psychologytoday.com best explains this song - \"\nWhy? The answer may lie in the work of evolutionary psychologists and neuroscientists.  Humans seek out news of dramatic, negative events. These experts say that our brains evolved in a hunter-gatherer environment where anything novel or dramatic had to be attended to immediately for survival. So while we no longer defend ourselves against saber-toothed tigers, our brains have not caught up.\n\nMany studies have shown that we care more about the threat of bad things than we do about the prospect of good things. Our negative brain tripwires are far more sensitive than our positive triggers. We tend to get more fearful than happy. And each time we experience fear we turn on our stress hormones.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nAt the 5 minute mark, the words in the background are the lyrics of Rosetta stoned\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI don't think this song is so much a view on society as it is an inward look at himself.  I think he's describing himself.\n\nThere's a sub-culture on the internet - and out in the real world for that matter - who watch videos and look for pictures of people being killed in homicides, accidents, war footage etc.  As many people know, there are websites dedicated to wholly to this kind of content.  I remember as a kid the old rotten.com webpage.  Think that but much, much worse.\n\nI believe Maynard is describing himself as one of these people.  A person that needs to watch gore, killing, maiming etc. under some kind of almost compulsion hence the lyric:\n\n\"I NEED to watch things die\"\nis used instead of\n\"I WANT to watch things die\".\nThere is a massive difference between 'need' and 'want' and I'm sure the use of 'need' is intentional.\n\nThe theory is also supported by the lyric that follows where he states he needs to watch things die \"from a good safe distance\" as although you are seeing intense images of destruction and death, it is still from the safety of your office or living room.\n\nPeople that view this content do not do so necessarily because they like death, or because they want the person in the video to die.  They do it because it's one of the most extreme things you can watch.  It's about violence getting one step more violent hence the lyric:\n\n\"That's my kind of story\nIt's no fun until someone dies\"\n\nI think that speaks to his need for the images he's seeing to go all the way, and show that last precipice of violence.  He needs to see that death, or it wasn't satisfying content.\n\nNOW, you might be thinking, what kind of sick person would watch that crap?  You'd have to be sick right?  Well, that's what Maynard is addressing in the second verse.  With the lyrics:\n\n\"Don't look at me like\nI am a monster\nFrown out your one face\nBut with the other\nStare like a junkie\nInto the TV\nStare like a zombie\nWhile the mother\nHolds her child\nWatches him die\nHands to the sky crying\n\"Why, oh why?\"\"\n\nMaynard is explaining, quite obviously, don't look at me like I'm some kind of sicko for watching this.  You will sit there and judge me, yet you watch NBC or Fox News every night and watch the same thing.  Death, killing, destruction.  Every night.  Hence the lyric:\n\nYou all need it too, don't lie\nWhy can't we just admit it?\nWhy can't we just admit it?\nWe won't give pause until the blood is flowing\n\nHe's saying why can't we all just admit, all we really want to see is violence.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nspot on rather_dirty_nation  Vicarious is about living life vicariously through your television. The word vicarious means experianced or gained through someone else. It's about how we all sit in front of our tv's 24 hours a day gathering useless information instead of getting up and actually doing something meaningful. If we don't do anything with our lives we might as well be dead yet we think were better off than those people we watch on tv who die trying.\n\r\nWicked first track! hope the new album's this good.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\none lyric i rekon is wrong:\n\r\n\"Shot by his own son he used to poison\"\r\nAnd in his dream\n\r\nshould be\n\r\nShot by his own son he used to poison in his tea.....\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nLa, la, la, la, la, la-la-lie -tool has a suprise for all on may 2\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nLa, la, la, la, la, la-la-lie -tool has a suprise for all on may 2\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\n\"This is more down to earth than usual from Maynard. It hits hard because it is not about hidden meanings. At first, the lack of mystery is almost disappointing for a die-hard. But the song itself is devastating and true tool\"\n\r\nI completely agree with Maynard in that TV news will only report the negative events and none of the positive. Viewers, who all live vicariously, find this much more interesting because they live off the people's tragedy.\n\r\nWhen I hear about rapes and shootings in my home city every day on the news, I can't help but think who gives a s**t. The news also likes to hype stupid events and make them into some huge controversy, like Dick Cheney's hunting incident, or some stupid teen celebrity getting into a car crash.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nAnyone think the intro is a direct rip off of \"Eye of the Needle\" by Robert Fripp and the League of Crafty Guitarists. I saw King Crimson open for Tool in Berkeley a couple years back and I know they respect Fripp. No complaints, of course. This song is bitchin'. Seams a little too obvious what it's about, given Tool's track record, but even if there's nothing more to it, that's cool by me.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nThis is a fine tune, and I'm more than anticipating 10,000 days\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nIt's upfrontness (when we expect hidden meanings) is what makes it that much more powerful, that were weren't ready for it.  It feels so emotionally charged (like much other tool's songs) and amazing.  The time signatures in this song are amazing, and they give the song a sort of a dark bounce to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThis song is a lot more straitforward than most, it's about how that people are entertained by death and tragedy that's shown on the news, \"he\" has admitted this, and he doesn't understand why others call him a \"monster\" when inside they are the same way, but won't admit it themselves.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nAND: that we like to keep a safe distance on our couches and enjoy others problems.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nwhy'd you guys delete the thing that was up yesterday?\n\r\nShame on you.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nsocial criticism...the meaning is obvious...\"why can't we just admit it?\" Now we can, but I don't like it; the problem \"we\" have.  Is it human nature?  Or a disease?  \r\nThe music is powerful and awesome! \n\r\n\"la la la...\" May 2! you got it right...I'm excited too!  \r\ncri0626 | 04-19-2006 @ 12:13 AM UTC\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nWhy are people so stupid? If the lyric is wrong post it in the report thread so it gets corrected. Argh!\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nGreat song, the meaning is a lot more obvious than most of Tool's older work. Also I kinda agree that the music is a little loud and overpowering over Maynard's voice, which is what I'm most interested in hearing. I still like the song, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\ni think this song is great and i think that the music sounds great with maynards voice.  People who say, \"all i want to hear is maynard's voice\" and \"Maynard is what we true fans want to hear\"  are wrong because without the other 3 members TOOL (Danny Carey possibly the best drummer to come out of the 90's) wouldnt of made all of those great records in the past and been what they are today; which i believe is the greatest rock and roll band to come out of the 90's.  The band is TOOL and this songs rocks... this isnt the maynard james keenan show.  but dont get me wrong i thing maynard is a genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nYeah, I'm not as crazy as BrianNeville about it, I just thought Maynard was a little quiet in this one because at times I have trouble hearing him or understanding what he's saying. I don't wanna just hear Maynard sing, I love Tool for all it's members, but I like to be able to actually hear and understand the lyrics of any song. Which I can at most parts of this song, so it's not a big deal.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nEh no listened closer and it does sound more like Eye on the tv. Shame you can't delete your own messages here.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\ni thought it was \"i own a tv\" as well...\n\n\r\nfor people that say \"i just want to hear maynard!!\", listen to The Pot when it comes out. It starts off with Maynard singing, and it's a proper rock song with teh vocals at the front of the mix. He sounds like Robert Plant in it\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nHa.\r\nHahaha. HAHAHAHHAHAHA.\r\nBrainNevelle, that's me laughing out loud at you. Seriously. Half of me doesn't even want to dignify that with a responce. Maynard would be piss-weak without the Tool boys, they're the backbone. That's for fucking sure.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\n^^ agree with you, any \"singer\" can sound good if they have an awesome band.  All the memebers are vital to Tool sounding awesome and thats for any band aswell, pretty awesome song, shall be looking forward to 10 000 days.\r\nAs for the meaning, well i think everyone has pretty much covered it :)\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nOnce again, Tool says what we all felt but never said aloud.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nby the way, I agree with MoreViolence. STFU BrianNevelle. Maynard is good with Tool, and Tool is good with Maynard. One can't be without the other. And, I seriously doubt Maynard would feel that this type of message would be conveyed in a more light-hearted song style.  He puts his lyrics to Tool's musical style for a specific reason, not because somebody pushed him into it.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nSo where's the lyrics for the rest of the album eh? Thought you die hards would have posted some of 'em up by now! \n\r\nLovin this song by the way :D\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nAccording to Adam Jones in GuitarWorld, this album is supposed to be a lot more powerful than most of the other works because Maynard's voice isn't mixed right up front on the album, so you can really hear the driving force of the instruments behind him\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nTv is just a new arena nowadays...a way to deal with death without it threatening us.....The diference is the one who will die for us don't salute us, they beg for our help but we are so hypnotize by the show that we don't even realize that it's our world dying in front of our eyes and we'll soon be on the other side of the screen......this song makes me think of Aenima in the hypnotizing and nihilist message.....\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nOh...i LOVE this song by the way...like always, the first time you listen to it, you think...arf...this time it's not as good as the last one...then you listen to it once more, then once more, and finally you get the melody, you read the lyrics, and ...god it's as good as it always been...it's TOOL, nothing else to say.....True artists....\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\n^ sorry to dissapoint you Trexor, but I already have the album, MANY do, and it IS called 10,000 days. Song 4(10,000 days) talks about the meaning behind it. Its a beautiful song.....anyways, yeah, Vicarious rocks, long live TOOL.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI have the album as well. It's much different from previous albums but woah its amazing. 10,000 days refers to the 27 years that Maynard's mother (Judith Marie Keenan... APC anyone? Judith was about how she was still faithful to god in her condition) was paralyzed before she passed away. I really like this album, but I do not think it shall be enjoyed by the public as much as other albums. The same happened when APC released eMOTIVE. I still think Lateralus is the best album.\n\r\n\"So crucify the ego, before its far too late\r\nLeave behind this place so negative and blind and cynical\r\nAnd you will come to find, that we are all one mind\r\nCapable of all that's imagined and all conceivable\"\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nTREXOR, do you know what vicarious means???  You are right about the \"fake\"CD!! Must have been recorded in the same studio where they filmed the fake moon landing in '69!!! *%#@\n\r\nSuggestion to all:  This link came from a comment on the page for Lat. lyrics; it is an interview...many will feel very validated when they read about the meanings of many lyrics...I did!  Also, it is very interesting.  TOOL fans are smart people...well most of them.\ncdicarlo.com/…\n\n\n", "comment_46": "\nAll I can say is that I love this song... a bit more straightforward than other Tool songs, even moreso than The Grudge, but Tool doesn't disappoint. All in all, this songs awesome...\n\r\nThe way I look at this song is just being zombified by the media and all that's around us. Then we go around saying, \"What a horrible world we live in!\" That may be true, but in essence when you look at it, most of us have pretty decent or at least halfway decent lives to live; when we see this stuff, we take on it like it's our own troubles and try to sympathize. Nothing wrong with that, but overall, you're better off spending your life to try and correct that sort of thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nMoreViolence please, PLEASE tell me your joking right? HAHAHA reeaalllll funny! maynard is a fucking god and makes tool 1 of the VERY best instead of a mediocre band with awesome instumental. TOOL is regarded among the best because of maynards unparralleled voice, which has been claimed as 1 of teh best vocalists in history by a number of sources like the rolling ston and guitar world.\r\nlong story short maynard is amazing and THIS SONG IS AMAZING, if the rest of the album even comes close to this its going to be up there for the best album ever\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\ntrexor you dumb fuck, you more than likely downloaded some fake piece of shit that you were retarted enough to assume was TOOL, then you robably read on some bogus site that it wasnt really tool, not your trying to convince other of this...NOW if 10000 days was a fake album, then please enlighten me as to why toolband.com posted its tracklist (including the song 10000 days) and interviews (with maynard) saying how they were excited about the new album? after your last few coments on this page every tool fan that has read it knows youre an insignificant idiotic little fuck, so why not try to answer my question? none of us have any respect for you anyways. 10000 days was names for maynards mother judith keenan who suffered paralysis and held onto life for 27 years (or if youre as bad with numbers as facts about 10,000 days) if youre even dumber than ive come to believe and dont believe me, please be my guest to check out toolband.com and/or download vicarious, it is DEFINATLY maynard. my guess is that you downloaded it before the official version of vicarious was even released\r\nnow any tool fans reading this, please dont imbaras yourself and believe any claims that trexor has made on this page\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nFirst heard this song on the 15th. Somehow it leaked and my local rock station got ahold of it. I've been listening to it ever since. Tool is an amazing band whether you think the real talent lies in Maynard or the rest of the band. Can't wait for May 2nd. By the way, this insturmental parts of this song, specifically the guitar rhythms at the beginning and the end, sound a lot like Schism to me. Anyone else noticed that? Oh well, if it ain't broke don't fix it. This song kicks ass.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nsmokebreak, i cant stop laughing...\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nooops...i mean dustpan...he he.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nIts Tool. So is the album. Get over it\n\r\nYoure the fool trexor.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nSome others have commented that this is a more straightforward song in meaning than Tool's previous songs--hello?  \"Aenema\" anyone?  The blatant \"f*ck humanity\" meaning of that song is just as apparent upon a first listen in that song as the meaning of this new single is easily understandable.  That's not a knock, because I think straightforwardness can be potent, as it is in this song.\n\r\nMy favorite line is \"The universe is hostile, so impersonal, devour to survive... so it is, so it's always been.\"  He acknowledges this truth in existence and contends we should accept it.  He's not the first one to reflect on it but it's always a strong truth.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nI agree with thekep1014, that TOOL are equally an amazing part of an awesome band. This song is one of many that has the power to change lives, and not just because of Maynard, they are all amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nTrexor, I have the whole album as well- it's tool, there will be a suprise on may 2 but you're wrong\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\ntrexor you want evidence?\r\ntrack 1 vicatious- you know how it sounds\r\n2- jambi starts with heavy guitar riff/maynar singing slowly\r\n3-wings for marie 1 opens will church bell rhythem\r\n4-wings 2 slow build to maynard singing lowly in rhythem\r\n5-the potmaynard solo to start \"who are you to wave your finger\"\r\n6-Lipan - chanting\r\n7-lost keys- dr exam\r\n8-rosetta stones- very different song fast talking at beginning\r\n9-Intension- long quiet intro\r\n10-right in 2-slow guitar start\r\n11-viginti-plays with holographic sound (most of the album does this but it comes to a head on this track)\n\r\neven if it's a \"fake\" this is still a tool album and a damn good one- after only hearing vicarious I left the possibility open as well, but this collection of songs is new cd quality regardless of what it is or isn't labeled\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nalso one last thing about the album- there are many references both with lyrics and music to old tool songs- I haven't looked at it closely at all, but I think some songs may build off of older songs\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nIt is most definately Tool Trexor... there has been a fake album circulating around, my friend has it. And let me state: omfg it sucks! The one everyone is talking about is authentic. Being a drummer myself, I have followed Danny Carey for quite some time. His rhythmic paterns can be recognized in these songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nThe only other loser around looking but understanding my invisible sentence now think.. For all's knowledgable exagerations....\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nBy the way, Mr. Trexor who thinks this is a fake album, my last post is for you.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nTREXOR: you really ought to calm the fuck down buddy. There IS a fake Tool album and 10,000 Days is NOT IT!!! What proof do you need, man? Like it or not, the fucking artwork you despise is plastered all over Wal-Mart (May 2nd: the banner reads) and while I could see Maynard & Co. fucking with that \"establishment\"... they respect their fans enough to NOT string them on some crazy-assed fucked-up conspiracy theory like you're throwing out here on your posts. \n\r\nAfter May 2nd, 2006 you're gonna be changing your name to avoid the entire Tool fan-base laughing your ass out the cyber-door.  IT IS TOOL and THOSE ARE THE TRACKS that will be on the ALBUM: \"10000 DAYS.\" Just let it fucking go, man. Save what dignity you have left and just LET IT GO. For your sake... you look like (and will be proven) a goddamn fool!!!\n\r\nFucking righteous song by the way. Maynard has the best voice in music today and it doesn't matter who's backing him: Tool, APC, Deftones, RATM or even a Kanye West beat... he's gonna sound amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\ni know its not the right place to post comments on Tool... but...i'm \n\r\nQuite dissappointed with this one. apparently maynard hasnt shaken off his musings with APC. i can't help but notice a lot of APC residue stuck on this song. (mind you APC are a great band in themselves). \n\r\nfurthermore the song sounds too much like a rehashing of old tool material... try listening to the intro to vicarious and the section in \"Pushit\" where maynard starts singing \"you know that i will choke until i swallow\". too similar in rhythm, melody line and syncopation to be a comfort. \n\r\nwhat also bothered me was the fact that there wasn't ONE memorable moment on the song. it's very verse chorus verse chorus driven... very very unlike tool. \n\r\noverall after listening to the 13th step album... esp Vanishing, blue, weak & powerless, and previous albums of tool ... this song turns out to be just an extend arm of the aforementioned. sort of like an unhealthy tumour. an unnecessary corrupted replica of what is healthy.\n\r\nturning the pages. lyrically speaking, this has to be the weakest, the most two dimensional tool piece. like it or not. maynard has constructed the lyrics upon a very unstable ground. the ground being the word \"vicarious\". unlike previous tool songs, this piece is just too shallow. don't think i'm just one of those lovers of the \"abstruse\"... this piece as i've said is too two dimensional. there lacks usage of surrealistic techniques found through most of other tool pieces...\n\r\nif the remainder of the album flows this way, then i'll be quite dissappointed... i guess artists have their period of \"wane\"... even tool.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nHow could you be disappointed with this song? Tool didn't sell out. Maynard sounds awesome on this track and Danny Carey is just a monster on drums. Also, don't download something that hasn't even been released. If you actually downloaded the album and judged it then don't even call yourself a Tool fan. Vicarious, in my opinion, is a damn good song. Anybody who disagrees is an ungrateful bastard. I think you guys expect way too much. If you were a true Tool fan then you would support them 100%.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI love this song.  Go Vicarious.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\ntool only progresses more as they play. this song wasn't, at least personally, as much a disappointment as others see it. as a musician (drummer/pianist), i've used tool for many inspirational paths through music. one thing tool's never been able to do is not impress me. no true fan can truly say that this song didn't impress them, as it shows how much each member has progressed.  the lyrics, i must say, were a pain to make out at parts, but it generally flows well.\n\r\nas for the meaning of this song, from my perspective:\r\nTV (or other medium) all create barriers within us which guard us from \"proper\" ways of being. this lack of censorship, even through all the censorship, gives us the opportunity to take in what's wrong, and think it's right. it also shows how primitive the human race is, as we're all so interested at the harming (or death) of another, proving how \"civilized\" we actually are. \n\r\nas for BrianNeville, and the other arguing this point:\r\na band is not like britney spears, where we only stare at one person for hours on end. no, tool (and the majority of bands) are bands without a front man. each instrumental is as impressive as the other, each member contributes equally, if not more. true tool fans listen to the music because it is inspirational, and that you can receive influence for nearly any instrument, as we can see with the string tributes. please, don't say something biased unless it's an opinion on the meaning of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\ndoes anyone else think these vocals/lyrics sound more characteristic of APC? \n\r\nand congratulations to everyone who scored tickets to the US tour... i know the detroit show sold out in 1 minute.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nTrexor , I just hope that you are right cause this album kind disapointed me by sounding too similar as lateralus...if TOOL did this, this would be the more elabored musical hoax of all times !!! And it would prove TOOL is definitly a band different from the other ones. So, wait and see..I will listen to 10.000 days for now becasue it's a good album....even if it could have been named Lateralus 1.2 ......\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\ni'm starting to agree with TREXOR. there is so much out there that points to this being the \"decoy album\" they made and the real artwork etc being changed at the last minute when the real album is released. these songs are not the usual multi layered excellence of previous albums.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nVicarious + Jambi + Right in Two\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nOki, this is the true album....no comment.....TOOL's downward spiral...... :(((\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nanyone else notice the whispering/background noise at the 5:00 mark?\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\never hear that saying... \"Don't always believe what you read\"\r\nlol\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nevidence that this leak may be a decoy---- Blair said in the September 2005 newsletter that the band had spent a year making a decoy album to fool bootleggers... HOWEVER he was in the middle of a highly sarcastic rant... secondly, if there's a band out there capable of pulling off a trick like this it's Tool...\n\r\nMajor reasons that this is NOT a decoy album...\n\r\nthe track lists was made public because the album's packaging was being sent off to the printers and was going to be leaked anyway...\n\r\nI have personally seen photographs of the packaging... it folds out into 3d glasses to make the viewing more interesting...\n\r\nwould Tool really piss away tens of thousands of their own dollars just to fake us out?\n\r\n-so in conclusion, i don't really think this is a decoy album, but even if it is I think certain people should quite trash talking it as Blair claimed that the band spent so much time putting it together to make people believe it was the real thing... if it IS a decoy, doesn't matter to me cause i have a disk with, what i consider to be, 11 great tool songs... if there's another disk coming on may 2nd, bring it...\n\r\nit's hard to know what to believe with this band... i did see an interview with Danny and Maynard yesterday on mtv... they really didn't mention anything specific about the new album... i guess we're all gonna have to wait and see..\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\n\"at coachella, tool will pull off the biggest hoax in the history of music and announce that the leaked album was a joke and blow thousands of overwhelmed fans away with their new material (on 28th april, same date as the album is first released in some countries, tool kick off their tour)\" quoted from TREXOR\n\r\ncant wait till tomorrow.. but i wont be surprised when things come together/fall apart\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nIt's already out in Australia and there is a lot of pics of the packaging....one of my friend already have one CD and it's exactly the same as the leak....no TOOL won't surprise us...the sides projects of the members have put their creativity a little bit down but 10.000 is still an excellent album...not a masterpiece but an excellent album...\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\noh dear... it seems the word is in from the auzzies and kiwis... the album is selling fast...\n\r\n10,000 DAYS IS THE REAL DEAL... THE LEAK IS NOT FAKE... THE FAKEOUT IS FAKE\n\r\nHey TREXOR ... 'foot in mouth and head up ass, so whatcha talkin' bout'... eh?\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nTREXOR, I wonder if you even know what the word 'vicarious' means.  It doesn't make sense in the context you are using it in.  People don't refer to themselves as 'vicarious,' unless you are making an artisitc point, like Maynard is.  Seriously, look the word up.  I didn't know what it meant when I first heard it, but I wasn't afraid to look it up.  That's what dictionarys are for.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nrock hawk...back on page 2 I asked trexor the same question.  glad someone else noticed.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nthis is about maynard and his tivo...he wrote this when he realized that all the shows that he records are pretty violent.....\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nHEY, GUESS WHAT TREXOR... YOU WERE WRONG FOOL\n\r\nQUITE ARGUING SYMANTECS WITH PEOPLE WHEN WE ALL KNOW WHAT YOU'VE BEEN SAYING OVER THE LAST 15 DAYS IS UTTER HORSESHIT\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nFUCKING WANNABE TOOL FANS\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nTREXOR- honestly dude, just walk away while you can, stop digging your hole deeper... you sound like a 16 year old, TOPS... \n\r\nyou didn't really say-\r\n' the opposite of vicarious, would be \"numb\"' \r\ndid you? let's break this down real quick...\n\r\nWebsters defines Vicarious as-\r\n-Felt or undergone as if one were taking part in the experience or feelings of another-\n\r\nso basically, one would have to be numb to a certain extent to require Vicarious stimuli... i.e. emotion... and that's what the song is about. it's kind of a similar subject to Stinkfist... overstimulation causing numbness and whatnot...\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nWIKIPEDIA-\n\r\nSkepticism that 10,000 Days is the actual title has become void since the album has already been released in some European countries.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nIf there's one song on the leaked 10,000 Days that's real, it's this. This is a great song. Roll on UK release day!\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nwho has to actually look up the meaning of the word???? It is a common word it should already be part of your vocabulary!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nive been sitting back most of the day and this really isnt the place for this, but i have to say, TREXOR... what were you thinking?\n\r\nposting this fake fakeout on a site where you cant delete comments, not to mention the loose information and conspiracy theories you were basing all your ideas on. \n\r\ntrying desperately to get people to believe you and now not even addressing the fact that youre WRONG you skip over comments and pick out the fact that you \"have been researching this stuff\". its a sad fact you had to \"research\" the word vicarious. you look a fool. you deserve everything these people are giving you.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nTREXOR, the pseudo intellectual morron, appears to have fled the boards.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nwouldn't you??? he's now a complete pariah, unable to resurface... good riddance\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nI think the big challenge here is figuring out whether this is sarcasm or not.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nI fucking told him (the almighty TREXOR) that this would happen... How could you doubt for a second that \"Vicarious\" was the single when it's in rotation (for better or worse) on every Clear Channel modern/alternative rock station across the US??? Sayonara to the very definition of a \"tool\".\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\n^ hehe, oh man. Trexor, you really are dumb. I cant believe you stood your ground that long. Plain and simple, the album is out, and the track listings are the same. Same songs, same album as the leak, next.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\n\"Blood like rain come down.\r\nDrown on grave and ground.\"\n\r\nThis song is so weak. I mean, the music is cool, with all the complicated time signatures and crap, but the whole concept reminds me of something a freshman poli-sci major would write. Actually, that's probably where Tools target audience is. It's chock full of \"neat\" metaphores like \"junkies\" and \"vampires\" to describe the human race and it's consumption of the media, but it doesn't really make sense. \r\nWait, I would expect it to make sense to you, so before you say it, just shutup and go to the next post. You can't handle this. I don't want to hear your over-zealous defense to your vicarious addiction to Maynard's fabled acuity. \r\nIf people consumed media to fulfill some inborn need to see death, as Maynard asserts, then why does virtually every commercially sucessful movie produced end with a happy ending? And why does the news (probably the real focus of the song), despite it's reporting negative events, always contain more \"facts\", like weather or current events, than \"death\" and \"bloodshed\"? Wouldn't it be more rational to say that people watch the news to stay informed, and therefore keep themselves more aware of society?\n\r\nThese lyrics are esoteric at best, like most of Tools lyrics, except these symbols aren't as interesting as, say, an fist-fuck in the ass. I mean, he used \"zombies\". Come on.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nWell... i heard this on JJJ in australia. maynard told the listeners the meaning of it.\r\nits politcal and basically how it appears that this is how george w. bush sees the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\ngeorge w. bush again... great... are all musicians writing about him/at him now?\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\neh, Fluid always trash talks albums when they first come out... but he'll come around...\n\r\nalso... i don't know what news station you're watching bro, but the golden rule of the media is, and always has been, IF IT BLEEDS IT LEADS... tell me i'm wrong... a car bomb goes off in Manhattan and you will NOT be seeing 'Golfing World' on CNN...\n\r\nwhy do people get so hung up on single words in a song... don't get it... words like junkie and zombie (which are synonomous in many ways) are a perfect way of describing the apathy that americans display over violence and war... oh we're so against it, but jeez we'd rather not have to miss 'Lost' to go protest it...\n\r\nanyway, this song is venting frustration at apathoids... it's sarcasm, but it's also ironic to an extent because death does catch our attention, whether it affects us deeply is another debate... \n\r\nif you think this subject matter is juvinile or uninspired than go listen to... uh.... hmmm... well, you tell me who's writing more complex, high minded, progressive music as this... please, cause i want to hear it...\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\neh, Fluid always trash talks albums when they first come out... but he'll come around...\n\r\nalso... i don't know what news station you're watching bro, but the golden rule of the media is, and always has been, IF IT BLEEDS IT LEADS... tell me i'm wrong... a car bomb goes off in Manhattan and you will NOT be seeing 'Golfing World' on CNN...\n\r\nwhy do people get so hung up on single words in a song... don't get it... words like junkie and zombie (which are synonomous in many ways) are a perfect way of describing the apathy that americans display over violence and war... oh we're so against it, but jeez we'd rather not have to miss 'Lost' to go protest it...\n\r\nanyway, this song is venting frustration at apathoids... it's sarcasm, but it's also ironic to an extent because death does catch our attention, whether it affects us deeply is another debate... \n\r\nif you think this subject matter is juvinile or uninspired than go listen to... uh.... hmmm... well, you tell me who's writing more complex, high minded, progressive music as this... please, cause i want to hear it...\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\neh, Fluid always trash talks albums when they first come out... but he'll come around...\n\r\nalso... i don't know what news station you're watching bro, but the golden rule of the media is, and always has been, IF IT BLEEDS IT LEADS... tell me i'm wrong... a car bomb goes off in Manhattan and you will NOT be seeing 'Golfing World' on CNN...\n\r\nwhy do people get so hung up on single words in a song... don't get it... words like junkie and zombie (which are synonomous in many ways) are a perfect way of describing the apathy that americans display over violence and war... oh we're so against it, but jeez we'd rather not have to miss 'Lost' to go protest it...\n\r\nanyway, this song is venting frustration at apathoids... it's sarcasm, but it's also ironic to an extent because death does catch our attention, whether it affects us deeply is another debate... \n\r\nif you think this subject matter is juvinile or uninspired than go listen to... uh.... hmmm... well, you tell me who's writing more complex, high minded, progressive music as this... please, cause i want to hear it...\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\n*bouncing on a pogo stick while laughing like Ernie from Sesame Street*\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nI have bee a tool fan since the first time I heard them in '94.  Tool as a band: voice, guitar, drums... has always stood out amongst the others.  This CD is good.   It is observant of human nature.  It is different than the ones that cam before it, and that is why TOOL has been a viable, meaningful and educational, artistic force.  \r\nIf for a second any the members considered taking  some of these warped opinions to heart, they would not be TOOL, they would not be good, they would be Limp Bizkit or some other fluff.\r\nMJK is very political in this song.  Many artists are becoming so.  And to those of you who complain about that:\r\nMAYBE? MAYBE? MJK has allowed himself to be affected by what is going on in the world, by the choices and actions his government is making.  Maybe some of us should allow ourselves to be more affected, rather than numb.  Rather than using music to escape or aid in our oblivion, we need more music to WAKE US UP!!!.  Clearly MJK has political opinions ------  \"GO back to sleep\" (APC)\r\nThis song continues the same point of view.  TREXOR you were off on the whole def. of vicarious, and you are kind of coming across as a tool; but, you were on the right track with the word \"numb\".\r\nMost of America are numb to what we see and hear on the news.  we can hear about murder, rape war or injustice, and turn the TV off and forget about it. \r\nThis is a dangerous war, it can go on for a very long time, because it does not effect the majority of the population on a large scale.  We can go on with our normal lives, the war is on the other side of the world. the murder was on the TV.\r\nAny stirrings of in-justice or calls to action are numbed by the \"three ring circus side show\" we live in.  We can stay numb because whatever need we may feel to react is fulfilled vicariously through news, TV, propaganda, etc.\r\nTHE FACT THAT THERE IS SO MUCH WRONG GOING ON, WITH SO MANY IN DENIAL SHOULD BOTHER YOU MORE THAN mjk SPEAKING UP AND SINGING ABOUT IT.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nThis song is pretty good. But I still think Tool may have lost their touch just a little bit. I may be wrong. I'll have to wait to hear the entire CD this Tuesday.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\ni think it's just a little similar to \"the Grudge\" or even \"schism\". am i wrong?\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\n\"Credulous, divest your desire to believe in\r\nAngels in the hearts of men.\"\n\r\nI'm almost certain this line is:\r\nCredulous, at best, your desire to believe in\r\nAngels in the hearts of men.\n\r\nMakes more sense, too.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nOk, I take that back, I should find out what things mean before saying what makes more sense.\r\nStill, it sounds more like 'at best' to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nwell said cri0626... i think it was Trent Reznor who said, 'our current political climate doesn't allow for the luxury of apathy'\n\r\nany and everyone who doesn't think this album is up to par... take a month, listen to the cd every day and then come back and let us know what you think... this is a brilliant album, it will stand unquestionably as Tool's most progressive and ambitious album (to date)...\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nDoes anyone know what news headlines are being played towards the end of the song?\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nIm not in a mood to read all five pages,but in case no1 said it - its about policy of all todays media-newspapers,tv-news- olny deaths ,political scandals,roberies, and bad scary news sells.I dont know if it is because of fear or worse we actualy want that crap but its selling every day.it is sad .....:(\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nIn my opinion, this is one of the most ignorant songs I've ever listed to. TV might allow us to travel anywhere we want without lifting a finger, it's called technology, but people have the right to see what they want to see...\n\r\nI personally don't watch tv because I'm on the Internet all the time... I'm more of a doer not a watcher.\n\r\nEssentially, he's calling everyone who watches the news a bunch of vicarious serial killers who like to watch people suffer. This song is just cynical and dumb.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\n^^^^i guess if i was as dumb as you i'd think the same thing...^^^^\n\r\nhere's a reference tools for you... en.wikipedia.org/wiki/…\n\r\nor as H.W. Fowler put it, 'Irony is a form of utterance that postulates a double audience, consisting of one party that hearing shall hear and shall not understand, and another party that, when more is meant than meets the ear, is aware, both of that â\u0080\u009cmoreâ\u0080\u009d and of the outsiderâ\u0080\u0099s incomprehension.' \n\r\nget it?\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nAz Iz, you obviously missed the point of this song, it is not a condemnation of technology, the news, or TV.  Maybe you need to \"listed\" to it again.  \r\nSecondly, you should be aware that spending all your time on the internet is the exact opposite of what a \"Doer\" does.  Go outside, have real conversations, gain some insight and experience in human interaction and involvement, then come back and listen to this song and see if you can maybe find a little deeper meaning to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nTool has fallen off with this album.  We have 3 1/3 kick ass albums to remember them by at least.  I mean c'mon, is maynard really advocating that we don't watch the news?  the whole message is the antithesis of what Tool is usually all about.  \"Wow, maynard, you're sooo smart.  come teach us how to live.  i'll put my blind faith in your illogical songs and you'll be the next jesus.\"  yeah, the world seems cruel if you watch the fuckin news all day....BUT I DON'T.  get back to writing hardcore songs about anal-fisting and other vague metaphors.  the new album is just a little self-righteous, don't ya think?\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nDoes anyone know the time signatures for this song, if there are any other than the 5/8.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nhey Synergistic- you know what i think's a little self-righteous... little teenaged jerkoffs who have their own ideas about what Tool should sound like... these guys are all brilliant musicians in addition to being perfectionists... you know they agonized over every last note, every time signiture, the track order... etc...\n\r\nthe only people that have a problem with this album seem to be the less mature listeners who want loud, angry, obscene, fast...\n\r\nif you want intelligent, complex, and thought provoking music listen to Tool... i'm not exactly sure what you're after, but Insane Clown Posse might be something to check out...\n\r\nit seems to me that the people who like this album are being subjective about it... and the people who hate it are talking in absolutes...\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nfuck what a discussion. i only discovered tool 5 months ago (yes, i am ashamed) so i cannot really class myself as a die hard tool follower, but as soon as i heard them i fell in love. i think this is fantastic stuff, people shouldnt get bored so easy. would i sound to up my own arse if i suggested that some of the ppl complaining bout the repitition just have too short attention spans?\n\r\nits a great song, doesnt matter that its blunt, things dont need to be layered and multi dimensional the whole time, we already know tool could do it if they wanted to. \n\r\nalso i cant help but add my opinion to the whole trexor debate... man you sound like one stuck up bastard. i mean, you havnt even admitted you were wrong yet. how bloody stuffed full of testosterone are you??? its a more aggressive album, but more primitive, stripped bare, then usual i think. i like that, its definitely far from bad. and the artwork... woah i have no words. makes me feel like an inferior being... unworthy of listening to tool! but thats not the attitude they would like. what other band can compare? mjk is a genius, demi god, artist of another level and generally incredible guy. but too suggest its alll about him is ridiculous - tool wouldnt be anything without the talent and genius of every other individual. its a band, they all work together. and the do a bloody good job of it too.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\ng0nzo\r\nI hope you get to see them this summer\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\n\"I don't understand anything, so there you go ... You know what my problem is? I watch too much news, man. That's my problem, that's why I'm so depressed all the time. I figured it out. I watch too much CNN, man. I don't know if you've ever sat around and watched CNN more than, I don't know, 20 hours in one day ... I don't recommend that. Watch CNN Headline News for 1 hour, it's the most depressing thing you'll ever fucking do. 'WAR, FAMINE, DEATH, AIDS, HOMELESS, RECESSION, DEPRESSION. WAR, FAMINE, DEATH, AIDS, HOMELESS ...' Then, you look out your window ... [makes cricket noises] Where's all this shit happening?\" - Bill Hicks\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nIs it just me or does it sound like this band recycles 1 song with a few modifications and changes the lyrics.. Dont get me wrong, the lyrics look solid but come on..\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nand what song would this be recycled from?\n\r\nanyone who thinks that is not very observant...\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nbleach, anyone that knows the slightest little bit about music could tell you that Tool doesn't recycle songs...\n\r\nthey don't even use a verse chorus verse format very often. let alone the same time signiture... you know what that is, don't you? cause there are no two songs on this disk that have the same beat count... where do you get this nonsense man?\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nBlindrider, it's 5/4! \r\nNot 5/8\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nBlindrider, it's 5/4! \r\nNot 5/8\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nhe's right... it's 5/4\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nagh i hate to say it, but yep the intro does sound pretty schismey. but still, the rest of it (and in fact the whole album) is undeniably amazing original and yeah tool down to the very fibre of its tollish existance.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\noops that was toolish existance not tollish\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nWell are there any other time signatures then?\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nI'm not so sure that the last couple of lines are correctly listed.  I've listened to the song a fair number of times and this is what it sounds like to me...\n\r\n\"Credulous at best, \r\n your desire to believe in\r\n Angels in the hearts of men\r\n Pull your head on...( )\r\n The universe is hostile\r\n so impersonal\r\n devour to survive\r\n so it is, so it's always been\"\n\r\nI'm not quite sure what he is saying where I put the\r\n( ).  It sounds like \"Pull your head on out your head\r\nthe brazen never listen\" but that doesn't really make much sense to me.\n\r\nAs to the meaning of the song, I think it's pretty obvious.  People have a deep seeded desire to watch other people suffering.  It's why people slow down when there is a traffic accident, or why the news is always so depressing.  I think the German's call it schadenfreude.\n\r\nI don't know if I agree with this, at least not the the extent that the song seems to imply.  I think there are instances where people watching the suffering of others, especially if they don't particularly like the other person.  In general though, I think there is a limit that people enjoy the suffering of others.  When I hear about people being tortured, kids being raped, and things of this nature, I can assure you I get no satisfaction from it.  I think most decent human beings will feel the same way.  That's my take on it anyways.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nIn the song he's not talking about people being raped or anything like that...he's talking about watching people die and it gives him some sort of satisfaction. I wonder if there's something we're missing.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nthis song rocks\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nBlindrider:  I didn't mean to imply that the song touched on the subject of rape.  I just used it as an example.  While people may get a certain satisfaction out of watching other people suffering, I think there is a point that any decent human being will say enough is enough.  It might not be a conscious thing, in most cases I imagine it isn't at all.  I brought up rape as one of those examples.  I don't think people get any kind of satisfaction out of that type of suffering.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nI hardly think Tool are advocating digging a hole and ignoring the news. I think the obvious target in this song is the populist news services like FOXNEWS who seem to think that the abduction/murder of a child is something to be watched 24 hours a day instead of focussing on events with global (or at least national) relevance. Its more about replacing actual news with voyueristic 'human interest' crap and pretending that its in someway relevant.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\n^^^Exactly^^^^Smart guy here^^^^\n\r\nIf it bleeds it leads... 'so it is, so it's always been'\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nto Lateralus518:   did you listen to AEnima!?! TOOL did sell out, youre a moron if you believe otherwise and if a tool freak expects something thats better than anyone could imagine, he'd never be disapointed.  Tool is just an all around great band and you never know what will happen next.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nGotcha Decessus. I see what you mean now.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nWhile I agree that Maynard is singing about living vicariously through visuals on the television, I don't think he is completely against the idea in this song. Nowhere does he indicate that he despises the idea of it. In fact I remember an interview where he talks something about this -- the fact that we need movies, music, etc., with violence and horrific acts in order to release our true inner emotions and feelings through those means that way we don't go crazy and go off killing people ourselves. People are afraid to simply admit it when they get a notion to watch horrific things or listen to horrific things.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nWell, the true is, this songs lyrics is nothing new. At least the idea that people are wathing death on TV news and doing nothing about it. I recommend the Roger Waters almub - Amused to Death. Imo lyrics there compared to this song is way better.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nI'll even post the link to the song's lyrics\nsongmeanings.net/…\n\n\n", "comment_136": "\nI love this album the songs sound really good, however i don't think it has a lot of flow as an album, I am interested to see if this is just the left over songs from lateralus with a couple extra, and we have another album to go.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nWhy is it that so many people disliked this album the first time they heard it?\n\r\nThe meaning I like to get out of this song is: All of the people who freak out over media violence need to realize that it is the best way to be exposed to violence. But of course, I probably focus on that because it's an issue that I think about alot.\n\r\n\"Vicariously, I live while the whole world dies.\r\nMuch better you than I.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\n^^ wow dude, i don't think you could have gotten it more wrong...\n\r\nmjk's questioning and exploring our fascination with violence... not saying it's a great thing... (ahhh irony)\n\r\nmjk deplores violence, if you have any doubt you need to listen to Right in Two... it's about 9 songs past this in case you were wondering...\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nyou know trash, thats a damn good question! this album is amazing and i dont understand why people dont like it. this cd is stacked with great songs (vicarious, jambi, right in two, rosetta stoned ect.) whatever some questions may forever go unanswered\r\nand trashcanman, on a side note, did you get your name from the stand?\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nI think i just had a musical orgasm.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nThis is an quote from a book called \"Thus spoke Zarathustra\" by Friedrich Nietzsche, which I have been reading recently and there is one small quote that made me think of this song. \n\r\n'you look up when you desire to be exalted. And I look down, because I am exalted. 'Who among you can at the same time laugh and be exalted? 'He who climbs upon the highest mountain laughs at all tragedies, real or imaginary'\n\r\nI am so addicted to this album now its rediculous lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nI just cannot believe people can get tired of this album. I listen to it an average of 3 times a day since I bought it and I am still not tired of any track except Viginti Tres (spelling? I suck at Latin). And I still think I could get something out of that one if I had some good software to control speed and direction in a song.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nIm proud that i dont watch TV\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nwell i watch documentaries, good films, and the news, but watching a soap opera or big bro is living vicariously\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nI really don't feel like paging through to whoever asked why movies and shows still have happy endings.\n\r\nSimply put, its resolution. Leaving the matter open-ended without that ending leaves people unsatisfied. Its a tried and true formula in Hollywood.\n\r\nI have to agree with that idea of people being vicarious serial killers. Especially considering how popular Saw and other movies like it are.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\n\"Devour to survive. So it is, so it's always been. We all feed on tragedy. It's like blood to a vampire.\" \n\r\nHe's saying that to sustain life, you need to take life. Everything that is alive takes life from something else. Tragedy is all over the place, we just recognize certain tragedies, mostly the ones that impact us directly.\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nI think the focus of the song is more about the nature of humans rather than how we watch the TV. And also, the hipocrisy of people who are so anti-violent when they are infact controlled by their violent nature themselves. Everyone has a thirst for blood and tragedy and this song is bringing that fact to the forefront and saying \"Why can't we just admit it?\" It's not a bad thing, or a good thing, it just is.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nThis is an amazing track, and i knew by listening to this one track that it would be a good cd. this song is like Stinkfist off of Aenima. its a good start to an even better cd. No other way.\n\r\nThis song reminds me of the Billy Huck (i think that was his name) segment at the beginning of Third Eye. its seems that all the bad things in the news seem to thrill us more than the good things, and that we are scared to say so.\n\r\nPersonally i know i watch more of the \"horror\" stories in the news than i do the \"joyful\" ones.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nIt's Bill kicks you ignorent fuck. B-I-L-L H-I-C-K-S. \r\nBesides, your point is stupid and irrelevent. I hate you. \n\r\nI come back to this wretched site for the first time in weeks looking for some sort of enlightenment, and THIS is what I find!!??\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nI mean \"Hicks\", not \"kicks\" . (goddamnitt).\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nAnd you're actually an \"ignorant\" fuck, as well as an ignorent one. \n\r\nTalk about calling the kettle black, I hate myself.\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nSee, I can get off on watching this guy make a fuck of himself, just as people can watching others get fucked on T.V.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nI love this song.  I forgive it for not having lyrics that totally screwed with my head (I'm a bit of a masochist that way, probably why I've been a fan since Enema).  Does anyone else find the cut down radio edit version to be somewhat sacriligeous?  It seems to kill off half the guitar... but maybe thats just the stations in my town\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\n\"The universe is hostile,\r\nSo impersonal.\r\nDevour to survive, so it is,\r\nSo it's always been.\" \n\r\n\"This is necessary\r\nLife feeds on life.\"\n\r\nNuff said.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nThis song isn't about watching TV... it's about the brutality inherent in human nature.  Ask me to prove it, and I will.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nSpeachless. This song is that good, if you don't recognize it there must be something wrong with you ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\ndavewah3, I think you nailed it right on the head.\n\r\nI saw that same interview and I think what MJK was implying with this song is how human beings in modern society have become too dependent on Television, Movies and the media.\n\r\nAnd I think the song does have flow once you kinda figure out the theme of the album.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nno wait i need some wine, and then i continue listening to this album and song for the rest of the day, sweet eh\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nI vicariously pissed all over this album through my dog, I cannot believe I wasted $12 on this piece of crap\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nThe first comment pretty much covered about what this song is about...\n\r\n\"Stare like a junkie into the tv, stare like a zombie...\" - Junkies (heroin or opium addicts), will eventually die due to the addiction, but ironically they're still alive while watching \"clean\" people die instantly on tv. (war casualties, criminals, ect.)\n\r\nCool concept. Tool is fucking amazing!\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nTREXOR he has been right about everything he has said besides the album being a hoax everything else is sooo true he is the only one that can truly criticze this band let him critiszce jesus christ\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nTREXOR said the song Jambi sucked lol is he right about that lol\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nor are you being sarcastic\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nGoD-Like-\r\n'- Junkies (heroin or opium addicts), will eventually die due to the addiction'\n\r\nyou got it alllllll wrong friend. for one thing, with opium especially, addicts generally live long and relatively healthy lives. heroin is not toxic to your body, like say alcohol for example...\n\r\nthe word junkie in the context of this song only refers to someone camped out on their couch, devoid of emotion, watching the tube....\n\r\nnote the line 'stare LIKE a junkie' ... and junkies stare bored, emotionless, and comfortable... ties into to the whole living vicariously through the tradegy of others theme...\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\negb-no offense, but that's porbably one of the stupidist things I've ever heard.\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\negb-no offense but you are probably one of the stupidest people I have ever heard... and Blindrider, the correct grammar is \"most stupid\"...  and in case you did not realize I am making fun of you...  I am\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\n\"addicts generally live long and relatively healthy lives. heroin is not toxic to your body, like say alcohol for example...\"\n\r\n...well, that explains Keith Richards...fwiw-I know some pretty old alcoholics too- the neighborhood piss tank never seems to die young...  \n\r\nMaybe it's not the toxin, but how the body responds to it...\r\nAnyhoo, I can't help but notice that Maynard's tone isn't all that condeming.  Shame is never suggested in the lyric-the listener is encouraged to embrace their own sick tendencies.  I'll drink to that...\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nok fuck this dipshit site... it's all for masturbatory little kids spewing ignorant bullshit, making themselves look like retards, and talking trash that they wouldn't have the balls to back up in real life... fuck you all.... i hope you die, every last one of you... fuck you... fuck you... fuck you.... especially you Blindrider you little cunt... you don't know shit...\n\r\ngoodbye...\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\negb-you just made yourself look like the biggest retard here. But I did say no offense, so if you did take offense it's not my fault. I can't help your insecurities. And yes, we will die one day-even you. I've never heard such an idiotic thing said. And btw, calling people names doesn't work...I laughed my ass off at what you called me. Go back to elementry school if you want to call someone names.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\n(Sigh...)\r\nI came to this sight seeking accurate lyrics and discussion on the meaning of the songs of my favorite artists.  Not to try to convince everybody that my opinion is right or my intellect is superior.  I walked head first into the monkey wars.  \n\r\nCan we all just take a deep breath (BREATH IN UNION) and continue with the discussion ABOUT THE SONGS without anymore egomaniacal outburst?  I'm gonna go out and get me a banana frappuccino and when I come back, if egb is done pouting I can explain why I agree with HALF his statement, and how it ties into Vicarious.\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nBlindrider, no offense but you are the most worthless excuse for a human being ever to exist.  you are a waste of genetic material.  I hope you trip walking into the bathroom hit your head on the counter and drown in the toilet, face next to your own turd because you forgot to flush last time...  you worthless pile of shit...  no offense of course :)\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nThirdeyewide-if you want accurate lyrics you would have better luck with lyrics007.com or another site.  as far as fuckwads like atreiu or trexor there is no way to keep them out of forum format like this.  \n\r\nBlindrider-just because you say \"no offense\" does not give you carte blanche to say whatever you want with no repercussions.  You should realize everything has consequences, even if you did not mean to be insulting.  \n\r\nAtreiu-nobody cares what you have to say.  you make me long for the days of TREXOR's bullshit.\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nBearcules-I know stuff has repercussions...I actually didn't mean to make egb mad-I don't hate him or dislike him or anything. I actually feel kinda shitty about what happened.\n\r\nAnyway, I think everything has been said about the meaning to this song. It's pretty straight forward.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nMay as well admit it, as people we like to watch shows on TV where other people die or are seriously injured.  It's what facinates/thrills humanity.(Guilty plesure.)  This applies to real life as well.  When you hear of someone dying on the news or something you feal \"Oh thats terrible!  what a shame!\" but deep inside we all think \"better them than me.\"  He's revealing the dark thoughts of the human mind.  awesome song.\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nis the rest of this album as good?\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nIMO-hell yes.\n\r\nI'm always a little suspicius of the first single off a new album.  With Tool, it's rare that the best song is the first single to be released-I think what happens is in the name of capitalism the most radio friendly song(s) is usually the first release.  Vicarious is an awesome song, but the rest of the album is what moves me.  On Aenema, I thought the most intense was Third Eye, on Lateralus, my favorite song is the title track, plus some of the slower, more eerie songs (Reflection, Disposition). This is probably why the band has such a huge fan base, and ended up topping the chart.  Fans know the best stuff may never hit MTV...\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nDoes anyone notice how this sounds rather similar to Dream Theater's \"New Millenium\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nDoes anyone know what he's whispering at the 5:00 mark?\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nholy shit Bearcules, thats really rough longing for that stupid fuck trexor, i do agree with you and everything but trexor (ouch)....and getting back to the song, bloody sunday has it about right\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nand yes, if anything the rest of the album is just as good/even better than vicarious...and holmes i see where youre coming from with the new millenium thing, i think it COULD be compared but maynard is just too different a singer to Labrie, instrumentally, i can see the comparison just not vocally\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nBearcules, you are the biggest douchebag on this site.  seconded closely by dustpan...  just because.  That was a cute little lecture you gave blindrider about ethics of speech,  I will be sure to be careful that I do not mistakenly offend someone.  God forbid someone have to take some fucking criticism now and then.  egb is a stupid cunt and deserved to be told off.  it is just too bad it was done by \"i do not want to hurt anyones feelings\" Blindrider.  incidentally, heroine is my new health plan. THANKS EGB! you've changed my life! thumbs up.\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\ni can't be held accountable for other people ignorance... be that about drugs or music or whatever... Atreiu, you are a loud mouthed little dipshit... (wouldn't wanna hold back, lest you call ME a pussy too)... just get fucked man, we all get it... you're smarter than everyone else here... K... happy?... \n\r\nnow, to finish my point on the subject that i'm now being insulted for...\n\r\nthe ONLY reasons people die or get dangerously sick (AIDS, hepatitus, abcesses) from heroin are...\n\r\n1. the most common.... improper needle use, even though a majority of heroin users don't use needles...\r\n2. inconsistant levels of purity due to illegal drug trade... a common factor in overdoses...\r\n3. mixing with other drugs such as alcohol...\n\r\nbeyond these dangers, one could in theory use heroin every day of their life without ANY health problems... \n\r\nwithdrawl is a different story, i worked at a detox clinic for about a year, you know what A(hole)treiu... you can die from alcohol withdrawls... you can't from heroin... ever seen someone with DT's... do you even know what that means? sorry should i slow down...\n\r\nbasically Atreiu, shut your mouth boy, you DON'T know more about drugs than i do. you can talk like you do, but you only come off as a recent DARE graduate...so just keep that foot stuffed in your mouth for a bit you little cocksucker... glad heroin's you're new health plan, but if you want a real kick, try injecting a solution of lye... it's a rush...\n\r\nthat being said, i was only correcting someone else's misconceptions when i mentioned heroin in the first place... in relation to this song... 'stare like a junkie' refers to someone staring without much interest or emotion...\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\n*by improper needle use i mean: reusing old, dull syringes... not keeping things sterile.... sharing needles.. etc\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\negb- Taking a hard line with me so I will not call you a pussy?  God you are such a fucking pussy!  \n\r\nPeople hooked on herione do not live long happy lives, withdrawel symptoms start within a matter of hours of the last fix.  yeah that sounds like a happy life to me, shooting up every four hours to keep the shakes away.  And yes I have seen someone with delirium tremens, I am in college after all.  I am glad that you get off on knowing so much about drugs though.  It is good to find something you are good at.  \r\nOh, and with heroine junkies, the initial high of injecting, sniffing, or smoking the drug is followed by several hours of slowed cardiac function, and drowsiness with clouded mental function (stare like a junkie).  Also breathing is drastically slowed, even to the point of death if enough is taken...  sounds like a harmless blast to me.   \r\nso shut the fuck up egb, and do not ever call me out unless you feel like making a total ass of yourself again.  You seem to like doing that.\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nAtreiu-\r\nFirst thing, egb said heroine is not as toxic as alcohol, he did not say it was safe and fun to use.  \r\nSecond, I think it is pretty well clear what stare like a junkie means.\r\nThird, you are a loudmouthed asshole, and no one gives a rats ass about what you think.\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nyeah... a college kid. i should have known... only college breeds such arrogance...\n\r\nthe time junkies take between fixes can be anywhere between 2 to 15 hours. withdrawls DO NOT set in in a matter of 4 hours, how the hell would full blown junkies sleep (and trust me, they do a LOT of sleeping) if they had to take a shot every 4 hours. i take it you get your info... uh... out of thin air maybe... are you just guessing? or did you get bad info?\n\r\nas for the whole cardiac/respiratory depression aspect... well yeah, so... all drugs do something to your heart and lungs... pot speeds it up, cocaine speeds it up, acid speeds it up, meth speeds it up, valium slows it down, heroin slows it down, alcohol slows it down... there's nothing unique about the fact that it slows down your heart and lungs. and one would have to take a truly massive dose to die purely from heroin... and it is next to impossible to do with sniffing or smoking... you're likely to pass out LONG before you get into dangerous territory... a majority of heroin related deaths occur when the user drinks alcohol with his heroin, falls asleep on his/her back, and asphyxiates on their own vomit...\n\r\nlet's take a brief look at the day of a hardcore alcoholic as compared to a hardcore junkie... under optimal conditions, of course...\n\r\nthe alcoholic wakes up sick... hung over. he must begin drinking as soon as he is awake, not just to fight off the hangover, but to stave off the shakes which are on their way. the drinker drinks until he feels alright, but since alcohol starts seriously losing it's effect about 2 hours after the last drink the alcoholic must continue drinking all day. alcohol being a drug that is difficult to control your high (blood alcohol levels) with, the equilibrium between being too sick to function and too drunk to function becomes blurred... the drunk drinks until he's fucked beyond his ability to maintain and then passes out, only to do it again the next day...\n\r\nthe hardcore junkie wakes up in the morning still groggy headed from his last fix the night before. eventually, he will take his fix, and depending on the size of his habit he will either go back to sleep or go on about his day if he has anything to do. it's not difficult, with heroin, to maintain a level balance of the high. even at his highest, the junkie can walk a straight line, speak coherently, not piss himself in public, not pass out in bad places, not start fights...\n\r\nanyway, my original point was that thinking about heroin users as lepers or something is foolish. it's just another drug, less harmful to the body than alcohol is... they still use it in hospitals as a matter of fact... \n\r\nif you'll read the original post in question carefully you'll notice that i never said junkies live long and happy lives... that's usually not the case... but i did say that opium smokers, historically, live long and relatively healthy lives. check out some mid to late 19th century chinese history if you feel the need to verify this. opiates are not poisons... alcohol is...\n\r\nthe most harmless of drugs can have a devistating effect on one person's life while the most heinous and vile of drugs can be safely used for years and years by someone else... an addiction has more to do with the person than the drug...\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nFirst of all i'll say hello to all tool fans here =)\r\nTool \"as it is\" means a lot to me...cuz of the sound, the whole experience in every single minute of their \"audibly art\"...\r\nand so i'd like to say something against these damn critism bout 10,000 days -in this case- its a damn hoax...\r\nlook at online stores - u'll find it in all of them....\r\nit cant be a hoax since its available in all stores...\r\nor r u thinkin a clever investor made this, paying millions to produce fake cd's and artwork to distribute? no way...so what trexor says is picked up in a cummunity where ppl r discussing this since it has been released and he read every comment and...\r\nthis has been written. this has been said. and this is what he believes in. he cant understand other opinions cuz he doesn't think about other possibilities...a topic wich tool processes with every single track...\r\ndont bother...he wont get behind songmeanings of tool while he doesn't listen careful to it...\n\r\nwell...enough...\n\r\nin fact i dont like to write down what i think and feel when i hear this song cuz when i do so i dont no where to begin...and when i no so then the song's over and i forgot what i wanted to say...\n\r\nmy opinion is - even if im totally wrong: \r\na song of tool losts its meaning when u remove something, in this case: the music in back of the lyric -or- the lyric in back of the music...\n\r\nso...this is what i get out of this song:\n\r\n\"inhumanitiy\" surrounds u, u see it in tv, ur keeping distance when u see it there, but u cant keep distance when it happens in ur environment...\n\r\nfinally \"inhumanity\" is the wrong word cause it is what we do every day...\r\nhumans see the light of the world, humans grow up, they help others or they kill others or they help others by killing another... they fall in love, become parents, die.\n\r\nTHIS is humanity and this is topic and so humanity can be a cruelly thing...\n\r\nthis song is linked to \"right in two\", is related to parabol/parabola, points to aenema....and finally its unique like the other songs....\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nNeuroQuila- it has been well documented that TREXOR is an idiot, and his foolish hoax theory was paper thin.  \r\nAlso, I do not think Tool songs lose all their meaning without the lyrics, pick up Metamorphic: A String Quartet Tribute to Tool, or Third Eye Open: A String Tribute to Tool.  some pretty amazing stuff.  is it the same...  no, but it definately packs some heat.\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nTHis is probly one of the most disturbing songs i have ever heard. all because IT\"S TRUE. people watch the news and hope that someone died a voilent death because its how they get their kicks. they love to see the suffering because they are always safe and sound inside with their TV blaring.\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nAhhh, such passionate rants...\r\nI don't mean to fuel the flames (okay, yeah I do) but...egb, you'd have to agree that large quantities of heroine, ethy alcohol, or any other drug of choice will kill a human being?  I previously agreed with half of your statement-\"addicts generally live long and relatively healthy lives. heroin is not toxic to your body, like say alcohol for example...\"  i'm pretty sure I got that original quote right.  \n\r\nEVERYTHING IS TOXIC--you just need to consume enough.  Alcohol among other drugs is a poison.  So is vitamin A-which is necessary for human health-injest enough and it will kill you.  Nicotine will stop your heart-if you get a high enough dose-preferably by injection.  And as for opiates?  Here's a sick little thought-terminal patients suffering immense pain with no hope of recovery are sometimes quietly given control over their morphine--and then given enough to commit suicide--they just need to hit that little button a few too many times...I could go on, but you're probably already thinking \"THIRDEYES FUCK'IN RIDING ME AGAIN!!!ARRGGHHH!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\"\n\r\nEverything is toxic, and to a degree, we need toxicity to survive.  The people hit hardest by polio were the kids in the squeaky clean subburbs of america, not the ones who swam in the hudson river...but I digress.  My point is (I did say I was going to agree with you, remember?)\r\nNo drug user should be treated as a leper, whether the drug is alcohol, pot, crack, blow, krispy creams, WHATEVER--Hell, lepers shouldn't be treated like lepers!  They have a freaking disease! \n\r\nBut we just can't pick drug A and say it's perfect and harmless, then pick drug B and say it's The Devil Incarnate- (I'm suddenly reminded of another song on this album) they are all chemicals that alter the human state.  the government made that mistake years ago and lo, we have a hopeless pointless war on drugs waging to this very day...\n\r\nSo, WTF does this have to do with the song???\n\r\n\"Don't look at me like I am a monster.\r\nThrown out your one face,\r\nBut with the other\".\r\nStare like a junkie into the T.V..\r\nStare like a zombie\"\n\r\nOur theme here is being a hypocrite therefore:\n\r\nDon't tell me i should quit drinking while you've got tracking marks all over your forearm...don't tell me to put down my hash pipe while you light your cigarette, don't spit on a homeless junkie then go home to a big bottle of oxycontin and valium...don't pretend your clean when you're sooo dirty.\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nactually thirdeye ... you clipped out the part of that quote that makes it make sense... what i actually wrote was...\n\r\n'for one thing, with opium especially, addicts generally live long and relatively healthy lives' ...\n\r\nsee ^^^ opium...\n\r\nand the whole thing started over my response to this dude's quote which said...\n\r\n'- Junkies (heroin or opium addicts), will eventually die due to the addiction, but ironically they're still alive while watching \"clean\" people die instantly on tv. (war casualties, criminals, ect.)'\n\r\ni was merely correcting a grave misconception...\n\r\nanyway... i never said that a large quantity of narcotics can't kill you. shit, you can die from drinking too much water. i was however stating that the popular assumtion that junkies are all sick and diseased people who have one foot in the grave is silly at best. and you know what happens when you assume right?\n\r\n anyway, when i refer to a drug as 'toxic' what i mean really is what it does to your liver. for example alcohol is highly damaging to your liver... cyrossis isn't an uncommon thing in hard core drinkers. opiates on the other hand... you could be pumped full of morphine all day, every day for 10 years and your body would suffer no ill effects from it. no liver damage... etc... that's all i mean by that...\n\r\nterminal patients eh? in the netherlands, terminal patients are often given shots of a coctail of diacetylmorphine (heroin), cocaine, and alcohol... in carefully measured doses, to keep their spirits up near the end. of course in the netherlands euthenasia is also legal, so...\n\r\nmy point is basically summed up in what you said here...\n\r\n'Don't tell me i should quit drinking while you've got tracking marks all over your forearm...don't tell me to put down my hash pipe while you light your cigarette, don't spit on a homeless junkie then go home to a big bottle of oxycontin and valium...don't pretend your clean when you're sooo dirty.'\n\r\nexactly... it's not what you use, it's how you use it that determines how bad off you're going to end up... all drugs can be used safely, and all drugs can be used very dangerously...\n\r\nwe're all hypocrites... we're just less so if we awknowledge the fact that it's unavoidable...\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\ni explained it wrong ^^\r\ni meant that processing lyrics without hearing them is senseless...\n\r\nbtw drugs can be healthy in the right dosis...\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nalright, nobody cares how much about drugs you know egb.  I was giving a \"worst case\" with the four hour hit comment, and it just shows how much you are grasping that you would latch onto that technicality.  Also try to keep your posts shorter than novel length, I know you have nothing better to do than post on here for hours on end.  But I am getting tired of having to read through all that garbage just so I can tell you what an idiot you are.  \n\r\nBearcules- shut the fuck up! nobody was even talking to you! you piece of shit.\n\r\noh, and I am not arrogant because I go to college, I am arrogant because I am so awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nThis song is unbelievable awesome.  Everything from the lyrics, to the drumming, to the overall \"programming\".  The lyrics are self explanatory I feel, but I wanted to throw out a quick comment on how great of a track this is.  This might be a candidate for my most favorite Tool song ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nAtreiu- sorry college boy... but i can't be blamed if it takes you 15 (maybe more even?) minutes to read something that took me 5 minutes to type... maybe some remedial reading courses could help you with that... hooked on phonics perhaps?\n\r\nanyway, any time you feel like pulling that foot out of your mouth and saying something that's not complete bullshit... we'll be all ears...\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\negb-It is not that it takes me a long time to read what you wrote, quite the contrary. I feel however, spending 2 minutes of my time reading the drivel you spew onto this forum is two wasted minutes of my life which I could have spent doing something more productive...  like staring at a wall, or counting along to my pulse rate.  \n\r\nYou may be right though, perhaps a remedial English course would help me to better understand your writing.  It has been a long time since I have read anything so elementary and mindlessâ\u0080¦ since fourth grade maybe? Fifth?\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nwow im feeling just a tad of hostility on this page\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\natreiu would you just shut the hell up already, when everyone is finally starting to agree with each other and end this ongoing arguement, you come in and drop a nuke on progress we've made\r\n\"my point is basically summed up in what you said here, exactly\" WOW SOME PASSIVE COMMENTS TOWARDS EACH OTHER, then you come in \"Bearcules- shut the fuck up!\"\r\nand that line \"oh, and I am not arrogant because I go to college, I am arrogant because I am so awesome.\" is the most self absorbed, conceded and probably the single greatest contribution of bullshit (next to trexor that is) this site has to offer\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nhey, some people are just attention whores... hard to blame Atreiu though... he seems to suffer from some kind of impairment... dyslexia possibly? well, it's something that seriously affects his reading ability...\n\r\nthough it also seems to cause a bit of megalomania (for Atreiu: that means ...A psychopathological condition characterized by delusional fantasies of wealth, power, or omnipotence) as well...\n\r\nanyway, Atreiu... you've contributed nothing more than space between relevant and interesting information... i'm done responding to you. as i've said before, arguing on the internet is like jerking off... it's just not as good as the real thing (though, i'm relatively sure you wouldn't know anything about that, and if so i can only pity the poor girl (guy?))....\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nokay, well, I thought this was a \"SONG MEANING PAGE\" not \"how to fight on the internet\".  Can't we all just get along?  I love the CD, the music is kick ass, and I still don't know what some of these songs mean but who cares. They're all good.\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nI think this song is about me. I sit here vicariously drinking a Dr. Pepper and laughing in my comfortable chair as several board members go at it with each other about heroine abuse. I'm probably gonna grab some popcorn later when they start making threats to each other. But seriously, what's more addicting? Heroine or discussion forums?\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nhaha, ah such a classy move...  \"oh wait I know, I can challenge his sexual orientation, surely that will distract him from the fact that I have nothing useful to say and that I have an inflated sense of my own self importance.  I will also use words like megalomania and psychopathological because I can look up their meaning and sound smart.  I am a genius\" -egb\n\r\nIf you really think that anything on this page is relavant and useful information you should have your head examined.  The full depth of meaning was delved into on the first page and the subsequent 8 pages of post have been so much masturbation, as you like to put it.  The fact that you have posted on here more than anyone else signifies that fact.  That and you are stupid (stupid means you lack intelligence)\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nJa mislim da ovo ima veze s pasulj!\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\narad512-Discussion forums.  No contest.\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\ni like the idea of this song, people sit back and watch the world go to hell. instead of getting up and tryin to change it, they'd rather sit. maynard said in an issue of REVOLVER that he's more or less upset with the current american culture, becuase we're unwilling to change things even though we may know them to be wrong or horrible. we just watch vicariously. obviously, that's what this song is about. it's kinda like maynard's way of saying, \"i give up\" haha i love it\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nAnyone ever stop and think that maybe this song is about tool fans living vicariously through Maynard's brilliance? Yeah, Maynard is a genious, but everyone that listens to tool seems to think the same about themselves. It seems to me like Maynard is tired of people trying to be something their not in general, but using television as an easily relatable medium. Some of the people on here need to stop trying so hard.\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nUmmmm...I listen to tool-and I know I'm not a genius.  I have noticed that people who declare themselves brilliant tend to be...less than?\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nDon't get me wrong, tool is my favorite band, but does anyone else see what I mean?\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\n... well with a band that writes songs with subject matter like Tool does (a little more complex than say... blink 182) than the person listening who 'gets it' recieves a little ego boost from it...\n\r\nso yes downward... i know what you mean... although i don't think that's what the song's about... i do however think that's one of the major problems some people have with Tool fans...\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\n... well with a band that writes songs with subject matter like Tool does (a little more complex than say... blink 182) than the person listening who 'gets it' recieves a little ego boost from it...\n\r\nso yes downward... i know what you mean... although i don't think that's what the song's about... i do however think that's one of the major problems some people have with Tool fans...\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nand what exactly are tool doing to change the world?\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nregarding the arguement between egb and arteiu, i delcare arteiu the winner. he had more convincing points with better come-backs and egb sank to an all time low when he challanged arteius sexual orientation. from the looks of it, egb sounds mentally retarded and thinks that what he says is the universal law.\n\r\noh, and egb, a natural cause of herion is collapsed veins which could result in a heart attack. funny how you failed to mention that little fact.\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nI dont think you can really declare a winner for an e-fight on a discussion forum. I dont see how everyone has to be so hostile when someone has a different opinion than you. You're suppose to discuss song meanings on this fucking site, not bitch about how you are right, almighty, and the greatest, and how the other person is a dumbfuck. You people are almost as bad as shoutwire.\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nwe already know what the song means, dipshit. it's not a hard one to figure out. \n\r\nif u havent noticed yet, egb is a first class idoit. he doesnt have a different opinion than mine, hes just wrong on the facts. hes as closed minded as the hardcore religious people hes been bashing. egb-u are stupid. get off this forum because no one gives a horses ass what u think anymore.\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nWell \"dipshit\", and I still dont get why people have to be such jerkoffs on this site, I know what the song means, obviously arteiu seems to just want to be a big faggot to everyone, instead of saying what he thought it meant and I guess argue about drugs...I didnt read the comments before that. And I didnt mean you had a different opinion, I just meant in general, thats what people tend to do on sites like these.\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\ni guess people like to make themselves feel better by making fun of other people and its easy on the internet. i have an exception for egb tho. i cant stand that guy.\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\noh, silly me, i clicked on page 9 to hopefully find the latest comments on the song \"vicarious\" from tool, but instead i got this bullshit. wtf?\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nlol yeah, usually songs get defined on the first page, if not the first couple. The last pages are just for people bitching at each other.\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nHaha yeah. Then there's someone who comes up with a really good idea about the meaning to the song, but nobody notices because they're too busy arguing.\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nmany tool fans misunderstand the subject of their adoration. they are quick to criticise others but do not look at themselves. tool fans (not all) claim to dislike organised religeon...    oh the irony\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nIlike tool aband a band a group p p p p p\r\n      tool is cool i go to skool they make me drooll!  \n\r\nmy other fave band is blink182\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nsomeone said trexor was MJK. he probebly isn't but treat him as if he is. he is not bringing you down. THe band TOOL is not a part of you . trexor treis maybe to evoke a reaction . i wouldn't be be be slurprised if he is one of the greatest tool fans ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nwat i said about blink182 was a joke\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nwat i said about blink182 was a joke\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\n\"Live while the whole world dies\" - such a powerful line, it drives the whole meaning of the song home. I empathize with the victims of stories that I see on the news, but at the same time, I am sitting there thinking \"I am so glad that that is not me\". \n\r\nI don't think everyone who is drawn to the tragic and morbid relish it, although there are those who do (ogrish junkies).  A feeling of triumph is what I experience. They are dead, and I am alive, and it is an empowering feeling. I am not ashamed of it, it is who I am. \n\r\nAs for those who actually find humor in the suffering of others, I hope to see you all on TV some day.  I would enjoy that immensely.\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nthis song is seemingly about complacency. people watch war, murder and other terrible things and complain about em. yet do nothing to aid in their removal. or to the effort. maynard said an in interview in revolver that he was sick of watching people act this way, and here's the evidence. way to go maynard. i love this band's music\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nThis is a good song, but definately not Tool's best. I still love it. I hope they come with a video for this song. If they do I hope it's a music video where you actually see the band unlike all their other ones. \n\r\nI want to know why Maynard hates religion, someone tell me.\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nJamin King-buy Opiate, it will all make sense.  Buy it-don't get it online. \r\nIf they make a video, I want to see more freaky people--I mean images of the band would be cool--but I love those freaky people!  especially the ones in Stinkfist...and Parabola.\r\nI almost get the feeling that the complacency in this song is considered a harsh neccessity.  Seriously-If we knew about all the sick shit that happended in the world on a daily basis, and then felt the sick shit was our responsibility to change, our fat little monkey brains would explode.  This is our limitation, and it allows us to function in the meantime-Sad, but true...I think of this song everytime I hear some puffed up celeb go on about the ills of the world as if they and their million dollar paycheck actually give a fuck (so, Bono, how many poor starving children are you supporting right now?)\r\nHey, I'm not suggesting that everybody join one of those \"Support an Orphan for a Penny a Day\" schemes--(seriously-don't do it, the kids never see a single cent-it all goes to rich fuckers and TV ad slots)  But we really are living \"while the whole world dies.\"  Just think-if you have a job, a full stomach , and you're expected to live to see your 50th birthday-you're better off than 80% of the population of the planet.\n\r\noops, sorry guys, I get all preachy after eating a plate of die Eier von Satan...\n\r\nUND\r\nKEINE EIER!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\negb, I said ADDICTS, not users...\n\r\nHeroin USERS can live healthy lives, ADDICTS will eventually die, and yes thats a fact.\n\r\nHeroin wears down opiod receptors in your brain, causing cells to die, just like alcohol, and unlike marijuana. THAT CAN KILL YOU.\n\r\nHeroin causes painful withdrawl symptoms anywhere from 6 hours to 24 hours after last dose, would you want to wake up every 6 hours to shoot up? SUICIDE is when someone kills themself UNDERSTAND?\n\r\nHeroin slows down your heart and restricts your lungs, the higher the dose, the more these effects take place. I know Ineed oxygen to survive.\n\r\nHeroin costs a shitload of money to keep up the habit, leading to crime (crime=guns, knives,)\r\nNeedles and spoons cost money...why not just share them? Cuz you get diseases that KILL you.\n\r\nI could go on and on about this, but Ill just conclude that you are a fucking moron.\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nGoD-Like-  you obviously have no idea what you are talking about.  I believe it is you who are the fucking moron.\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nholy shit egb, it is in fact you who is the fucking moron. as i said before, a natural cause of heroin is collapsed veins which results in less blood flow to certain areas of the body, depending on where the collapsed veins are located. if it is connected to the heart, a heart attack could result. \n\r\negb-a person could not theoretically use heroin everyday of their life without problem. addiction developes and so does tolerance. (if you dont know what tolerance is, it is when more of the drug is needed to feel the same effect and that could result in overdose)\n\r\nalso, i have a friend who used to use heroin and its not a good thing. you cant function right and youre basically cut off from the rest of the world. \n\r\negb-you are the biggest idoit i have ever seen in my life. do yourself a favor and get off this forum because all you do is make yourself look stupid. it would save yourself from anymore embarrassment.\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nThe amount of naive people here is astounding, I was compelled to sign up simply to voice my opinion on this one song that i've dwelled on for months.\n\r\nYou all read the verse \"Eye on the T.V. 'cause tragedy thrills me\" and hooked on it like flys to one of those zapping things.\n\r\n\"Vicariously I, live while the whole world dies.\"\r\nThis is the meaning of the whole song. Now i do admit that words and almost everything relating to humans can have completely contradicting meanings relating to said persons emotional situation at said time.\r\nHowever, for me this song verse means \"We should all envy the dead for they feel no pain\".\r\nAs i said, i feel that the entire song accentuates this main verse, i may be wrong in Tools eyes but i am correct because regardless their intent, this song means such to me.\n\r\n'myenemyisnear';\r\nQuote: \"As for those who actually find humor in the suffering of others, I hope to see you all on TV some day. I would enjoy that immensely\"\n\r\n'Tool'\r\nQuote: \"We all feed on tragedy.\r\nIt's like blood to a vampire.\" - \"Why can't we just admit it?\"\n\r\nThere are two kinds of people, wankers and liers.\n\r\n- eSSence\t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\nthe dingo- you are a fucking retard.  I use heroin all the time and my veins are just fine.  I am probably in better cardiovascular shape than you, you fat fuck!  so get the fuck of the tool boards and go back to listening to ashley simpson.\n\r\nnothing against ashley simpson who might be the single greatest voice of the next generation\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\negb-it takes time for your veins to become collapsed, idiot. and i also liked how you could back up your statement that im fat and listen to ashley simpson with evidence, cuz im fat, nor do i listen to ashley simpson. god damn you are the most retarded peice of shit ive ever seen! the last time i saw something like you, i flushed it.\n\r\n(btw i think you probably do live vicariously through maynard. just an educated guess.) =)\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\n*i had a typo in my last post...im NOT fat. (gaddamnit)\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\n*(goddamnit)\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\nanything posted by 'egb' in the last week has NOT been 'me'...\n\r\nsome cock has nothing better to do than smear my name on one of the few websites where it means nothing to me...\n\r\ni won't be posting under this name any more... so take that as you will...\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\nAtrieu has been posting under my name for the last week or so...only if you look closely you'll notice that it's eQb and not eGb...\n\r\nsend all you hate email to Atrieu please...\n\r\nfor what it's worth... i haven't posted here in weeks prior to today...\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\noh shit, egb, you are right. ok then, all my previous comments are now directed at eQb.\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\nso is egb or eqb the heroin adict\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\n... neither... egb is me... eQb is a little punk ass bitch who goes by Atrieu, who wants to smear my name on this site...\n\r\nplease feel free to flood his email with hate mail...\t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\nTHE JIG IS UP! haha, but it is I that is eQb not atreiu.  I suppose I should be a little insulted that you would think that simpleton would think of that...  but it is understandable given your little feud.  Anyway, I guess it was fairly childish of me, but it was just a bit of fun, this place is getting awefully boring lately. My apologies if anyones feelings got hurt, but if they did you take life (and especially online song lyric forums) waaaay too seriously ;-)\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\nThe jig is up!!  it is I, however, that assumed the moniker eQb, not atreiu.  I suppose I should be insulted that you would confuse my jest with that simpletons moronic antics.  but given the circumstances of the egb/atreiu feud it is understandable.  Anyway I suppose it was terribly jeuvenile of me, but it was just a bit of fun.  Anyone who is offended takes life (and especially forums about song lyrics) waaaay too seriously and you need to lighten up!  but I apologize if anyone recieved irreparable psychological harm ;-)\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\nsorry for the double post, forgot I already wrote on this one.  my bad\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\nhaha\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\nWould've never guessed it was Bearcules. When egb said it was Arteiu it made perfect sense! Bearcules, you really had us goin. haha\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\noh my godness\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\noh, my god!\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nWhat the fuck is this some kind of soap opera?\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nno are u som kind of douche\t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\nhaha\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\nOh my God your all insane.\n\r\nAgain rethinking as always, I think this song in part represents our dual personality, the primitive mixed with the divine. As much as you want to be perfect you are only human and no matter how enlightened you are you need to \"devour to survive\", \"life feeds on life\". We HAVE to have this side to us for us to survive.  By the way stop idolising MJK search yourself for your own way! I even have a sneaky suspicion that not even MJK fully understands his lyrics sometimes lol. It happens when you get caught up in writting, the reason being every single being on this planet is insane.\t\t\t\t\n\t\t\t\t\n\n", "comment_253": "\nSimplify. Simplify. Simplify.\n\r\nThis song is about how we idolize violence on tv and in the media but when we witness it first hand we can't handle it. We need violence.\t\t\t\t\n\t\t\t\t\n\n", "comment_254": "\nThis song is a big Fuck You to george bush. I need to watch things die from a distance describes wat bush is doing and the last half of the song describes his so called paranoia about iraq. Wicked song\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\nYou all just going to ignore the fact you have to kill something to live? Thats life.\t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\nyes a big fuck u to bush\t\t\t\t\n\t\t\t\t\n\n", "comment_257": "\nHey-sus fucking Kristos....\r\nOkay, You boys sort all your shit out, I'll come back when the discussion about song meanings (SONGMEANINGS.COM-not I'M A FUCKING RETARD WITH THE IQ OF A WET RAT.COM or I'M SO FUCKING BORED I GOT NOTHING BETTER TO DO THAN WHACK OFF AND THROW IT AT THE CEILING .COM)\n\r\nBuh bye.\t\t\t\t\n\t\t\t\t\n\n", "comment_258": "\nbye\t\t\t\t\n\t\t\t\t\n\n", "comment_259": "\nto all of you guys, if you have nothing to say, why you should say something at all.\r\nplease don't make another American Idiot page.\t\t\t\t\n\t\t\t\t\n\n", "comment_260": "\ndear third eye wide,\r\nur a fuking fag. the only time ur mouth shud b open is wen ur dads dick is in it we hav fun doing this bcuz if u dodnt friken notice the fisrt 6 pages about the song now y dont u go fuck ur mom and leave the aitude somwhere else and ur name sucks so get ur head out ur ass and get a life\t\t\t\t\n\t\t\t\t\n\n", "comment_261": "\n^^\r\nhe pretty much said it :O\t\t\t\t\n\t\t\t\t\n\n", "comment_262": "\ni need to watch things die from a distance describes wat bush is doing\t\t\t\t\n\t\t\t\t\n\n", "comment_263": "\nOnce you are living your life in awareness, it will be as though you stand high above others, witnessing their suffering, while you do not suffer at all. - Buddha\t\t\t\t\n\t\t\t\t\n\n", "comment_264": "\nSeriously, why do people insist on the fact that every tool song must be a walking, explicaple maze of ocean-deep mysteries?\n\r\nGet over it. Tool is a very diverse band and seeing the same enigmatic puzzles eccoing throughout EACH and EVERY track tool has ever made is just not going to happen, not should it.\n\r\nThe same thing goes for Right in Two, by the way. So its straightforward - sometimes thats a wiser choice.\t\t\t\t\n\t\t\t\t\n\n", "comment_265": "\nIts about setting TV higher than human or something\t\t\t\t\n\t\t\t\t\n\n", "comment_266": "\nits about how hard i fuk busty blondes\t\t\t\t\n\t\t\t\t\n\n", "comment_267": "\nDo you mean you fuck busty blondes vicarously, or while watching violent television?\t\t\t\t\n\t\t\t\t\n\n", "comment_268": "\nI don't know if this has been posted before but all I hear about in this comment page is how this song only reflects American culture. I think it can go on another level. Let me explain.\n\r\nEvery Tool CD has some underlying theme or tribute that people are forgetting to mention. Each theme on each album is expressed with an Intro, body, and a conclusion. For example: Anema - Intro: Stinkfist talks about how people should start opening their minds to new things. The body is Songs like Hooker with a Penis and Die Eier Von Satan that forces people to think for themselves to understand the situation. The conclusion is Third Eye where Tool finally says, \"See, now take this new way of thinking and apply it to your life.\"\n\r\nIn Lateralus, the theme is to be grateful that you are alive. The intro is The Grudge, saying that it is a waste of time to hold grudges with other people and it will only drain you of your life if you hold one. The body is mainly reflected in Parabol where the hole theme is to be gratefull you are alive, followed by the conclusion that is Disoposition and Reflection that is music that should make a person feel good and alive. Realizing that you should be happy you can smell the flowers; so to speak.\n\r\nIn 10,000 days, the entire theme of the album is Maynard's Mother. Every single song on the album can be a reflection to his Mother. Vicarious, for example, can be interpreted as how Maynard was forced to watch his Mother die slowly. Saying that watching death on the TV is A LOT different than seeing it happen in real life. Also that we shouldn't consider ourself experienced with death if we see it on the idiot-box. Obviously the body of the album is centered on Wings for Marie and 10,000 days. Saying that she should get a free pass into heaven because of the hell she had to endure on earth all while still staying faithful to the almighty. It ends with Right in Two and Viginti Tres. Very solid conclusions to the album. Reflecting that death is never a good thing, no matter what. Viginti Tres is just Maynards way of saying, \"Mom, you're home.\" \n\r\nNow to say that this album is inferior to the previous albums of Tool, I believe, is grossly wrong. In fact, I think it is the most personal album Tool has ever made. To express feeling in lyrics, and music so perfectly to reflect a memory of a loved one as they did in this album is a giant feat. The entire album is, in one word, beautiful. I could understand why they took 5 years to create it. It shows how Tool's music has matured through the years. I strongly believe this is one of the highest points in their carrier.\n\r\nOverall, I think this album has lived up to my eyes. To treat it as, \"utter crap\" is just a very synical view that unfortuantly many people take up. Tool has progessed further than that to keep the, \"world is crap, all I'm going to do is complain about it, \" attitude. It was started in Lateralus, it is now evolving into what is 10,000 days.\n\r\nDany Carey is the best!\t\t\t\t\n\t\t\t\t\n\n", "comment_269": "\nsure.  dont thrive on halo.  thrive on musical hatred towards religion\t\t\t\t\n\t\t\t\t\n\n", "comment_270": "\nWow, thoughtful synopsis Offatwork.   I agree with your assessment.  I would add one thing though -- Tool's albums tend to have multiple themes.  In addition to being focused on Maynard's mother, I think another important theme covered is how humanity is destroying the earth as we speak.   Vicarious states \"the universe is hostile, so impersonal, devour to survive...\" how all creatures - including humans - kill each other as part of the circle of life.  Unfortunately with human population and consumption out of control (and free market economics ignoring environmental costs) humans are destroying ecosystems, and because we go buy our stuff from a clean aisle at walmart we don't realize the impacts we are having....\"Vicariously we live as the whole world dies\".   Similarly, \"Right in Two\" speaks to the tendency of mankind to be violent and self-destructive even though we have the intelligence to see the big picture and think outside ourselves:  \"repugnant is a creature who would squander the ability to lift an eye to heaven conscious of his fleeting time here.\" \n\r\nAs far as your album review, I completely agree.   Most people who have given this CD poor reviews have forgotten the first rule in enjoying Tool's music -- listen to it many times; it will get better and better.\t\t\t\t\n\t\t\t\t\n\n", "comment_271": "\nThis song is so awesome...i can listen to it all day and never get sick of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_272": "\nAnother hype song, great! To me they sing about how selfish we all are and it points out we all have a bit of evil inside us.\t\t\t\t\n\t\t\t\t\n\n", "comment_273": "\nWitness the failure of art within this world.\n\r\nPlease, read that statement carefully.  Art is meant to inspire creativity, it is the tidal wave of energy that is meant to paint our worlds around us, coloring everything so brightly.\n\r\nUnfortunately, art today is used to stymie that.  We as creative thinkers are all letting the TV screen tell us what to do.  We let the movies take us away from our creativity.  It is creativity explained.  \n\r\nBut its not art's fault.  It is our own in the state of this world.  We are not quite monsters but so many of us are starved.  We are starved for love, feeling, success, and quality of life.  So many of us are alone, and with the internet, there's one more excuse not to be courageous and connect with each other.\n\r\nWe are letting the mediums control us, and we remain starved.  You are not a vampire by choice, but by survival.  When we lose ourselves we become desperate for the energies we don't receive.  We are acting and devouring out of survival, and unfortunately the world, government, and business have mandated this and incorporated it into technology.\n\r\nIt happened as soon as art was contained and transmuted into making a fast buck.\t\t\t\t\n\t\t\t\t\n\n", "comment_274": "\ntits\t\t\t\t\n\t\t\t\t\n\n", "comment_275": "\nand ass\t\t\t\t\n\t\t\t\t\n\n", "comment_276": "\nequals good night\t\t\t\t\n\t\t\t\t\n\n", "comment_277": "\ngood fight, good night\t\t\t\t\n\t\t\t\t\n\n", "comment_278": "\njust a note... the \"Carnivore and voyeur\" line might be reffering to the FBI 'Carnivore' program in which private civilian emails and electronic communications are intercepted and viewed by the goverment.\t\t\t\t\n\t\t\t\t\n\n", "comment_279": "\ncool do u watch porn in ur skidmarked undies\t\t\t\t\n\t\t\t\t\n\n", "comment_280": "\nhas anyone else noticed a possible production error at the begginning before the first second has elapsed?\t\t\t\t\n\t\t\t\t\n\n", "comment_281": "\nActually, has anybody even imagined that maybe we've all been tricked. I know that questioning religion these days is just asking to be burned at the stake, but it's worth it. The entire 10,000 days album is about Maynard's mother(just as Offatwork said) and there are also very strong religious overtones and undertones, i.e. \"Right in Two,\" \"Wings for Marie PT 2,\" etcetera. If you apply such facts to Vicarious, what do you get? Well, \"That's my kind of story,\" \"While the mother holds her child, watches him die, pleads to the sky crying: 'Why, oh why?' Because I need to watch things die,\" \"FROM A DISTANCE,\" \"Vicariously, I live, while the whole world dies, you all need it too, don't lie\" These quotes and pretty much all the other lyrics in this song sound like a First-Person perspective of GOD. This could be because of Maynard's anger/hurt toward God for his mother's problems, and he is again saying that you can devote your life to being religious and following all the requirements of such, and still get screwed(Remember APC's Judith). It is actually almost a sequel to Judith. Also, for anyone that has been following Tool, you will realize that Tool has many songs that Maynard doesn't mind writing a few lyrics against/about religion(christianity in particular). This makes perfect since if you are aware of his family's position on such things, and the effects this had on his upbringing. 10,000 days is amazing. LA TE RA LUS is amazing. AENIMA is amazing. Salival is amazing. Undertow is amazing. Opiate is amazing. Bottom Feeder and all their other bootleggs rocked. A Perfect Circle is amazing. TapeWorm would have been GREAT. Electric Sheep(project with Tom Morello of RATM) was awesome. Feersum enjin is great(sounds like tool rip-off though). Peach is sweet.Pigmy Love Circus is crazy. Alex Gray is phenomenal. Adam Jones is amazing. Justin Chancellor is amazing. Paul D'Amour is amazing.Maynard James Keenan is amazing. Danny Carey is amazing. Sorry for rambling on. All I have to say is, those of you who pray, please pray (for those of us who don't) that we get to hear more from these guys in the future(just in case prayer does work).\t\t\t\t\n\t\t\t\t\n\n", "comment_282": "\nDOnt know if anyone else has ever noticed this but at 5:00 into the song there is someone speaking in the backround. It isnt really faint but the music overcomes it by quite a bit.\t\t\t\t\n\t\t\t\t\n\n", "comment_283": "\nNVM did a search and people think it goes 'For more information go to Friday Morning...but the ballistic report and fingerprint analysis led investigators back to the home of the late [Irv?] Benson. The evidence suggests that Benson may have been shot by his own son, Nathan, age 26. For more information go to Friday Morning...but the ballistic report and fingerprint analysis led investigators back to the home of the late [Irv?] Benson. The evidence suggests Benson may have been shot by his own son, Nathan, age 26.'\n\r\nBut not totaly sure\t\t\t\t\n\t\t\t\t\n\n", "comment_284": "\nUh, anyone notice that these lyrics are still wrong? In a few places.\t\t\t\t\n\t\t\t\t\n\n", "comment_285": "\nelipse jareth is right\t\t\t\t\n\t\t\t\t\n\n", "comment_286": "\ni agree that all the news reports is the bad news, but what good news is it gonna report on? i squirrel learned how to jet-ski today! a sushi bar in london won an award for best international flavour! no body cares. good news is not as big as bad news, and if it is then it does get reported on anyway.\n\r\nnote: i speak for new zealand. not sure what its like over in the U S of A for ya\t\t\t\t\n\t\t\t\t\n\n", "comment_287": "\nA TOOL to shake|question indoctrination of any kind that anyone has been subject to since being born.\t\t\t\t\n\t\t\t\t\n\n", "comment_288": "\n\"Neither the brave nor bold will write us the stories sold\"\r\n  This line is about war propaganda. Maybe that might shed some light on the rest of song.\t\t\t\t\n\t\t\t\t\n\n", "comment_289": "\nbtw...\t\t\t\t\n\t\t\t\t\n\n", "comment_290": "\n1256910341178\r\n         +\r\n     15(23)\n\r\nFigure it out. It's not hard.\t\t\t\t\n\t\t\t\t\n\n", "comment_291": "\nThe ballistic report and fingerprint analysis led investigators back to the home of the late (?) Benson/Mansion. The evidence suggests that Benson may have been shot by his own son, age 8, or 6? We can always reshoot - The ballistic report and fingerprint analysis led investigators back to the home of the late [Irv?] Benson. The evidence suggests Benson may have been shot by his own son, age 8. Thank you/There we go.\r\nThe point of the news report IMO is to show how one can speak of/hear of a tragic event (shot by your 8 year old son?!?) and not only fail to give a shit but not even get the facts right. (8 or 6? who really gives a toss right?)\t\t\t\t\n\t\t\t\t\n\n", "comment_292": "\n-ReNeGaDe-NiNjA- , interesting idea, but I belive your order is off. 1256910341178 has 34 together, they should be reversed. Listen carefully to the ending of 4 and the beginning of 3. Exactly same pulsing sound very simmilar to 11, only diff frequency.\t\t\t\t\n\t\t\t\t\n\n", "comment_293": "\nNothing is written in stone\r\nRecently I found another order for the tracks in Lateralus. (Although it's pretty similar to the holy gift.)\t\t\t\t\n\t\t\t\t\n\n", "comment_294": "\nThanks for the feedback anyway anikitos. The important part though is syncing the chosen order with Viginti Tres. Trust me, it works.\t\t\t\t\n\t\t\t\t\n\n", "comment_295": "\nOn the topic of 3 and 4, here is another order.\r\n3117812569104\t\t\t\t\n\t\t\t\t\n\n", "comment_296": "\nI can't remember where I read this. However, all the songs on 10,000 days (awesome album btw!) is telling a story about this man who goes crazy, absolutely psychotic through watching TV. Each song contines the story.\r\nVicarious is the first and is him telling us how he sadistically enjoying watching the world die and suffer.\t\t\t\t\n\t\t\t\t\n\n", "comment_297": "\nA awesome song and a NICE start of the new album. The lyrics, as always, kick major ace and I can feel maynard though them. This song is about how people feel like all they could ever learn from in life is coming out of the television.\t\t\t\t\n\t\t\t\t\n\n", "comment_298": "\nFARENHEIT 451! Read it, see the movie, do what u gotta do to understand this song better.\t\t\t\t\n\t\t\t\t\n\n", "comment_299": "\nThe meaning is pretty obvious, just by listening to the song and all these fans here. But I wanted to say something else about this song. I just tried something different. With dj software, I could speed up the climax of 'Vicarious' from 0% to 13%. Result: sounds faster, harder and more spectacular. Some will see it as a rape, especially because MJK's voice sounds different and I mess with the song digitally. I thought it was pretty cool. Try the same with 'the grudge' but speed it up to 5%, sound cool too. But anyway, Tool rocks with or without dj software :-).\t\t\t\t\n\t\t\t\t\n\n", "comment_300": "\nIt's a rather accurate social reflection.\t\t\t\t\n\t\t\t\t\n\n", "comment_301": "\nI thought the song was written coming from George Bush's point of view, but that's when I thought the song said \"I own the T.V.\" And the part where it says \"I need to watch things die\" I thought that could've meant that Bush was looking at his soldiers dying in Iraq, while he's in the U.S. in comfort, hence \"from a distance\".\n\r\nIf you look at it that way it would make sense, but now it's \"eye on the t.v.\" so my interpretation doesn't make sense anymore. :( Oh well, I tried.\t\t\t\t\n\t\t\t\t\n\n", "comment_302": "\ni like to post my comments before reading others so that i dont \"bite\" ideas...\r\n                                     when my friend sent me this song (some time before the album came out) it was the ONLY song i listened to for hours and hours while i was online. i thought about the lyrics while i listnened...and yes it could be about people watching TV if you're obvious but... i think it's about \"God\" and how \"God\" can just sit back and watch people die (like humans watching TV) and \"God\" just goes on living while everything dies. i dont exactly believe in God but thats what i got from it.\t\t\t\t\n\t\t\t\t\n\n", "comment_303": "\nThis song makes me laugh hard - because it's funny.  \"I need to watch things die.\"  Plus, it PERFECTLY presents what the hell people do - rot their brains on the TV and gossiping about it.  Goddammit, this song is addicting as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_304": "\nREAD AND LISTEN TO THIS!!!\n\r\n7812569103411/67584131221911310/15\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_305": "\nTool: The Cyclic Playlist.\r\n6,7,5,8,4,13,12,2,1,9,11,3,10 / 15 / 7,8,1,2,5,6,9,10,3,4\t\t\t\t\n\t\t\t\t\n\n", "comment_306": "\nThis song might be about americas media, how it portrays the world as an evil place (and we just eat it up).\t\t\t\t\n\t\t\t\t\n\n", "comment_307": "\nTool Synclist (complete)\r\n7,8,1,2,5,6,9,10,3,4 - 6,7,5,8,4,9,13,1,12,2,11,3,10 â\u0080\u0093 15,14 (or 14,15)\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_308": "\nEvolutionism/naturalism worldview is assumed by MJK, but can't explain this alleged craving for  tragedy he writes of, let alone any 'problem' with such behavior. Honestly, I personally can't make the confession he demands ALL OF US to make  \"Why don't we just admit it\" ! Now, the Christian worldview provides the root cause of this behavior and that is indeed a problem. MJK needs to take his own advice and CHOOOOOSE TOOOOO, LET GO of his grudge against Christ.\t\t\t\t\n\t\t\t\t\n\n", "comment_309": "\nTo me this song could represent any one or any thing that would sit and watch the shit in this world happen.  Be it people sitting in front of TV's watching people get slaughtered on the news or be it Jesus sitting on high watching everything down here unfold.  We all live vicariously through all the people that we watch on tv.  We sit and think \"this could never be me\" but we should all just admit the fact that we thrive off of other people's misery.  We want to watch it from a good safe distance, hoping and praying that nothin ever happens to us.  We all need to admit that we are ENTERTAINED by others' misfortunes.  And that is very sad.  That is what this song means to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_310": "\nOh and just to prove my point he says Vicariously I live while the whole world dies much better you than I.  Meaning we like to be entertained by the misfortunes of others as long as those misfortunes dont hit too close to home (much better you than I).\t\t\t\t\n\t\t\t\t\n\n", "comment_311": "\nI think this song is a \"Stinkfist\"-type thing. Its meaning appears to be so simple that it distracts you from the real meaning. \"Stinkfist\" obviously seemed to be about anal fisting, so people automatically assumed as such. I'm just suggesting this could be another case of Tool tricking their fans by cloaking a deep meaning into a seemingly easy song to interpret.\t\t\t\t\n\t\t\t\t\n\n", "comment_312": "\nheres a theory -all american tv networks are owned by multinational corporations, whose main priority is profit. Since their goal is making money, they need to sell their stories to the public. And the public wont watch them unless they are entertaining. and what entertains people? according to maynard it's watching ppl die. ok so bush starts this war in iraq, which every tv station in the US provides coverage of, im sure most americans watched the war on tv. think about the huge amounts of money the media made from the so called \"war on terror\". Bush paints himself out to be  the good guy- you know- and iraq is evil etc. its like watching an action movie where america is the hero. sensationalism. and thats what this song is about. Large media corporations profiting from the masses watching bush's war on terror. the whole bush administration is completely controlled by corporations seeking to make a profit. And the media is the most powerful of these. Bush is a puppet for the media, and is working with the media to brainwash the american people into believing that he is waging a war on terror.. the real terrorists are the media moguls(rupert murdoch etc) who were profiting from coverage of the war. so all you get to watch are stories that are designed for one purpose- entertainment to the consumer. so you watch more and more and more. i admit to finding the iraq war quite entertaining, but it was just the way the media portrayed it. i think this song is an attack on sensationalism in the media. not people having some sort of built-in desire to watch others die. Im sure if half of americas population saw what is really happening in iraq they would be disgusted. its just the media portraying in a sensational way, attaching a story involving heroes and villains, that makes it entertaining to watch.to quote salival \"think for yourself, question authority\"-ie dont believe everything you see on the news.\t\t\t\t\n\t\t\t\t\n\n", "comment_313": "\nThe Neo-conservative manifesto explains alot of what the American media, mainly Fox News portrays. Nazi Germany figured out that whoever controls the media controls the minds of the masses and the Neocon/Bush administration are applying this same priniple. This song is also about our inherit bloodlust because it is this bloodlust that the media are appealing to. My first impression of this song was the reality TV pandemic (Vicarious) There may be an element of that in this song as well.\r\nPOUR BODIES LIKE SHEEP TO THE RYTHYM OF THE WAR DRUMS!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_314": "\nsry thats; COUNT BODIES LIKE SHEEP TO THE RYTHYM OF THE WAR DRUMS!!!\r\nMust've had brain bubbles.\t\t\t\t\n\t\t\t\t\n\n", "comment_315": "\nI see this song as why do we, America, have such a morbid desire to watch things die? why do we love death so much? why do we kill eachother? we live on the same god-forsaken rock anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_316": "\nIt's not just America, it's all of us. We may wear clothes and cut our hair but we are still savage creatures.\t\t\t\t\n\t\t\t\t\n\n", "comment_317": "\nhere's something\r\nVicarious 7:06 or 6:66 !\t\t\t\t\n\t\t\t\t\n\n", "comment_318": "\nCesaro summability strikes again.\t\t\t\t\n\t\t\t\t\n\n", "comment_319": "\nThis song is kind of like a message to people. When the song starts you hear about this monster of a man who feeds off tragedy; then later it's like he shows how we are no different to him.... Maynard really rocks.. The meaning is a little more than nations vegetating infront of the television feeding off the bullshit past of people dying... To me it's more of a don't judge message.... But that's the miracle of Tool, it's always open to absurd interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_320": "\nHas any heard the guy talking in the background yet? Ive been trying to find someone who can mute out all the music and just have the guy playing. he starts talking at 4:58 of the song and continues talking till 5:28, ive searched all over for someone that might have heard it but no luck.\t\t\t\t\n\t\t\t\t\n\n", "comment_321": "\nYeah we know about the voice over. Great Destroyer posted his translation on page 12.\t\t\t\t\n\t\t\t\t\n\n", "comment_322": "\nits about how numb our society has made us to death and killing, how we just watch it on teh news and in movies and dont think a thing of it... that or evil politicians... or both.\t\t\t\t\n\t\t\t\t\n\n", "comment_323": "\nhard to understand most of the lyrics\t\t\t\t\n\t\t\t\t\n\n", "comment_324": "\nAnyone who is a fan of the OgrishForums will have a certain connection to this song...\t\t\t\t\n\t\t\t\t\n\n", "comment_325": "\nMaynard is being sarcastic. We all as human beings fucking kill eachother, torture eachother, ruin eachothers life...and all out of selfishness, as if we are some kind of monsters.\n\r\nWe do it as if we LIKE to watch people die, literally or figuratively.\t\t\t\t\n\t\t\t\t\n\n", "comment_326": "\nhey that 6:66 is pretty cool\t\t\t\t\n\t\t\t\t\n\n", "comment_327": "\nyou guys dont get it. blood is flowing comon . were just animals think about life in general you see somone   look up the deff of the song you look a a girl/guy hey wow she hot cute i wanna bone her w/e yea  no . maynrads dick for instance    if all the sudden she dropped dead   . not cool      (vicarios)\t\t\t\t\n\t\t\t\t\n\n", "comment_328": "\nthis is to whoever said they wanted to hear maynard sing.           he once said in interview he thats why he dont put lyrics in albums lol     411        you gotta be hilikus !!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_329": "\nthis song is sort of like the song spring by rammstein, if you havent heard it search it on here, they are both about how people \"feed off of\" other peoples pain, and are both really good songs\t\t\t\t\n\t\t\t\t\n\n", "comment_330": "\neveryone listens to these songs and hears only a few words out of what Maynard says. lol\n\r\nIn this song they only hear Tragedy, and TV really.\r\nthat has a lot to do with it but dont forget when he says\n\r\n\"Vicariously I live while the whole world dies.\"\n\r\na lot of people Vicariously live through others, (Vicariously doesn't have to be tragedy)\r\nyou see it everywhere, everyone copies each other based on what they see. instead of worrying about something like this bullshit war where innocent people are dying, or even the enviornmental issues going on,\r\neveryone worries about their Starbucks, Hollister, Bluetooth, Laguna Beach, or for example, and im not going to say names, but One crazy white bitch shaves her head and the whole word fucking stops...\t\t\t\t\n\t\t\t\t\n\n", "comment_331": "\nOne crazy white bitch shaves her head and the whole WORLD fucking stops...\n\r\nhaha\t\t\t\t\n\t\t\t\t\n\n", "comment_332": "\nIncredible song, my favorite from Tool and in my opinion, the only great song from 10,000 Days.  I think it's about TV desensitizing people, certain television shows *coughs CSI, Law & Order..coughs*  show terrible things that shouldn't even be mentioned here.  Awesome job, Tool.\t\t\t\t\n\t\t\t\t\n\n", "comment_333": "\nViiiiiiiiICARiiiiiiiiiiiiOUSSSSSSLYYYYYYYYYYYY IIIIIIIIIIII!!!!!!!!!!!!!!!!!!!! EE-LIVVVVVVVVE WHiiiiiiiiiiiiiiILEEEEEEEEE THEEEEEEEEE WHOOOOOOOOOOOOLEEEEE WOOOOOOOORRRRRRRRRLD DiiiiiiiiiiiiiiiIESSSSS!!!!!!!!!!\r\nEE-MUUCCCCCHHH BETTTTTTTTTERRRRR YOOOOOU THANNNN iiiiiiIIIII!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_334": "\nThis just means...we like watching people die...even though one part of us thinks it is sickening and disgusting an another side of us wants to watch on. and why can't we just admit we all like to see things be killed off. and that things being killed fascinates us. ''Much better you than I'' In other words this song is all about death lol\t\t\t\t\n\t\t\t\t\n\n", "comment_335": "\ni think the song is about us being in war since the begining of time. over things that are not that important, half the time, we constantly resort to violence. we always talk about how it bad but we watch shows where people die all the time, as the T.V. warps our mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_336": "\nCREDULOUS DIVEST?!??!?!\n\r\nAre you incapable of listening???\n\r\nI'm sure from his other works that Keenan is, in fact, capable of constructing a more coherent and intelligent phrase.\t\t\t\t\n\t\t\t\t\n\n", "comment_337": "\nThis song just shows how screwed up humanity is in the all mighty and all conquering west is and this is coming from someone who lives in Australia where our prime minister thinks G.W.Bush is the greatest thing to walk the earth.Why actually go to war with another country when you sit back and watch the whole thing unravel on the television instead.It's like system of a down said \"why don't presidents go to war they always send the poor\" Why stand up for humanities rights when you can sit at home and watch it on TV and continusally say how bad something is. Its like blood to a vampire we all need to feed on something at some stage and human tragedy seems to be the only thing we've got at the moment as long as it's not us or someone we know or love I wish everyone the best\t\t\t\t\n\t\t\t\t\n\n", "comment_338": "\nwell, this is the kind of song that makes me proud that i don't watch televison.  But that doesn't change my human nature.  My human nature, just like yours is that my goal is self preservation.  If you had to choose between dying and watching someone else die, what would you choose?  That is the case here-the television has redefined the way we experience the world around us.  We can now observe things from the comfort of our own homes.  Although there is alot of shit on TV, this song seems to refer specifically to the news.  The news is inundated with stories of death, murder, tragedy, war.  Which is what we should expect right?  After all, what's more exciting: the story of a successful field trip made by an elementary school, or a story of that group of kids dying after their school bus drove into the river?  That is the point of this song- we love tragedy, we love the sensation of still being alive and safe while we are entertained by the information given to us by our televisions.  So, two points to this song- TV is shit, and humans-no matter how much we deny it- are ultimately self centered, self preserving, creatures that feel little remorse in gaining something from the loss of their fellow man\t\t\t\t\n\t\t\t\t\n\n", "comment_339": "\nIt's not about watching television. It's about deriving pleasure from all the negative and gruesome things happening to others we see on TV. We can't deny that we feel better about our lives by seeing others in misery. That's how humans are and that's what this song is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_340": "\ni think it's:\n\r\n\"credulous at best your desire to believe in angels in the hearts of men,\r\npull your head on out your hippy haze and give a listen, shouldn't have to say it all again\"\n\r\nthat seems logical and sounds right to me atleast..\t\t\t\t\n\t\t\t\t\n\n", "comment_341": "\nThis song is amaazing!\n\r\nI think it's about all the voilence in the world, that we, the wealthy people, just watch instead of helping the people who are really suffering.\n\r\nThat's what the song makes MORE powerful \t\t\t\t\n\t\t\t\t\n\n", "comment_342": "\nThis song is fucken so good, i live for tool\t\t\t\t\n\t\t\t\t\n\n", "comment_343": "\nbeing that i am an Aussie, and a great supporter of the ANZAC spirit, (where some average joes' decided that our nation and our freedom was worth fighting and dying for, and they fought and they were killed for the Aussie way of life). i think this song kinda mentions how little we think about the greater population any more. we dont care too, as long as some1 else takes our fall and our punishment. Well at least thats what i take out of this song and thats all i wont out of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_344": "\nI think this song means that we just sit on the coach all day and watch the tragedy's that happen in the world on t.v. and how we are punished because we don't do anything about the problems in the world.\n\r\nVicarious means to suffer in place of another. This acn mean just about anything, but to me it means that the U.S. troops suffer while we just watch what happens on our television (they suffer and we watch instead of doing something about it). People need to stop talking about problems in the world and ACTUALLY do something about them!!!\n\r\nVicarious A.K.A. punishment.\t\t\t\t\n\t\t\t\t\n\n", "comment_345": "\nWe don't give pause until the blood starts flowing\" This song is a warning. A cold and truthful warning. Nothing gets done in this world unless someone is killed or hurt. For example 9-11. Yeah I know we are all sick of hearing about it. But airport security\r\nshould have been better than what it was. And we americans didn't give a shit until some folks went and died. Tool is tapped in to the river of artists' thought. And many artists out there feel that horrid air of waiting. Something bad is soon to happen within the world. We feel it and we are trying to wake the world up to it. Tool came right out and said it. Care now becasue when shit hits the fan then you will know how to deal with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_346": "\nthis song isn't half bad ...for a tool song ha ah\r\nnothing against tool but they are just not my piece of cake\r\ni'm more of a lamington\t\t\t\t\n\t\t\t\t\n\n", "comment_347": "\nHas anyone considered that in Roman times it was entertaining to watch torture, dismemberment, death, etc.  Only they could only watch it as it happened.  At least we have the luxury of self-censorship to soften the unpleasantness.  Maybe TV isn't that bad after all.  You can always change the channel and watch reruns of \"I Love Lucy.\"  But these shows do give me horrible nightmares...Bring on more hearty fare like The Running Man and I will be happy!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_348": "\nSorry for the useless comment, but...\n\r\nJESUS CHRIST WHAT AN INTENSE SONG. i listened to it and had to rush to the bathroom\t\t\t\t\n\t\t\t\t\n\n", "comment_349": "\nYea joe uve nailed it mate, good post\t\t\t\t\n\t\t\t\t\n\n", "comment_350": "\nHere are the lyrics I am pretty sure:\n\n\r\nEye on the T.V., cuz tragedy thrills me\r\nwhatever flavor it happens to be\r\nlike killed by the husband\r\ndrowned by the ocean\r\nshot by his own son\r\nshe used a poison\r\nin his tea, kissed him goodbye\r\nthats my kinda story\r\nits no fun til someone dies\n\r\nDon't look at me like\r\nI am a monster\r\nFrown out your one face\r\nbut with the other\r\nstare like a junky into the T.V.\r\nstare like a zombie\r\nwhile the mother holds her child\r\nwatches him die\r\nhands to the sky cryin\r\nwhy oh why\n\r\ncuz I need to watch things die\r\nfrom a distance\r\nvicariously i live while the whole world dies\r\nyou all need it to dont lie\n\r\nwhy cant we just admit it\r\nwhy cant we just admit it\r\nwe wont give pause until the blood is flowing\r\nneither the brave nor bold, or writers of stories told\r\nwe wont give pause until the blood is flowing\n\r\nI need to watch things die\r\nfrom a good safe distance\r\nvicariously I live while the whole world dies\r\nyou all feel the same so\n\r\nWhy cant we just admit it?\n\r\nPart vampire\r\npart warrior\r\ncarnivore and voyeur\r\nstare at the transmitter\r\nsing to the death rattle\n\r\nla,la,la,la,la,la,la,la,lie (x4)\n\r\nCredulous, divest\r\nyour desire to believe in\r\nangels in the hearts of men\r\npull your head on out you hippies and give a listen\r\nshouldnt have to say it all again\r\nthe universe is hostile, so impersonal-\r\ndevour to survive, so it is, so its always been\n\r\nwe all feed on tragedy, its like blood to a vampire\r\nvicariously I live while the whole world dies\r\nmuch better you than I...\t\t\t\t\n\t\t\t\t\n\n", "comment_351": "\nburton my good man divest is definately not what he says in that last part of vicarious its \"credulous at best\" and its not hippies he says \"pull your head on out your head please and giv a listen\" and as for this song well its open to interpretation, as all tool songs go, but it seems that his message is pretty clear \"the worlds goin to shit an no ones gona do anything about it\" we all just sit around and piss and moan about how the worlds goin to hell but does anyone realy ever do anything to prevent it? no were all gona wind up fuckin this planet over so bad by the time anyone does anything its not gona matter anymore. were all gona be fucked and thats exactly what maynard is saying.\n\r\npeople need to stop believing in bullshit \n\r\n\"beliefs allow the mind to stop functioning.  a non functioning mind is clinically dead. believe in nothing...\"\t\t\t\t\n\t\t\t\t\n\n", "comment_352": "\nmaynardslyrics.com\n\r\nI think Maynard's words need to be shared with the world, in their most accurate form. He is something of a lyrical genius, and we all know this. The site is very simple, but the main object of my site is not the layout, it's the lyrics. You will not find more accurate tool/apc/puscifer lyrics anywhere. So feel free to browse, peruse, if you will, maynardslyrics.com ...\n\r\nI have all the Tool albums done, minus Opiate, which will be added very soon.\n\r\nAll his APC stuff, minus emotive, which will be added very soon.\n\r\nAnd as soon as his Puscifer stuff comes out, expect it to be added as well.\n\r\nIf you see any lyric or line that you feel is not what you think it should be, please feel free to email me @ magiclessmarker@maynardslyrics.com\n\r\n-magiclessmarker.\t\t\t\t\n\t\t\t\t\n\n", "comment_353": "\n\"Why can't we just admit it? Why can't we just admit it? We won't give pause until the blood is flowing.\r\nNeither the brave nor bold, or writers of stories told.\r\nWe won't give pause until the blood is flowing.\"\n\r\nFucking awesome verse.\t\t\t\t\n\t\t\t\t\n\n", "comment_354": "\nWhat I hear:\n\r\nCredulous at best your desire to believe in angels in the hearts of men, pull your head on out your hippie haze and give a listen, shouldn't have to say it all again.\t\t\t\t\n\t\t\t\t\n\n", "comment_355": "\npeople feed on violence and war, thats the way of the world.\r\n\"The universe is hostile,\r\nSo impersonal.\r\nDevour to survive, so it is,\r\nSo it's always been\"\r\nthis part is pretty self explanitory\r\n\"Cause I need to watch things die... from a distance.\r\nVicariously I live while the whole world dies.\r\nYou all need it too - don't lie.\"\r\nvicarious means to gain from what someone else does, so this is self explaintory too.\n\r\nI love how he says die at the beginning, its demonicly pleasing\t\t\t\t\n\t\t\t\t\n\n", "comment_356": "\nI think a lot of people are overlooking what Maynard may be saying simply because the song is easy to get.\n\r\nThis song, to me, seems almost like a trick. It almost begs you to admit how you are vicarious, and how you can not survive happily until your mind has fed off the sustenance of others' suffering. But then, when you do, you feel no better; there is no peaceful resolve. You realize your own sickness, which you (humanity as a whole) have been trying to deny with all your existence. All that work and effort thrown away, because now you have been tricked into seeing this truth about yourself.\n\r\nBut, this basically goes in flow with The Pot. It gets the point across that you are not much different than the author, and then The Pot rolls along a few songs later and asks, \"so why the hell are you waving your finger at me? Ganja, please!\" \n\r\nOf course, the songs between these two help build a certain guilt that may be present within the listener. We go from a depiction of indulgent, almost sickening, humanity to a person who was so tremendously holy. The comparison makes the listener go from \"admit you're fucked up\" to \"look at this amazing person who no one can ever be\" and then rolls into The Pot, basically say \"So why the hell do you think you're better than me?\"\n\r\nSounds reminiscent of certain Christian converting tactics. Perhaps another insult by Maynard to a faith he seems to detest strongly?\n\n\r\nI don't know for sure though, maybe I'm giving Tool too much credit. The songs, as an individual and whole, however, flow beautifully, and are just as entertaining to listen to either way.\t\t\t\t\n\t\t\t\t\n\n", "comment_357": "\nyo, are these lyrics the full correct ones? for sure? \r\niu dunno, i was pretty sure the lyrics were different in one or two places... only a copuple o' words though.\r\ni'm probably wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_358": "\nI don't know if this hasn't already been said before. (Because I'm lazy and didn't read throuhg all of the comments.) But I think that a bit it could also be a about hypocrites. The lyrics \"Don't look at me like I am a monster\"  and \"Why can't we just admit it\"  are like him saying that if you when you hear this song you believe that being Vicarious is repulsive, in one way or another your a hypocrite. Being Vicarious is being natural.\n\n\r\n*If someone alreay posted something like this I am sorry.\t\t\t\t\n\t\t\t\t\n\n", "comment_359": "\ndoes tool believe in God???\t\t\t\t\n\t\t\t\t\n\n", "comment_360": "\nCorrect lyrics posted on Toolarmy.com\n\r\nVICARIOUS\n\r\nEye on the t.v cuz tragedy thrills me.\r\nWhatever flavor it happens to be.\r\n(like)\r\nKilled by the husband...\r\ndrowned by the ocean...\r\nShot by his own son...\r\nshe used a poison in his tea, Then she kissed him goodbye.\r\nThat's My kinda story\r\nIt's no fun till someone dies.\n\r\nDon't look at me like I am a monster.\r\nFrown out your one face but with the other you\r\nStare like a junkie into the t.v.\r\nStare like a zombie\r\nwhile the mother holds her child. Watches him die.\r\nHands to the sky, cryin' \"why, oh why?\"\n\r\nCuz I need to watch things die, from a distance.\r\nVicariously, I live while the whole world dies.\r\nYou all need it too don't lie.\n\r\nWhy can't we just admit it?\r\nWe won't give pause till the blood is flowing.\r\nNeither the brave nor bold nor brightest of stories told,\r\nWe won't give pause till the blood is flowing.\n\r\ni need to watch things die, from a good safe distance.\r\nVicariously, i live while the whole world dies.\r\nyou all feel the same so why can't we just admit it?\n\r\nBlood like rain come down. Drum on grave and ground.\r\nPart Vampire, Part warrior, Carnivore, and Voyeur\r\nStare at the transmittal. Sing to the death rattle\n\r\nCredulous at best, your desire to believe in angels in the hearts of men.\r\nPull your head on out your hippy haze and give a listen.\r\nShouldn't have to say it all again.\r\nThe universe is hostile. so Impersonal. devour to survive.\r\nSo it is. So it's always been.\n\r\nWe all feed on tragedy. It's like Blood to a vampire.\r\nvicariously, I live while the whole world dies.\r\nMuch better you than i.\n\r\nWords\r\nby\n\r\nMAYNARD JAMES KEENAN\t\t\t\t\n\t\t\t\t\n\n", "comment_361": "\nsmall correction: instead of \"thrown out you one face\" its \"frown out you one face.\"  Meaning when the world's watching, the person frowns at him dissapprovingly, but \"with the other,\" he indulges himself like everyone else.\t\t\t\t\n\t\t\t\t\n\n", "comment_362": "\nThis song is an absolute masterpiece the intro is superb\t\t\t\t\n\t\t\t\t\n\n", "comment_363": "\nEverlast909 - \"does tool believe in God???\"\n\n\n\r\nhahahahahahahahahahahahahahahahaa\t\t\t\t\n\t\t\t\t\n\n", "comment_364": "\n...Credulous at best, your desire to believe in angels in the hearts of men.\r\nPull your head on out your hippy haze and give a listen.\n\r\ni think hes trying to show that we arnt exactly all nice and kind and that we all like and want to see disaster\t\t\t\t\n\t\t\t\t\n\n", "comment_365": "\nMaynard is basically saying \"you look at me like I'm a monster for what I  sing about, how I dress, etc...but look at what you zombies all view as entertainment, news, etc\"\t\t\t\t\n\t\t\t\t\n\n", "comment_366": "\nfrom a musical point of view, theres a point in the song where it goes from good to perfection, the ear can not help but listen carefully to this part of the song because of its beauty, if you had a message to put across in a song this is where you would put it, and ''shouldn't have to say it again'' would suggest this is the important bit, he practically spells it out for you. ''the universe is hostile so impersonal, devour to survive so it is, so its always been.\t\t\t\t\n\t\t\t\t\n\n", "comment_367": "\npart of it is about america\r\nwe feed on tragedy bloodshed and  violence\r\nif it doesnt involve one of the 3 we arnt interested\r\n''its no fun untill someone dies''\n\r\nits also about the war in iraq.. or wherever the fuck they are these days.\n\r\n''vicariously i live while the world dies'' and ''watch things die from a distance''\n\r\n''much better you than i''\t\t\t\t\n\t\t\t\t\n\n", "comment_368": "\ndude i love the video for this song, but i feel tht this song is mainly about how as a nation we are hooked on living through the lives of Movie stars and the like its gotten to the point where we are almost shut off to the world IDK.\t\t\t\t\n\t\t\t\t\n\n", "comment_369": "\nokay... so we're talking about the whole magazine generation, feeding off other people's pain, and therefore swallowing and using it as their own. Am i right?\t\t\t\t\n\t\t\t\t\n\n", "comment_370": "\nOk, so first off, im not about to read 17 pages of a bunch of whiney little girls argueing about whether maynard or tool as a band is better.\n\r\nThere are always going to be tool fans, and there are always going to be maynard fans.  Personally, i like them both.  But i think that the other three memebers of tool don't receive nearly enough recognition.\n\r\nThis song to me is about how it is human nature to feed off the tragedy of others.  It's always been that way -- in roman times, gladitorial arenas -- it is that way now, and like maynard says.. it will probably always be that way.\n\r\n\"Pull your head on out your hippy haze and give a listen.\r\nShouldn't have to say it all again.\r\nThe universe is hostile. so Impersonal. devour to survive.\"\n\r\nok, so all my life i have always been a huge advocate of natural selection.  but once i started doing alot of drugs i realised that natural selection was just the system of the past, and that humans need to be able to move above it.  Hence the \"hippy haze\".  But what tool is saying here is that we can't move above it, because it is just survival.  If we move above it then we cease to survive.  Now this point of view is understandable, but i respectfully disagree.  One of my favorite sayings is applicable here:\n\r\n\"In a world filled with darkness, it is better to light a single candle than to curse the darkness\"\t\t\t\t\n\t\t\t\t\n\n", "comment_371": "\nThis song to me is an example of the basic sadism of our modern society.\r\nYou see a story of two mutilated bodies on the side of a highway. You watch.\r\nOprah donates money to a homeless shelter. You generally change the channel.\r\nWe ADORE conflict. It is our obsesion, or fix. We thrive off of our own and others pain. We jack off to bondage. We spy on the helpless and wounded but don't dare lend a helping hand. It's too exciting to destroy with kindness. You don't watch unless you know your not supposed to. Unless there is some form of shame you can later feed from. We don't like sex. We like rape.\r\nThis is our cycle. This is our orgasmic torture. If what I just said made anyone uncomfortable, don't kid yourself. Remember? You like it.\t\t\t\t\n\t\t\t\t\n\n", "comment_372": "\nSo I've never really worked out the lyrics to this song... I'm particularly high.  I flip on ten thousand days and kind of recline into an awake meditative state... and for the first time this song's meaning just screams at me.  Absolutely beautiful, no matter how much of tool you hear, there is always more.\n\r\nA year ago I would have laughed at the idea of picking a favorite band.  Impossible right?  If not for Pink Floyd and Alice in Chains... Tool would be an obvious pick.\t\t\t\t\n\t\t\t\t\n\n", "comment_373": "\nthis song is a direct message.  no need to explain any meanings.  it is a damn profound song.  Tool officially owns my soul.\t\t\t\t\n\t\t\t\t\n\n", "comment_374": "\nThis song is Unique, sounds awesome as well\t\t\t\t\n\t\t\t\t\n\n", "comment_375": "\nVery direct song, it's about human nature. We love tragedy, we enjoy seeing people do dangerous things because, deep down, we want to see them be injured. The Romans had the coliseum, we broadcast wars on television. The last two lines of this song are amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_376": "\nITS NOT ABOUT HUMAN NATURE !its about factores play theire roles in our damn modern society.actually media...and its influence on people.the kind of human who is result of this society.sorry for my bad engish \r\nps :i dont think humans really have sth called nature !\t\t\t\t\n\t\t\t\t\n\n", "comment_377": "\n2012 year\r\nthe end :(\t\t\t\t\n\t\t\t\t\n\n", "comment_378": "\nI agree with Luca303. The song is GREAT and it is a kick ass first track for a brand new CD. Crazy vocals and all around badass CD. Can't wait for another.\t\t\t\t\n\t\t\t\t\n\n", "comment_379": "\ni personally think this song is about religion\r\njust listen to it the next time through a filter of religion and the song will blow you away even more\n\r\nTool is one of those bands where the meaning can look apparently obvious, but there are still deeper meanings, no matter the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_380": "\nnevermind what i said, i was drunk.\t\t\t\t\n\t\t\t\t\n\n", "comment_381": "\nDoes he after part \"Stare at the transmittal. Sing to the death rattle\" he sings \"Lie lie liee liee liee lie\" or just \"la la la la la\" ... ?\t\t\t\t\n\t\t\t\t\n\n", "comment_382": "\nAh nevermind, on official lyrics says \"La, la, la, la, la, la, la-lie (x4) \" . Both la and lie are there :)\t\t\t\t\n\t\t\t\t\n\n", "comment_383": "\nGood song, all the way.\t\t\t\t\n\t\t\t\t\n\n", "comment_384": "\nI think the song is about how we kill ourselves, not with the wars like the one we are in right now, but its about the human scum that kill each other instead of focusing on a common enemy.\t\t\t\t\n\t\t\t\t\n\n", "comment_385": "\nsic43\r\nMan ur right. i though the same thing, lyrics really really nest in this beauty of heavy sound Vicarious.\t\t\t\t\n\t\t\t\t\n\n", "comment_386": "\nI'm pretty sure this is talking about our obsession with violence as human beings. Then we criticize each other about it when all of us desire and seem to enjoy the same thing. Great lyrics. \n\n\n", "comment_387": "\nWhat I got out of vicarious after SEVERAL listens plus the veiwing of the short cgi movie made for this song and listening to the documentry and commentary and what not I have come to the conclusion that the song is about being so hypnotized into watching tv and how everything is about destruction and death and we enjoy watching it and forget that we are apart of the world thats crumbling and what i saw in the storyline of the video was that in the end the main character who was watching this devastation over a dry lake bed eventually became the victim of the story he seemed to hypnotized by.... so in a sense we are all apart of this world and sitting back thinking that every tragedy in no way affects us or ever will is down right stupid.... thats what i took from it (pretty much all the same principles of what others have said ive or take one or two points)\t\t\t\t\n\t\t\t\t\n\n", "comment_388": "\nok, i just found this out nd realized that this has somthing to do with this song, 2 words, one group of people... the romans,think about it,they had a colasium where people paid to watch other people be eaten by lions,ripped apart,etc. SO... \"vicariously the romans lived while the hole world dyed\" \"the romans liked to watch things die throm a distance\". as fer the \"eye on the TV\" part, the TV could just be a metaphor or somthing. so yea, tool could be talking about the romans.\t\t\t\t\n\t\t\t\t\n\n", "comment_389": "\ngreat song, tool kicks ass!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_390": "\nThe universe is hostile. so Impersonal. devour to survive.\r\nSo it is. So it's always been.\n\r\nscrew that. this sort of thinking is why we are in such a mess, why we all believe in the capitalist system that crushes us.\t\t\t\t\n\t\t\t\t\n\n", "comment_391": "\nwow. amazing song. im glad i found this website\n\r\n\"Frown out your one face but with the other you\r\nStare like a junkie into the t.v.\r\nStare like a zombie\"\n\r\nthese lyrics seem to depict the TWO-FACED PEOPLE who sit in front of tv and watch tragedy occur to people on tv and on the news.  these tv watchers think they are better off than the people on tv, yet they waste their own lives staring like a \"zombie\" into the tv. aint that some shit?\n\r\nthe message: people need to start living their own damn lives! and stop worrying about wat happens to others!\t\t\t\t\n\t\t\t\t\n\n", "comment_392": "\nand alot of the lyrics are wrong. dont learn these and sound stupid when you sing it. lol\t\t\t\t\n\t\t\t\t\n\n", "comment_393": "\nWe all thirst for blood, we're entranced by it, it's our very basic nature and the nature of the universe, so we entertain ourselves through witnessing the sorrows of others. You want to see death, admit it.\t\t\t\t\n\t\t\t\t\n\n", "comment_394": "\ni just love the word vicarious. \t\t\t\t\n\t\t\t\t\n\n", "comment_395": "\nThis song to me is how we all sit in front of our tv and watch all of the horrible things that are happening but do not care because it does not affect us directly  \n\r\n   \"We all feed on tragedy. It's like Blood to a vampire.\r\nvicariously, I live while the whole world dies.\r\nMuch better you than i.\"\t\n\r\nThis here shows how we all feed off of the tragedy and watch the world die around us and as long as it isnt us then we are fine with it\t\t\t\t\n\t\t\t\t\n\n", "comment_396": "\namazing song, check out the sweet music video. i love the gigantic eye inside the earth at the end.\t\t\t\t\n\t\t\t\t\n\n", "comment_397": "\nok to this briannevelle.\r\ni understand what your trying to say, but i dont agree with it, these other guys were right, im glad they caught onto it.\r\nTOOL is called TOOL and not MAYNARD because its not just Him. all the members of tool contribute, and the lyrics are very poetic and awesome on their own, but the true tool experience and how its is meant to be heard is with the music.\r\nk?\r\nK!\n\r\nand the song is just F@*!ing awesome!\t\t\t\t\n\t\t\t\t\n\n", "comment_398": "\nMan this song kicks ass\t\t\t\t\n\t\t\t\t\n\n", "comment_399": "\nI believe this song is about how the media decencitizes us. Vicarious basically means to take in place of another. It tells of how we're amused in a sick way of the images in the media, of people dieing, and how we have no feelings towards it, as long as it isn't happening to us. That's basically all I have to say about it. It's a very powerful song, and I agree with it. Every bit.\t\t\t\t\n\t\t\t\t\n\n", "comment_400": "\nPretty basic meaning. If you read the correct lyrics at least.\n\r\nIt suggest there is 2 sides of us:\r\n- The side that watches these horrible things in awe, horrified by them and saddened by them\r\n- And the side that realizes its horrible, but yet we cant look away, and want to see more, because deep down its a sick pleasure\n\r\nAnd all hes suggesting is all people have that instinct, whether they want to admit it or not. So he admits it, and seems like the bad guy, but the same person who judges him as bad will go home and live up to the hypocrisy.\n\r\nAs long as its not happening to us, we will continue watching.\r\nAwesome song.\t\t\t\t\n\t\t\t\t\n\n", "comment_401": "\nFor those interested in the concept which this song presents, I recommend reading \"The Birth of Tragedy\" by Friedrich Nietzsche as well as Arthur Schopenhauer's \"Essays and Aphorisms\"...\n\r\nArthur Schopenhauer pessimisticly illustrate the idea that suffering is the only thing guaranteed in the world, so in turn it would be foolish to assume that anything besides suffering holds any true meaning. We need suffering in order to give value to the pleasure in our lives.\n\r\nIn the Birth of Tragedy, Friedrich Nietzsche (inspired by Schopenhauer) goes on to say that tragedy is actually an affirmation of life - we catalyze the tragedy in art to express and reflect the injustice and chaos which we have experienced in life, in turn relieving the burden of the suffering.\t\t\t\t\n\t\t\t\t\n\n", "comment_402": "\nthis song is about much more than just being entranced by the TV... its about attaining a new level of consciousness. i havent read any of the other interps on this page, so sorry if i reiderate.\n\r\npretty much what he means when he says \"vicariously i live while the whole world dies\" is that he feels dis-attached from the rest of humanity, due to our 46/2 chromosome count. scientists believe that the next evolutionary jump for humans is to 48/2, which based off the patterns of our ancestors will lead to a higher level of consciousness, likely a \"hive mind\" sort of thing.\n\r\nthen when he says \"you all feel the same so why dont you just admit it\" he implies that he knows that everyone else feels dis-attached.\t\t\t\t\n\t\t\t\t\n\n", "comment_403": "\nI don't know if anybody has already asked this but does anyone know what Maynard says towards the end. \r\nThere is a background voice saying something around 5:00. And My curiosity won't let me sleep because of it. Thanks in advance. \t\t\t\t\n\t\t\t\t\n\n", "comment_404": "\nlet's all drown in our own sado-masochistic misery while we listen to some fucking tool.\n\n\r\nhonesty is crude\t\t\t\t\n\t\t\t\t\n\n", "comment_405": "\ntool rocks.... enough said\n\n\n", "comment_406": "\nits pretty hard to tell what the background is during the bridge but if i had to guess id say its just random news reporters and clips on violent stuff\t\t\t\t\n\t\t\t\t\n\n", "comment_407": "\nIt's a mocking account of the way we have fun at the expense of others. Pretty much what's already been said, but put a little differently.\t\t\t\t\n\t\t\t\t\n\n", "comment_408": "\nOne of my fav tool songs thought it was lame whn I first heard then I got the cd and whn I took the time to understand wht he was talkn bout I loved it and the music kicks ass stop listining to bootlegs and judgin shit I think he's talkin about humans gttn of on tragaty!\t\t\t\t\n\t\t\t\t\n\n", "comment_409": "\nWe are always deceived. We all choose those trickster leaders, so we are guilty of their every crime. We don' t do anything against their cruel politics, what they do the people and the world, we just watch. Great song...\t\t\t\t\n\t\t\t\t\n\n", "comment_410": "\nI always used to think it started: \"I am the deviant cause tragedy thrills me\". Would have made sense because society views him as deviant for being thrilled by tragedy but yet most people are but will not admit it.\t\t\t\t\n\t\t\t\t\n\n", "comment_411": "\nA sort of morbid song. I like it! The music video is EPIC! Glad Tool decided to use CGI. I REALLY want this album! It's about a guy who enjoys watching the world die while he lives.\t\t\t\t\n\t\t\t\t\n\n", "comment_412": "\n\r\nThe song i believe is just saying, we live in a media centric world. And we seem to now live off the tragedies of others so much so we couldn't live without it.\n\r\nNews always focuses on the big issues, so we can highlight the problem and find a solution to the problems hopefully start a discussion, just like all art, music, spoken or written.\n\r\nSo it seems Maynard has got it wrong. We don't need to live vicariously through others suffering. It just seems that way...depends on what he really meant, i guess.\t\t\t\t\n\t\t\t\t\n\n", "comment_413": "\nI really think it is as simple as it sounds I need to watch things die. I view it like the ID, EGO, and SUPER EGO everyone has the ID deep down beneath all our social affiliation to follow right and wrong. We all will still have the barbaric tendency but some people who won't accept it in a situation of one killing another deep down we all truly enjoy peoples demise.\t\t\t\t\n\t\t\t\t\n\n", "comment_414": "\nwe are all selfish creature only subject to our own well being for example not exactly what the song implys but a metaphor : i dont think anyone rated + on anyones elses ideas, even through they are if not the same better than others. we are all basically out for our own: human nature i guess\t\t\t\t\n\t\t\t\t\n\n", "comment_415": "\nThey're representations of people's hearts and minds. The idea here is that we just stand there, watching the evil ofÃ¯Â»Â¿ the world propagate, and do nothing. When you try to do something about it, you escape from the land of death.\t\t\t\t\n\t\t\t\t\n\n", "comment_416": "\nExcellent song...TOOL owns, always have.  Great song, it's time we change. \n\r\nThe universe is hostile. so Impersonal. devour to survive.\r\nSo it is. So it's always been.\n\r\nIt's only this way because that's how we make it.  Choose life over control. \t\t\t\t\n\t\t\t\t\n\n", "comment_417": "\nThis song is completely sarcastic, Every single line of it.\r\nHe's mocking people who get thrills out of watching others die. It's a pathetic existence.\r\nAt the end he also mocks people who think the universe is some sort of dog eat dog place when it really doesn't have to be. We just make it that way with the attitude he sarcastically conveys in this line.\n\r\n\"Credulous at best, your desire to believe in angels in the hearts of men.\r\nPull your head on out your hippy haze and give a listen.\"\n\r\nMaynard is a totally sarcastic hippy at heart and he makes this music because it pains him to see how people treat each other. Did I mention this song is sarcastic? haha.\t\t\t\t\n\t\t\t\t\n\n", "comment_418": "\nThis song is about how people need to watch all the violence on tv, they need it to feel better about themselves. Peopl;e need all the useless information and violence on tv.\t\t\t\t\n\t\t\t\t\n\n", "comment_419": "\nMy god people, stop over-complicating it. This song's meaning can be summed up into one word: voyeurism (not necessarily in a sexual way either).\t\t\t\t\n\t\t\t\t\n\n", "comment_420": "\nPretty cool post. Itâ\u0080\u0099s really very nice and useful post.Thanks for sharing this with us!itâ\u0080\u0099s my first visit. Another great post, I appreciate all the work you put into this site, helping out others with your fun and creative works  youpkonline.com/index.php/…\">javed chaudhry columns\n\n\n", "comment_421": "\nthis is in a twisted way pointing out all the things wrong with today, but we still need it, can there be order without chaos? no. this points that out in my opinion\t\t\t\t\n\t\t\t\t\n\n", "comment_422": "\nWell the lyrics are about as straight forward as any from tool. But if you're still questioning anything I suggest you read them out loud to yourself. I'm sure you'll find it much deeper than zombies staring at a television.\t\t\t\t\n\t\t\t\t\n\n", "comment_423": "\nlove this bloody song :P\t\t\t\t\n\t\t\t\t\n\n", "comment_424": "\nmy interpretation of this is that death amuses us all , and we enjoy seen others in pain aslong as we arnt \r\neffected by it , and watching it over the news on t.v is a safe haven where we wont been judged by others \r\nbecause we are ashamed of the joy we get out of watching others in pain , tools lyrics are beautiful and deep , one of my best bands\t\t\t\t\n\t\t\t\t\n\n", "comment_425": "\nThis song is about why the news centers on what it does, combined with that feeling, you know, when someone does something wrong and then thats one thing, but then they have the AUDACITY to pretend the opposite. Everybody knows that feeling.\n\nOkay fine, violence is interesting, thats the way we're wired, so be it. But for fucks sake, don't act like you're above it.\t\t\t\t\n\t\t\t\t\n\n", "comment_426": "\nThe song is about how us people are so attracted to violence. We turn on the TV and watch the news. Nobody cares about the news until somebody dies. We enjoy watching death from a safe distance. I'm not sure if I explained that well, but hopefully you can understand.\t\t\t\t\n\t\t\t\t\n\n", "comment_427": "\nso im a huge tool fan, you can tell by the way my acount is tooliscool   lol    but anyway i personally think this song is basically about how humans need to watch others suffer, its afourm of life. by the lyric \"eyes on the tv\" its refering to the news (which is a great fourm of finding out about deaths and such)  think of it this way, when you pick up the newspaper and the headline is WIFE MURDERD BY HUSBAND. Like that is what is naturally going to attract a humans attention, especially compared to polictics and such. suffering, being murderd, death ,p ain and everything of the sort is like a drug for a human, as long as they dont get hurt themselves. i myself am attracted to deaths, just like the song says, why cant we just admit it? even the president will have enjoyment from death and suffering, its a human instinct.  haha sorry for anything false, im 11\t\t\t\t\n\t\t\t\t\n\n", "comment_428": "\nI think psychologytoday.com best explains this song - \"\nWhy? The answer may lie in the work of evolutionary psychologists and neuroscientists.  Humans seek out news of dramatic, negative events. These experts say that our brains evolved in a hunter-gatherer environment where anything novel or dramatic had to be attended to immediately for survival. So while we no longer defend ourselves against saber-toothed tigers, our brains have not caught up.\n\nMany studies have shown that we care more about the threat of bad things than we do about the prospect of good things. Our negative brain tripwires are far more sensitive than our positive triggers. We tend to get more fearful than happy. And each time we experience fear we turn on our stress hormones.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_429": "\npsychologytoday.com/blog/wired-success/201012/…    explains why VICARIOUS is an accurate observation regarding upright apes walking around killing each other  while the congragation of apes watch in disgusted delight....\t\t\t\t\n\t\t\t\t\n\n", "comment_430": "\nI think this ones about how there life is no longer sacred, and how we all get a thrill from watching people kill or be killed... \t\t\t\t\n\t\t\t\t\n\n", "comment_431": "\nPretty sure it's another one criticizing the media for feeding on sensationalism and turning us into unempathetic monsters.\t\t\t\t\n\t\t\t\t\n\n", "comment_432": "\nThis song goes well with manga \"Gantz\"...\t\t\t\t\n\t\t\t\t\n\n", "comment_433": "\nI believe in \"angels in the hearts of men.\" Human's are not all evil. We're good too. Our capacity to love, and empathy...\t\t\t\t\n\t\t\t\t\n\n", "comment_434": "\nThis is a very psychological song and has an amazing beat. \\m/\t\t\t\t\n\t\t\t\t\n\n", "comment_435": "\nMaynard uses his voice to throw what is in all of our psyche back at us; trying to show us who we really are as in vicarious and, for instance, Forty six & two, where he uses Carl Jung's theory to teach us about the \"shadow\" that's within us all and how we are all \"picking at our scabs\" (ourselves)to truely become who we are. Tool's lyrics are some of the most brilliant I've ever heard. I can't say that I pretend to know as much as some of the other comments but after some deep study into the ones I've really listened to, that is what I take from them. The band's musicians are great and play an excellent part into drawing you into the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_436": "\nI personally believe this song has a double meaning, like what the previous comments say about the decline of modern society, but also it's a song about how god who physically doesn't exist per se, lives Vicariously through the belief of the very people who live and die on earth.\n\r\n\"Hands to the sky crying \"why oh why?\" \n\r\n\"Cause I need to watch things die from a distance\"\n\r\nA few other hints like the angels in the hearts of men line, or the universe is hostile; it's a common belief that the universe itself is god.\t\t\t\t\n\t\t\t\t\n\n", "comment_437": "\nAnd so this song is about the bullshit laws created by man and not god to keep our natures in check? \t\t\t\t\n\t\t\t\t\n\n", "comment_438": "\nI LUV THIS SONG LOLZ.\r\nIt's a good song.\n\r\nNo srsly. I want the latest comment.\r\nARGHFBARFGABABBLE!\n\r\nKbye.\t\t\t\t\n\t\t\t\t\n\n", "comment_439": "\nThe first line sounds more like 'I own a TV' than 'eye on'. Makes more sense considering the line after it, too.\t\t\t\t\n\t\t\t\t\n\n", "comment_440": "\nThey are talking about today's world, with TV. But when I listen to this song I always consider that this is not new behavior for humans. Death has always been entertainment, as long as it happens to someone else. Lynchings were a popular attraction throughout Europe and America until 100 years ago. The Romans pitted slaves against each other in fights to the death. It's a big morbid circus. Modern media just gives us easy access.\n\r\nMaybe it all goes back to the Jungian shadow stuff that og_tool has enlightened us with. That was an awesome comment.\n\r\nAnother interpretation of my own, which is not supported much by the lyrics I admit, is that God is the one vicariously experiencing death through our mortality. God can't die, so he made life that way. It is cruel. We are made in God's image, sharing his nature while being human, so we are cruel. But, I don't know if this song is actually saying anything about God.\t\t\t\t\n\t\t\t\t\n\n", "comment_441": "\nits not just that it amuses us or we like violence and death and destruction. Its that it is necessary. \"devour to survive so it is, so its always been\" basically he is saying embrace it. pull your head out your hippie ass. if you want peace prepare for war type of thing. and stop acting appalled at it when its inside you too. Sigmund Freud came to the conclusion after studying the events of world war 1 that the desire to cause destruction is the single greatest motivating factor in human beings. It is more powerful than sexual desire. thats deep right?\t\t\t\t\n\t\t\t\t\n\n", "comment_442": "\nIts very fucking simple, you dumb-ass hogs.  Quit trying to over-complicate it.  He's talking not only about human perception, but God's as well. We are created in his image (or so the Holey Bible {no, I did not mispell that} tells us)...  It's as plain and clear as the sunrise in our everyday lives: we crave death and destruction... because he does and he made us that way because its fun to watch us slaughter each other.\t\t\t\t\n\t\t\t\t\n\n", "comment_443": "\nI am a huge Maynard fan ... He is proabably the most true artist of my generation.  I have one question though??? Does this song sound like crap to anyone else but me?  I'm not talking about the lyrics but the music is too loud and over powering over Maynard's lyrics which are the true genius.  Don't get me wrong I love good guitar riffs and and drum beats ... but this song makes me wish I could hear Maynard sing it  acapella.  The beats sound old and redone ... and all I want to hear is Maynard's words ... Talk crap on this post ... I say your not a true Maynard fan... F@#k tool ... F@#k APC ... Maynard is what we true fans want to hear ...  I find it funny how people today are debating lyrics when it is nearly impossible to hear Maynard's voice over the music...  I really hope on May 2, Maynard realizes this song sounds like crap... and holds it another two weeks so I can hear his lyrics (tell me I'm not right) I own every cd with maynard on it and everything else I can only get off the net... I'm a fan of the man ... his bands are secondary...  Seriously ... i want to hear a good arguement about what I've said...Or even more that i'm exactly right... I'll stop ranting here but expect some later with bullshit fake fan coments....\t\t\t\t\n\t\t\t\t\n\n", "comment_444": "\nThis song means to me that I need to change my underwear cause I just soiled them\t\t\t\t\n\t\t\t\t\n\n"}