{"comment_0": "\nI think the guy doesn't care for her much - she's trying to get him to love her. Trying to convince them: \"They say that the world was built for two, Only worth living if somebody is loving you\"\n\r\nTrying to persuade him with perfumes, big kisses, getting undressed, pretending to be a 'bad girl'. But he keeps playing the videogames... \n\r\nShe even tries to like the videogames too, but I think she knows that the guy doesn't really like her. He is ignoring her. \n\n\n\n", "comment_1": "\nI think this a melancholy tune about a girl who loves a guy who isn't that nice to her.  She tries to please him wearing his favourite dress and perfume.  \"whistling my name\" suggest he calls to her and she runs to him like a dog to his master.  They lyrics \"Watching me get undressed Take that body downtown\" suggest at a darkness.  \"They say that the world was built for two Only worth living if somebody is loving you\" suggest that she thinks she will only be happy if she is with someone.  The reference to video games might mean he plays her like she is a game or it might be that she less important to him than video games.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI'm going to give my opinion on video games, and I've probably listened to the song over a hundred times. When the song first came out I remember reading an interview or article where Lana explains how it's about two people. One guy she's actually currently in a relationship with. The other is an old relationship that she's obviously still thinking about the guy, and wishing things had turned out differently. She went onto say that the verses are about how it actually was with the one guy and then the chorus is how she actually wished it had been with the previous relationship. From the lyrics you can grasp that the current relationship is kind of becoming tedious. But if you actually pay attention to the lyrics you will pick up that she uses two different possessive adjectives \"his\" and \"your\". With that in mind if you look at the lyrics it makes sense because even though she's with one guy everything she's doing subconsciously is for the other. \n\n\n\r\nSwinging in the backyard\r\nPull up in your fast car whistling my name \r\nOpen up a beer\r\nAnd you say get over here and play a video game\r\n(This is what actually happened.. \"your\")\n\r\nI'm in his favorite sun dress \r\nWatching me get undressed take that body downtown\r\n(She's in his, meaning the other guys favorite sundress)\n\r\nI say you the bestest\r\nLean in for a big kiss put his favorite perfume on\r\n(She says he's the best and is putting on a facade of total happiness, yet she still puts the other guys favorite perfume on)\n\r\nLike previously stated the chorus is about the old relationship and how she wished it had been. It correlates with how she referenced it in the verses, how she's doing things for the other guy even though she's in a relationship with the one. She's putting on his favorite sundress and perfume. \n\r\nIt's you, it's you, it's all for you\r\nEverything I do\r\nI tell you all the time\r\nHeaven is a place on earth with you\r\nTell me all the things you want to do\r\nI heard that you like the bad girls honey, is that true?\r\nIt's better than I ever even knew\r\nThey say that the world was built for two\r\nOnly worth living if somebody is loving you\r\nBaby now you do\n\r\nEven though she's in one relationship, she's still doing everything for the old one.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nAccording to an article posted on the website Dazed Digital:\n\r\nAt the same time, she was dealing with the fallout from two broken relationships, so she took Parkerâ\u0080\u0099s template and wrote down what was on her mind.\n\r\nâ\u0080\u009cThe verse was about the way things were with one person, and the chorus was the way that I wished things had really been with another person, who I thought about for a long time,â\u0080\u009d she says, breaking into an acapella of the song. â\u0080\u009câ\u0080\u0098Swinging in the backyard, pull up in your fast car, whistling my nameâ\u0080\u0099. That was what happened, you know? Heâ\u0080\u0099d come home and Iâ\u0080\u0099d see him. But then the chorus, â\u0080\u0098Heaven is a place on earth with you, tell me all the things you wanna doâ\u0080\u0099 wasnâ\u0080\u0099t like that. That was the way that I wished it was â\u0080\u0094 the melody sounds so compelling and heavenly because I wanted it to be that way. The verse is more matter-of-fact because thatâ\u0080\u0099s how it was. Itâ\u0080\u0099s a mix of memories and the way I wished it could have been. Just because things happened a certain way doesnâ\u0080\u0099t mean that thatâ\u0080\u0099s the way that they are. It really is what you choose to think about. Bad things happen every day but youâ\u0080\u0099re not going to be any happier thinking about them. So I donâ\u0080\u0099t think about them. I donâ\u0080\u0099t have that luxury any more. Some people say that â\u0080\u0098Video Gamesâ\u0080\u0099 stops them in their tracks; itâ\u0080\u0099s that kind of song. Itâ\u0080\u0099s just really sad.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nAccording to Lana herself:\r\n\"Itâ\u0080\u0099s just about this guy I had been seeing and the way our relationship was at the time. It was a time in my life when I had let go of my own personal career ambitions and just enjoyed being with him at home when heâ\u0080\u0099d come home from work and play video games. Iâ\u0080\u0099d write while Iâ\u0080\u0099d watch him. I think when I wrote that song I was just reflecting on the sweetness of it, but also the fact that there was something else I was longing for at the same time. Thematically, it feels personal to me. I wouldnâ\u0080\u0099t have thought that that was the song that people responded to. That is why I get so emotional and happy when I sing it. Because it is a gift for someone like me. Melodically and thematically, Video Games is a perfect representation of me.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI'm kind of saddened by all these dark/negative interpretations... I was feeling a melancholic happiness, but not emotional abuse. The song is kind of ruined for me now...\n\r\nI was feeling a melancholy towards a simple happiness. When putting on his favorite dress made her feel like a million dollars, and happiness was in the little things; hanging out together, having fun with friends. When at the end of the day, happiness was simple, and now she has bigger worries.\n\r\nI could relate to it because me and my boyfriend have a lot of financial struggle at the moment, but still happiness seems such a strong and simple thing when we play video games together or have drinks with our wonderful friends and family. That dispite the sorrows we carry, maling ourselves and each other happy together with little things is still possible. We can't buy new clothes but when I put on that dress we both love I still feel like the richest woman on earth.\n\r\nI guess people hear what they can relate to. No doubt I would have heard more sadness in it two years ago when I was still involved with an emotionally abusive guy. It's all about where your own mind is at, too. I just hear \"heaven is a place on earth with you\" above all other insinuations.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI know in an interview Lana Del Rey was quoted saying that singing this song still makes her cry. \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI think its about loving a guy, they seem young and he does not pay much attention to her, he does not understand how much she's trying to get his attention....she wears her best dress and all that and all he see's are his friends and alcohol and games. she's describing life as a game, her relationship with him as a game. lovely song, i find its very similar to \"fade into you\" you Muzzy Star.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI think it's such a sad song. It sounds like she loves him but is trying to convince herself it's mutual. I think it's a \"oh we're so in love\" song but the tone of the tune and certain clues in the lyrics make you realise there is something darker going on.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI feel like this song was was written for a couple who were deeply in love but lost each other. \"They say that the world was built for two. Only worth living if somebody is loving you.\" \"Heaven is place on Earth with you.\" I love this song. It's such a beautifully tragic story, being in love with someone you can't be with, losing the one you love.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI like a lot of what people are saying here. I've been researching opinions and thoughts on her for days now. I find her two tunes \"video games\" and \"born to die\" entirely intoxicating. However I dont find any of their immense sadness or eerieness in the album itself though which is a bit lacklustre.\r\nAnyway I think it goes deeper than people have been saying. Postmodern is a problematic term to ascribe but I think in her case it is absolutely appropriate. \"Video Games\" isn't that she simply watches a man play video games, or that he films her having sex etc Video Games are the symbol or lens with which she view her whole status as a woman and a human being in the 21st century. Everything is playing a part, life is characterised by reproduction of image, cliche and unoriginality, to use Baudrillard's phrase it is a \"loss of the real\", all is surface, all is texture: she moves, lives, loves in a video. Her collage of american film, film music, american country music, combine with a string of cliches that make up her lyrics \"it's all for you\" \"heaven is a place on earth\" \"hold me in your big arms\" to form an overwhelming, suffocating sense of unreality.\n\r\nThe immense sadness in these two songs isn't so much emotional sadness but is a profound weariness. Much art and music has grown tired and film and video has come so close to life that relationships and emotions can feel just as mechanical. \n\r\nShe is a huge Kurt Cobain fan apparently. Play the first 10 seconds of Video Games, then first ten seconds of Nirvana's Plateau. The similarity is striking. Both have a similar vibe. Moreover I think the image of the Plateau is a nice way of understanding her world-view in these two songs:  life is surface, controlled, boundrary-defined, static, stagnant and unchanging.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI think she's simply saying that she sacrifices her best interests to a man in the name of love. She's playing life like a surrealistic adventure game to keep her relationship alive.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\n\"Heaven is a place that you, tell me all the things you want to do.\" Heaven is life with a man that is 100% open about his ambitions, what he wants to do, everything. If he shares everything he wants to do,  then he should be  honest in the relationship. ...\n\n\"I heard that you like the bad girls. Honey, is that true?\" I heard you like to sleep around with promiscuous girls, that will sleep with men even if those men known to be in relationships.\n\nAnd of after he assures her that he's faithful only to her,  she says \"it's better \nthan I even knew.\"\n\n\"They say that the world was built for two\nOnly worth living if somebody is loving you\nBaby now you do.\" Love with a steady companion is the most important thing in life. She's putting a lot of stake in devoting all of her love and precious time to this one man that she's not entirely sure  loves her back.  A lot of this song is about convincing herself the guy loves her, and being unsure if he sincerely returns the sentiment. \n\nIf he isn't truly in love with her, and maybe just attached for reasons he's afraid to confront,  he can ignore her and prolong the issue by playing video games, and she will laugh it off and go along with the relationship. It's a relationship at a critical time in her life that's almost driven by complex of trying to figure out if this guy really likes he back. \n\nThis song has similar themes to \"Dark Paradise\" Being attached to a relationship that's pretty much doomed to heartbreak and being in denial.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthis song isn't as simple as it seems - yes it's about pleasing him which you can tell from the lyrics ''I'm in his favourite dress'' etc.\r\nbut it's more than that.\r\nshe's humiliating herself - she's willing to do anything and everything. ''tell me all the things you want to do''. to put simple - she's doing degrading sexual activity for his pleasure. ''I heard you like the bad girls''.\r\n''they say that the world is built for two, only worth living if somebody is loving you.\r\nbaby now you do.''\r\nessentially she's saying that because of all this stuff she's done he should love her now. \r\n''watching me get undressed'' again shows the fact she's giving herself up.\n\r\nno, the lyrics ''video games'' do not literally mean video games.\r\ntranslated, she's saying that he's making indecent films using her. \r\nto sum up: she's being a stepford wife (from the 70's film 'the stepford wives'. meaning an extremely compliant and submissive wife/partner who is willing to do anything. famous example: bring him beer when he gets home from work, let him play darts etc)\r\nyou can tell this from the lyrics ''open up a beer'' and ''playing pool and wild darts''.\r\nshe's being a stepford wife - giving into him.\r\nthat's why the actual video is very retro and 70's themed. \n\r\nthis song is so much more dark, twisted, evil and deep than it first seems like on the surface.\r\ncompletely in love with it though, beautiful beautiful beautiful voice.\n\n\n", "comment_14": "\nWow, I've had a really different interpretation of this song. Obviously my interpretation does not match up with Lana's explanation or most of the interpretations posted here. But the text is pretty versatile and can be interpreted several ways, so I thought I'd post my take on it (even though it is not the \"correct\" interpretation - more just a commentary on some of the (rather dark) imagery my mind conjures up when I hear this song. Here goes:\n\n\n---- \"CHAPTER ONE\" ----\nSwinging in the backyard\nPull up in your fast car whistling my name\nOpen up a beer\nAnd you say get over here and play a video game\n\nINTERPRETATION:\nChildhood memories. A young girl is playing in the backyard, on a swing set. Someone - in my mind a stepfather - drives up, lures the child inside the house with the promise of entertainment (play a video game) but in fact his intentions are more sinister.\n\nCleverly, this segues into the next segment, where the girl in the fist chapter has grown up, and now has a child of her own:\n\n\n--- \"CHAPTER TWO\"---\nI'm in his favorite sun dress\nWatching me get undressed\ntake that body downtown\nI say you the bestest\nLean in for a big kiss put his favorite perfume on\nGo play your video game\n\nINTERPRETATION:\nA mother has had enjoyed a sunny afternoon with her child (presumably a boy) who is watching as the mother gets ready for work, which is to \"take that body downtown\": She is a prostitute, preparing to meet a particular client. She gives a \"big kiss\" for goodbye, then asks the child to stay here, play your videogames - I'll be home late.\n\n--- CHORUS ---\nIt's you, it's you, it's all for you\nEverything I do\nI tell you all the time\nHeaven is a place on earth with you\n\nINTERPRETATION:\nShe is singing to the child, everything she does is for her child, everything she has to put up with is worth it for the time the two of them has together.\n\n--- CHAPTER  THREE ---\nTell me all the things you want to do\nI heard that you like the bad girls honey, is that true?\nIt's better than I ever even knew\n\nINTERPRETATION:\nShe's talking to a client now.\nAs she is getting busy, her mind drifts to other, happier things; her child and the live they share. The line \"It's better than I ever even knew\", could both be a (dishonest) line delivered to her client, but it could also be an earnest thought sent to her child, who is playing video games back home. In the next two lines her thoughts are more clearly aimed at the child:\n\n---\nThey say that the world was built for two\nOnly worth living if somebody is loving you\nBaby now you do\n\n--- CHAPTER FOUR---:\nSinging in the old bars\nSwinging with the old stars\nLiving for the fame\n\nKissing in the blue dark\nPlaying pool and wild darts\nVideo games\n\nINTERPRETATION:\nShe's out working - or maybe she's just hanging out in a bar, getting drunk. \"Swinging\" is a particularily apt choice of words - it was also used in the first line of the song - but most likely in a different meaning here. She passes the time playing pool. Waiting for the next client is like wild darts, the outcome is unknown and random. \n\nShe is distant and disconnected. To her, this part of her life it's like  playing a video game: she is  controlling a character (herself) doing strange things.\n\nShe meets a client, she is drunk and possibly a drugged.\nThey have \"relations\":\n\n---\nHe holds me in his big arms\nDrunk and I am seeing stars\n---\n\nAgain, her mind wanders to her \"happy place\":\n\n---\nThis is all I think of\nWatching all our friends fall\nIn and out of Old Paul's\nThis is my idea of fun\nPlaying video games\n\n---\nINTERPRETATION:\nShe's thinking of happier times, calling up happy memories,\nThe song then goes into repetitions of the chorus:\nIt's you, it's you, it's all for you (etc.)\n\nAt his point, the song opens up to several possible interpretations of what is going on in the present or future:\nMaybe she's escaping to her happy place as the client is becoming more demanding/active - he's strong, she's \"seeng stars\" - often a result of being beaten/hit in the head. Is he violent?\nMaybe her lifestyle is bringing her into a vicious cycle; she looses custody and start doing more drugs, more booze, becoming less and less critical of what clients she picks up in order to sustain her substance abuse, which is her gateway to her \"happy place\" where she deams of her times with child (interspersed by references to \"bad girls\", presumably herself).\nMaybe she, instead, does strike up a more lasting relationship with one of her clients, bringing one into her family, as her child needs a father. One day in the future, this new stepfather might pull up in his fast car as the child is swinging in the back yard. 'COme here', the stepfather says to the playing child as he opens a can of beer, 'let's go into the hous and play some video games'.\n\nLike I said: Probably not what Lana intended at all.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nSweeping, epic.  Insolent, childish?  Lana Del Rey's music has polarized, but Born To Die is without question the best album of 2012.  \"It's you, it's you, it's all for you\" she pleads, to remind that art is made not for the artist.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI'm glad to be the first one to comment this. I just heard it for the first time and I got the same feeling as when I heard Debussy's Clair de Lune or Aqualung's Brighter than Sunshine for the first time.\r\nIt's not just 'wow this is a good song', it's more than that and it's hard to put into words. She's like a mixture of Dusty Springfield and Duffy.\n\r\nThe song makes me think of the US in the 50s, not because of the music video depicting Elvis and wasted celebrities, but because of the lyrics: the bars and arcades.\n\r\nGreat song. Def gonna have it on my mind for a while. This one's going in the top 20 basket :D\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI agree, I think it's about a girl who is hung up on this guy but he's a not that into her. It's a perfect love song but so dark sonically that it tars the meaning.\n\r\nShe sounds like she's young and impressionable; the song starts with swinging in the backyard which just conjures up the image of youth, childhood, hanging out in your parents garden.\r\nShe sounds like she's totally intoxicated by him,\n\r\n\"He holds me in his big arms\r\nDrunk and I am seeing stars\r\nThis is all I think of\"\n\r\nand\n\r\n\"It's you, it's you, it's all for you\r\nEverything I do\"\n\r\nHe seems older and uninterested re: the whistling her name.\n\r\nShe says \"This is my idea of fun\" which is often used rhetorically in arguements, as in \" Getting wasted/ being irresponsible/ whatever, that's your idea of fun?\". It's like she's trying to convince herself that it is her idea of fun, because it's his idea of fun, when really she's struggling with the relationship.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nUm actually, to a article she EXPLAINS what the song is meant to mean,\n\r\nShe sings to the joy of pleasing her man, with the small details meaning everything (\"I'm in his favorite sundress\"). Just as Del Rey's image recalls an older generation, \"Video Games\" has her framing love in an older, traditional sense, with her man pulling up \"in [your] fast car, whistling my name.\" The slight modern twist is he's drinking beer and playing a video game instead of working on a failing engine, but it's all the same. It's not the sexiest topic (Destiny's Child's \"Cater 2 U\" hit the \"Indepedent\" women with some backlash) but \"Video Games\" refuses to shy away from a timeless truth: There is still pleasure to be had in serving the person you love.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nWhen i first heard this i thought it was a love song till i heard it a few more times then i realized it almost sounds like he is possessive of her that is almost needy and she's bored of it\n\n'm in his favorite sun dress\nWatching me get undressed\nTake that body downtown\n\nI say you the bestest\nLean in for a big kiss\nPut his favorite perfume on\n\nShe constantly needs to tell him-to reassure him that she loves him even though she is not anymore.\n\nIt's you, it's you, it's all for you\nEverything I do\nI tell you all the time\nHeaven is a place on earth with you\nTell me all the things you want to do\nI heard that you like the bad girls\nHoney, is that true?\nIt's better than I ever even knew\nThey say that the world was built for two\nOnly worth living if somebody is loving you\nBaby now you do\n\nThey both do the same thing everyday but it doesn't bother her anymore maybe because she feels this is how good life will be from now on at least she is loved.\n\nSinging in the old bars\nSwinging with the old stars\nLiving for the fame\n\nKissing in the blue dark\nPlaying pool and wild darts\nVideo games\n\nHe holds me in his big arms\nDrunk and I am seeing stars\nThis is all I think of\n\nWatching all our friends fall\nIn and out of Old Paul's\nThis is my idea of fun\nPlaying video games\n\nIn the end she gives up and comes  to terms that life is fine the way it is.enven though she may not be happy nor in love\n\n(Now you do)\n\nIt's you, it's you, it's all for you\nEverything I do\nI tell you all the time\nHeaven is a place on earth with you\nTell me all the things you want to do\nI heard that you like the bad girls\nHoney, is that true?\nIt's better than I ever even knew\nThey say that the world was built for two\nOnly worth living if somebody is loving you\nBaby now you do\n\nNote: when Lana's singing notice how it seems she doesn't mean what she's saying she is almost flippant\n\nI love this song so much>its brilliant and beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nWhenever I hear this song I think of more sinister things. I believe she is singing about getting molested as a child by an older man (perhaps a relative). At the start of the song she is swinging a swing out back behind a house when a man she knows arrives in a car. He immediately cracks open a beer and invites her inside to \"play video games\" which I guess is an excuse to get her inside and watch her undress molest her. She dosent know any better, and as the man keeps telling her this is what life is all about...\n\n\"They say that the world was built for two\nOnly worth living if somebody is loving you\nBaby now you do\"\n\nThat is him saying to her that this is normal, you should be happy. However, the tone of the song clearly demonstrates that she is unhappy and that this is not a good part of her life.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI realize that Lana casually wrote this song about her experience in one of her relationships but I think the song accurately describes a power struggle between any two people in any kind of relationship. Whenever a human being allows themselves to metaphorically place another as a supreme being, this automatically gives this person a feeling of superiority. The \"Hierarchy of needs\" becomes compromised and the interaction between two people become unbalanced. This is where the ideal of equality lessens and the ball starts bouncing on one end of the court. However, experiences and circumstances change overtime and the roles can easily become reversed. In a romantic relationship, peoples priorities and actions towards others become muddled and video games become more important then the real challenge and reward of the love and affection between two people.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nMy father listened to this song a lot, trying to get down the meaning and he came up with an idea which I think fits perfectly. The song is about Lana trying to be the perfect girlfriend for a guy who just isn't worth it and won't treat her right.\n\r\nFirst verse: 'Whistling my name', treats her like a dog or an accessory. \n\r\n'In his favourite sundress'- trying to do everything to please him, repeated with the favourite perfume. \r\n'Watching me get undressed'- a sense of alienation from herself, seeing herself as an object, which is how he sees her. \n\r\n'Open up a beer..play a video game'- he is the archetypal tough guy who essentially ignores her. \n\r\n'I say you the bestest, lean in for a big kiss'- she builds up his ego by giving him an unreal picture of himself. She tries to please by giving herself away. \n\r\nCHORUS- she admits every little thing she does is for him. She tries to live up to his sexual fantasies with the teasing lyric, 'I hear you like the bad girls' and tacks on the endearment 'honey', the tone of the line suggesting she is trying to be turned on by his preferences. She recites cliche and over the top things about their relationship and tries to justify her behaviour by suggesting love is the be all and end all- 'only worth living if somebody is loving you'.\n\r\n'Baby now you do' could suggest she has come to her senses and left, and he loves her now he knows what he has lost. \n\r\nThe second verse shows her trying to fit in with his lifestyle- 'pool and wild darts' being more stereotypical ideas of male activity. The bar is noisy and devoid of the intimacy she seems to crave- 'living for the fame' 'watching all our friends fall'. \n\r\nAgain, her response to him is over the top- there is no real romanticism behind 'holds me in his big arms/drunk and I am seeing stars'- she is acting like an object for him to protect and the lifestyle has run away with her. Even the line 'this is my idea of fun' comes across as her reassuring herself in a defeatist manner.\n\r\nMostly the giveaway here is her tone- the songs sounds like it is in a minor key and all the romantic sentiments are sung in a low register with little change in tone, suggesting her depression and real feelings. The standout change is in 'honey, is that true?' where Lana sings in a higher register, as though pretending to be a Marilyn style femme fatale. \n\r\nNot my idea, but I think this interpretation fits the best of the others I've heard i.e. that it was about child grooming. Lana herself supposedly said it was about an old boyfriend.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nAm I the only one who didn't initially think of this song as being sad and about a bad relationship? I can definitely see everybody's interpretations of it being true, however, I felt like this song was more about being inlove and enjoying all the simple things in a relationship. Being young - getting drunk together - just hanging out with friends doing pointless, ridiculous things that might seem lame to outside people, but are actually really good, funny times where you have to \"be there to understand\" just how funny and fun everything was. Maybe she repeatedly refers to video games because that's the key thing that winds down their day. They sit on the couch and play video games into the night and he includes her into this, aka, he let's her into his world. \n\r\nAnyways, that's why interpretations of songs are fun. There are endless interpretations.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI don't see anything sinister in this song. I see melancholy and lament. Lana herself said this song was about a guy she was with, yet their life together became uninteresting and they eventually broke up. What happens after \"they lived happily ever after?\" That's what this song explores. There was a contentment between the two, but she longed for some kind of passion from him, to become something greater, for example, the line, \"watching all our friends/in and out of Old Paul's\" - everyone else is getting married, yet their is no direction for him. She truly loves him, yet he clearly doesn't feel the same way. Of course this is unrequited love. Love is one of the most special experiences, she invests so much into getting his attention, yet he'd rather just play video games. To him, love is just a video game, you can stop by for a bit, have fun, and stop whenever you want to do something else; there is no real commitment required. It is a juvenile outlook on life. Eventually their relationship just drifts apart and dissolves. It's saddening. There is no emotional investment, no arguments. Even arguing indicates interest. But there was none whatsoever. This song is an unusual breakup song in that there is no guilt, anguish, or anger. It is a reflection of her sorrow. This song is a deep sigh from her.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nLana Del Rey, as quoted, when asked bout 'Video Games': \"A boy. I think we came together because we were both outsiders. It was perfect. But I think with that contentment also comes sadness. There was something heavenly about that life â\u0080\u0094 we'd go to work and he'd play his video games - but also it was maybe too regular. At the time I was becoming disillusioned with being a singer and was very happy to settle with a boyfriend who I loved, but in the end we both lost sight of our dreams. Maybe there's something not-so-special about domestic life.\" (thequietus.com/articles/…)\n\r\nSo the song is both happy and sad, a doomed love story that has good memories nonetheless.\n\r\n(On a side note, this song reminds me of a million ex-boyfriends who would ask me to come over in the evenings after we got home from work or class. I would change out of my day clothes, put on some amazing underwear, try out a new scent, do my hair, pick out an outfit that said casual but sexy, and then drive over to his place only to find him (or him, or him, or him, or the other him, sitting on the couch, playing on PS-whogivesafuck. Men want to play video games for 2-5 hours. Most aren't so brazen to just outright do this, but if I had to guess, this is the ideal situation for like ninety percent of men under the age of thirty-five.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nLana Del Rey, as quoted, when asked bout 'Video Games': \"A boy. I think we came together because we were both outsiders. It was perfect. But I think with that contentment also comes sadness. There was something heavenly about that life â\u0080\u0094 we'd go to work and he'd play his video games - but also it was maybe too regular. At the time I was becoming disillusioned with being a singer and was very happy to settle with a boyfriend who I loved, but in the end we both lost sight of our dreams. Maybe there's something not-so-special about domestic life.\" (thequietus.com/articles/…)\n\r\nSo the song is both happy and sad, a doomed love story that has good memories nonetheless.\n\r\n(On a side note, this song reminds me of a million ex-boyfriends who would ask me to come over in the evenings after we got home from work or class. I would change out of my day clothes, put on some amazing underwear, try out a new scent, do my hair, pick out an outfit that said casual but sexy, and then drive over to his place only to find him (or him, or him, or him, or the other him, sitting on the couch, playing on PS-whogivesafuck. Men want to play video games for 2-5 hours. Most aren't so brazen to just outright do this, but if I had to guess, this is the ideal situation for like ninety percent of men under the age of thirty-five.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nThis song, along with many of LDRs songs, is fraught with double meanings. Its good writing, and it leaves the song open to interpretation and the listener can interpret the song to how it best applies to them. This is a very dark song. I think this songs tells a story about a woman who has been abused as a child and grows up to be promiscuous, participating in \"video games\" aka indecent movies. \n\r\nThe first two verses, she's describing her father. \"Swinging in the backyard\" while her father comes home, opens up a beer, calls her over to him, tells her to play a video game? I think \"video game\" can mean literally or figuratively in this line - or both. I think her father perhaps told her to play a video game to distract her from what he was doing. \"I say you the bestest, lean in for a big kiss\" - also something a child would say - \"bestest\". \n\r\n\"Take that body downtown\" - her father telling her to make him some money. \n\r\n\"Holds me in his big arms, drunk and I am seeing stars\" - this line can either refer to her, drunk, and in her lovers arms, or a memory of her in her fathers arms, her father being drunk, and she seeing stars, \"seeing stars\" usually happening when one is hit in the face. \n\r\nThe rest of the song is addressed to the man she currently loves. \"I heard that you like the bad girls, honey, is that true?\" She is a bad girl, and has been for a long time, as is usually the case with a history as described in the song. \n\r\nWhen interpreting the song in these terms, its very sad. This is a recurring theme in some of her songs, like the song \"Kinda Outta Luck\", in which she describes her father is in the trunk of his brand new car, she wants him back, but \"kinda outta luck\". \n\r\nA previous commenter stated that LDR said \"Video games\" still makes her cry - which would make sense if you interpret the song in these terms.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nWhat's so great about this song is that juxtaposition of the old and the new. The song feels old, vintage, and continues to feel that way, until you hear the word video games. \"What? Video games? Were they even invented back then? Wait - this song was released this year? Seriously?\" It's just so mesmerizing. The images of swinging in a back yard while your man pulls up in his \"fast car\", whistling your name are so old-timey, and then suddenly he's playing video games. It's sort of funny, in a very romantic kind of way.\n\r\nThe way I see it, Lana's not complaining. She's not being snarky when she tells him to \"go play a video game\". She's enjoying it - just being with him, watching video games. I'm pretty sure Lana said something similiar - that this was a time in her life when she wasn't really focusing on her career or personal ambitions, and was just happy and content to be with her man. For him to come home and play video games. She explicity says this in the song, actually - \"this is my idea of fun - playing video games\". That is not sarcasm. \n\r\nShe's just happy to be with her guy, basically. \"It's all for you\" sort of thing. I think it's a sad song because although it's sung in the present tense, I'm not sure it is for Lana. She loves/loved this guy once, and singing it must be pretty sad. And yeah, she did say it still makes her cry. It makes me cry. It's beautiful, and happy, and sad. The \"world is built for two\" line is probably the saddest. \"Only worth living if somebody is loving you\". A lot of people feel they don't, and to hear that is sort of a punch to the gut. \n\r\nIt's a happy song that evokes a lot of sadness. It's about a past that lives on in the present. Honoring love that has been lost.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nI like a lot of what people are saying here. I've been researching opinions and thoughts on her for days now. I find her two tunes \"video games\" and \"born to die\" entirely intoxicating. However I dont find any of their immense sadness or eerieness in the album itself though which is a bit lacklustre.\r\nAnyway I think it goes deeper than people have been saying. Postmodern is a problematic term to ascribe but I think in her case it is absolutely appropriate. \"Video Games\" isn't that she simply watches a man play video games, or that he films her having sex etc Video Games are the symbol or lens with which she view her whole status as a woman and a human being in the 21st century. Everything is playing a part, life is characterised by reproduction of image, cliche and unoriginality, to use Baudrillard's phrase it is a \"loss of the real\", all is surface, all is texture: she moves, lives, loves in a video. Her collage of american film, film music, american country music, combine with a string of cliches that make up her lyrics \"it's all for you\" \"heaven is a place on earth\" \"hold me in your big arms\" to form an overwhelming, suffocating sense of unreality.\n\r\nThe immense sadness in these two songs isn't so much emotional sadness but is a profound weariness. Much art and music has grown tired and film and video has come so close to life that relationships and emotions can feel just as mechanical. \n\r\nShe is a huge Kurt Cobain fan apparently. Play the first 10 seconds of Video Games, then first ten seconds of Nirvana's Plateau. The similarity is striking. Both have a similar vibe. Moreover I think the image of the Plateau is a nice way of understanding her world-view in these two songs:  life is surface, controlled, boundrary-defined, static, stagnant and unchanging.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nYouTube has an NME interview with Lana specifically discussing Video Games. It seems that Lana is describing a boyfriend she was madly in love with \"visually\" who used to sit at home playing video games. Lana is so in infatuated with him that she sits beside him while writing her songs. \n\nLana claims that the musical composition, lyrics, and vocal style all embody her essential characteristics and that Video Games is an intensely personal song for her. She had no idea that it would be the songs fans would fall in love with.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI love how when you hear her in interviews she's this smiley, bubbly girl with a cute little voice and a sweet personality. But her songs are so dark and mysterious, it's so interesting to me, trying to figure her out.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nIt's about immature men who hang with teenagers because they can't relate with adults or the adult world. They live in a fantasy world of games; easy sex; lies; and booze. They like the \"bad girls\" extra young so they can manipulate them with their games. I find it hilarious...such a great song for a man who's really just a boy whose a lonely pathetic creature.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nBeautiful song with beautiful meaning (:\n\r\n'Swinging in the backyard; pull in your fast car; whistling my name' \r\nTranslation: It shows her childish side, the swinging part. He's obviously older and more mature with the fast car. He's probably dragging her in, making her want more. The whistling her name part says something about his tone, the way he wants her to feel loved. \n\r\n'Open up a beer; you say get over here and play a video game'\r\nTranslation: I personally think 'video games' in this is a code word for sex. She might be saying with this that with everything they do, sex follows with it. \n\r\n'I say you're the bestest; swing in for a big kiss put his favorite perfume on; play video games' \r\nTranslation: 'Bestest' shows her childish attitude again. Either that or it just goes with the flow of the song. But she pulls him in with a kiss and his favorite things. She has to keep him with anything she can. Which leads to sex. \n\r\nThe chorus\r\nTranslation: She does anything for him. This is sort of like she's persuading him to stay, that he loves her and she loves him. The 'bad girl honey' part is her trying to get his appreciation and get confirmation that he DOES like bad girls since that's the facade she has on.\n\r\n'Baby now you do'\r\nTranslation: I think with this she's kind of saying 'well you love me now.' Something to hold against him since they're dating/married/etc. She's trying to hold onto him and persuading him with both sex and words. The 'baby now you do' part just shows she's trying to kind of hold it against him, tell him 'you love me. You said it. Deal with it.' \n\r\n'Video Games' \r\nTranslation: I have two possibilities with this one. \n\r\n1) Sex. She's saying how they continually 'play' video games. She might be using it to keep him in and have a reason for him to stay. Video games is used a lot so it might mean that the don't have much of a relationship, they have to have sex to stay together. \n\r\n2) Video games is usually something spouses don't agree with. In the song she might be saying 'go ahead and do what you want'. She seems to not have a tight hold on him so to keep him she has to let him do anything - that could be a translation to video games. \n\r\n~~~~~~~~\n\r\nThis is just my personal opinion(: The song is amazing no matter what the meaning is so it's not a big deal if you disagree.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nthis song isn't as simple as it seems - yes it's about pleasing him which you can tell from the lyrics ''I'm in his favourite dress'' etc.\r\nbut it's more than that.\r\nshe's humiliating herself - she's willing to do anything and everything. ''tell me all the things you want to do''. to put simple - she's doing degrading sexual activity for his pleasure. ''I heard you like the bad girls''.\r\n''they say that the world is built for two, only worth living if somebody is loving you.\r\nbaby now you do.''\r\nessentially she's saying that because of all this stuff she's done he should love her now. \r\n''watching me get undressed'' again shows the fact she's giving herself up.\n\r\nno, the lyrics ''video games'' do not literally mean video games.\r\ntranslated, she's saying that he's making indecent films using her. \r\nto sum up: she's being a stepford wife (from the 70's film 'the stepford wives'. meaning an extremely compliant and submissive wife/partner who is willing to do anything. famous example: bring him beer when he gets home from work, let him play darts etc)\r\nyou can tell this from the lyrics ''open up a beer'' and ''playing pool and wild darts''.\r\nshe's being a stepford wife - giving into him.\r\nthat's why the actual video is very retro and 70's themed. \n\r\nthis song is so much more dark, twisted, evil and deep than it first seems like on the surface.\r\ncompletely in love with it though, beautiful beautiful beautiful voice.\n\n\n", "comment_35": "\nThe first time I listened to this song, I thought it's a sad love song but also very lovely at the same time. It's like the Lana Del Rey is happy but sad too about this love she's singing about. Then after I listened to it for a multiple times plus reading the lyric, I must say that it's more than just 'sad but also happy love song'. Just like some people said above, there's darkness in this song. There are darkness, mystery, and that desperate feeling when we love someone so deeply so we lose ourselves. \t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nIt's about a guy who has never grown up. Chronilogically he's a man, but in all other respects he's a child who wants to play. \t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI guess I was overthinking it, but I saw two different messages in the song.\n\r\nIt seems like she's in an unsatisfying relationship with a guy, where she's giving to it more than he is. He's used to her doing everything he wants for him, like dressing and acting a certain way. They've definitely known each other a while, and they have a lot of mutual friends (\"watching all our friends fall\"). She's getting tired of it, but stays with him, either because she's still attached to him, or she just thinks she doesn't deserve any better. \n\r\nA bit more metaphorically, I saw it as a commentary on trying to make it in show business. She has to sell herself, and demean herself by acting out the gender role of the fragile, dependent female in order to move ahead in a vapid industry in a male chauvinistic society.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI seem to be one of the few that think in this song she is singing about two men. There's the one that she wants to have the relationship with and that the song \"speaks\" directly to, whom spends most of his time playing video games. Then there's the other that she goes out partying with, the guy with the \"big arms\". \n\r\nTo me the verse that says this most clearly is the one below, where she uses both \"you\" and \"his\".\n\r\n\"I say you the bestest\r\nLean in for a big kiss\r\nPut his favorite perfume on\"\n\r\nSo she gives the gamer a big kiss before putting on Mr Big Arms' favourite perfume and heading downtown to party with him, leaving the gamer to his video games. \n\r\nThe way I read it the person she wants the relationship with is the gamer, as she continuously repeats that it's 'all for you\" but he seems unreceptive to her attempts to draw him away from his video games. \n\n\n", "comment_39": "\nâ\u0080\u0098Swinging in the backyard\r\nPull up in your fast car\r\nWhistling my nameâ\u0080\u0099\r\nI think this meens that he is the superior one and almost like her master because of the whistling of her name it almost creates an image of someone whistling for there dog or pet to come running back to them. \n\r\nâ\u0080\u0098Open up a beer\r\nAnd you say get over here\r\nAnd play a video gameâ\u0080\u0099\r\nI think the meaning of this is she has to do things for him , he demands that she gets him a beer instead of him doing it himself. She is almost letting him boss her around. but then when it says go play a video game thereâ\u0080\u0099s two possible reasons one is  its almost like the video game is more important then her or  another is asif she is being played like a video game and he has the remote to control her. \n\n\r\nâ\u0080\u0099I'm in his favorite sun dress\r\nWatching me get undressed\r\nTake that body downtownâ\u0080\u0099\r\nWhen it says she in his favorite sundress its almost like she wants to please him and feels she has to to keep him occupied. She uses her body as show in â\u0080\u0098watching me get undressed , take that body downtownâ\u0080\u0099 to keep him with her as well and wants to do make him love her as much as she loves him in any way she can.\n\r\nâ\u0080\u0098I say you the bestest\r\nLean in for a big kiss\r\nPut his favorite perfume onâ\u0080\u0099\r\nWhen she says she tells him he;s the bestest , its like she is feeding him compliments to try make him love her more and try and praise him to win his heart. â\u0080\u0098Lean in for a big kiss  , put his favroit perfume onâ\u0080\u0099 , just like she said with his favroit sundress she wants to please him and by putting on his favroit perfume she feels asif she can do that. It stands out the way she says his favroit because its almost sujesting it may not be her favroit but she values his opinion over hers and will do anything for him. \n\n\r\nâ\u0080\u0099It's you, it's you, it's all for you\r\nEverything I doâ\u0080\u0099\r\nThis line sujests that she is remiding him that everything she does and everything she sacrifices is all for love of him. The line almost sounds desperate by repeating that itâ\u0080\u0099s all for him over again its almost asif she wants it to sink in so he knows that she truelly feels that way and wants him to aswell. \n\r\nâ\u0080\u0098I tell you all the time\r\nHeaven is a place on earth with you\r\nTell me all the things you want to doâ\u0080\u0099 \r\nBy saying she tells him all the time it brings back the element of trying to convince him she loves him but he is almost making an excuse that she doesnâ\u0080\u0099t to always have her trailing back to say she does. By saying â\u0080\u0098heaven is a place on earth with youâ\u0080\u0099 she is giving him a compliment that almost says he is her god and that when sheâ\u0080\u0099s with him nothing else matters and she feels like she is in heaven. When she says â\u0080\u0098tell me  all the things you want to doâ\u0080\u0099  it suggests that she is desperate to please him and again values what he wants so she can be that for him that what she really wants.\n\n\n\r\nâ\u0080\u0098I heard that you like the bad girls\r\nHoney, is that true?â\u0080\u0099 \r\nBy asking him this she is sneakily trying to find out weither she should be a bad girl to please him and whatever he answers she will be that for him.\n\r\nâ\u0080\u0098They say that the world was built for two\r\nOnly worth living if somebody is loving youâ\u0080\u0099\r\nBy saying this it means that she values what other say a lot and that she believes she will only be happy if she is with someone and that someone is a man who doesnâ\u0080\u0099t value her very much but she is blinded by this need to have someone. \n\r\nâ\u0080\u0098He holds me in his big arms\r\nDrunk and I am seeing stars\r\nThis is all I think ofâ\u0080\u0099\r\nI think this means that because he is showing some sort of embrace towards her she feels almost like this is what she wishes for , but the fact they are both drunk suggests that this isnâ\u0080\u0099t reality and when they wake up sober he wont be embracing her like that. It suggests this when saying â\u0080\u0098this is all I think ofâ\u0080\u0099 because its asif she dreams its what will happen but it never does so she hopes and thinks it will come true which it does but only when he is under influence of alchol. \n\n\r\nOverall I belive the song is about how a women yurnes for this mans attention but he plays her and doesnâ\u0080\u0099t appreciate her love for him and is more interested in other things for example video games then her. She doesnâ\u0080\u0099t see itâ\u0080\u0099s his loss but herâ\u0080\u0099s and tries at every effort to please him and somehow find a way to win his heart , she doesnâ\u0080\u0099t see his uses her for her body and has no love for her becuases she is blinded by the fact she needs someone to love her to live a happy life.\r\nThe song is rather sad really but can come across in many different ways as before I anaylised it I thought it was a happy love song but now I realize the song is almost bittersweet. \n\n\n", "comment_40": "\nI FINALLY saw this artist (and heard her)...just this week. Serious question: what is wrong with her lip? It looks odd. Obviously a talented singer, but her lip drives me nuts.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nThis song and her voice are so beautiful. Interesting to read all the different interpretations but I really dont see \" playing video game\" is about filming amateur porn. I think the \"video games\" is more like a virtual reality.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nTo me this song has nothing to do with actual video games, I think that's more of a metaphor and how she's describing how half arsed he is towards their relationships.\r\nShe's putting his favourite dress on, his favourite perfume and he's so, so about it. only giving her half the attention because really he doesn't care. She's just a body to him.\n\r\nI don't even think she's that young in this song, you don't have to be that young to be this naive towards someone. All girls have been there and done it and i guess if we can relate to this song it's kinda sad. \r\nI agree with the people saying she's pretending to be the bad girl. She's pretending, So she can pretend she doesn't care about his half efforts towards her. And if she's the bad girl who doesn't care, Then she won't get hurt?\r\n\"He holds me in his big arms, Drunk and i am seeing stars\" - She gets totally wasted to hide her sadness and this is the only time he holds her, show's her some affection.\r\nShe's clearly completely in love and obsessed with this person and will literally do anything for them \"it's you, it's you, it's all for you\" - She will literally jump to anything he says. Pretty much like a lapdog.\r\nSuch a sad, sad song. Touches me.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nIts about a person who is stuck in a situation she or he cant stand but cant get out of cause it will disappoint someone else. She cant tell the boyfriend that they have to change and the way they live is embarrassing because she feels it will hurt him. Its an issue of selflessness. You when you tell yourself that \"tomorrow i'm going to do this and you cant because you are afraid\". When someone is playing video games they can get addicted and become stuck in one place. She is sick of being content, she just wishes there would be a little bit of growth or change.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI love this song! At first it seems so simple, but the more you listen, the more nuances you discover. The first time she sings 'I heard that you like the bad girls honey/ is that true?' it sounds like she's flirting with him, drinking beer etc, maybe at the start of the relationship. Then, as the song (and relationship) progresses into the second verse, she starts to become a bit more desperate, doing more and more crazy things like falling out of bars to catch his attention. By the time she sings the third chorus with the aforementioned line, it sounds to me more like an accusation; that he's been fooling around with other girls.\n\r\nbut that's just my opinion xD\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nI'm wondering what she means with \"... fall in and out of Old Paul's...\" - is that a pub I should be aware of?\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nThis song is about her loving him so much that she tries to like playing video games because he likes to play video games. She tries to change herself to like what he likes because she loves him that much.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nThis is not a happy love song.  It appears to me the singer is in a bullied type relationship. The singer has low self esteem and is constantly trying to win the approval of someone who takes advantage of her.  Of course, the irony is that the \"bullier\" gets off on the power of bullying and will continue bullying to gain more power; however, the \"bullied\" is constantly doing more to please the \"bullier\" so that the \"bullier\" will finally appreciate the \"bullied\" and stop the bullying.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nWhen I first heard this song it was in one of the cafes on campus. the chorus part fit my mood like a glove.\nI especially like some of the comments about the song's post-modernism and about it depicting a relationship in which one is the bully and the other is being bullied. And I tend to agree with these comments. However to me, it's just about wanting to pleasure the one that you love.\n\n\nIt's you, it's you\nIt's all for you.\nEverything I do.\nI tell you all the time\nHeaven is a place on Earth with you.\nTell me all the things you want to do\nI heard that you like the bad girls honey is that true?\n\nI didn't do all the things I do for him. However, I tried a lot of things I've never done before to try to impress him. In a weird way, I actually became a better person out of this.\nI tell him all the time... I imply all the time to him that you are the best in my eyes. I don't care for any other people.\nBeing in his presence is the best thing I ever knew. It felt like heaven... since I don't have to worry about a thing. I can't fake anything around him. I'm at my best , at my worst, and he sees it all. About the bad girls, I don't know about that. I guess everyone has preferences.\nIt's better than I ever even knew\nThey say that the world was built for two\nOnly worth living if somebody\nIs loving you\nBaby now you do.\n\nI just want to invite him into a world that I made... I want to make him happy. \n\n\nIn interpreting like this somehow i ignored despair and weariness that is ever present in this song. however thats how i look at it totally subjectively.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nas it's lana's first single , I think the lyrics have two meanings , first one is what some of you said here (relationship with a guy and ...) , and the other one is about music and how she's trying to talk with listeners and grab their attention with \"Watching her get undressed\" and \"Put our favorite perfume on\" and ...\nShe did it and i love her voice\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nI saw an interview where she said, that all she can do, when she listens to the song video games, is crying  madly, since it's an incredibly sad song. \n\r\nI think this song is also about a violent boy friend: \r\n' He holds me in his big arms\r\n>> 'Drunk and I am seeing stars .'<< \n\r\nAnd I think the song means so much more ...  than we ever can imagine.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nthis is totally not my usual kind of song, but i really love this. its a beautiful song, but it's so sad too.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nThis really is a beautiful, stunning song...she has a wonderful voice. And I agree with laurajaneface & spearmintillo about the meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nAmbiguous meaningful music at its best. This smokey sultry song is beautiful on so many levels.\r\nThe lyrics can be suggestively analyzed.  \r\nOn the surface, Del rey maybe singing about genuinely pleasing her man, however through the tone of her singing you would quick to pressume she is almost getting impatient with him playing 'video games', however she still quotes that 'I'm in his favorite sun dress' meaning the video games don't matter to her and that the smallest things such as wearing his favourite dress still mean the world to their relationship or her for that matter. \r\nOn a deeper note, if you listen to the levels and tones of the songs you could quite easily anaylse this song on another level. She seems to change her vocals and tones through different verses. Its almost as though she is readdressing the relationship in her head - the bad and the good. Or maybe she is thinking of how it she would like to be with another man - 'Heaven is a place on earth with you\r\nTell me all the things you want to do\r\nI heard that you like the bad girls\r\nHoney, is that true?'\r\nMaybe she is just putting up with someone who plays'video games' merely because she can't be with the girls whose into bad girls? the repetition of 'now you do' is almost an indication she is trying to prove something to herself - maybe she has no self belief that there is no1 out there that loves her, hence the line : 'only worth living if somebody is loving you'. This song almost seems like she is very doubtful of someones feelings and she feels worthless. Possibly the 'video games' are a sex tapes, and that she is being used by this person and that she does every little thing to impress him so that he does one day love her ... hence the 'baby now you do' once again hoping deeper, however his mannerism ' whistles her name' almost seems like he doesnt care. this is also highlighted in the verse :\r\n'I say you the bestest\r\nLean in for a big kiss\r\nPut his favorite perfume on\n\r\nGo play a video game'\r\n.. shes eager for his approval and some what a similar reaction back however, when she goes to sing ' go play a video game' the tone of her voice suggests its almost as though she knows deep down he doesnt feel the same, so she pushes it off and doesnt say anything because she loves him and is allowing to let it go without any moaning. However she wishes her effort would be recognised deep down, secretly.\n\r\nThis song can be read on so many levels... Provocative.. Innocent..Sly...Guility..We dont know?!\n\n\n", "comment_54": "\nI really like this song. When I saw there was an EP released called \"Video Games\" I wouldn't have touched it with a 50 foot pole because of the \"GRRRRL GAMER\" Epidemic. *inb4 the gender equality lecture, I have no prejudice in regards to gender in the gamer demographic, but until girls stop labelling themselves as \"Girl Gamers\" instead of just \"Gamers\" like the rest of us, that rift will always exist and the stereotypically \"male\" image associated with gaming will be perpetuated by girls more than men. It's something 14 year olds gamers will never understand, unfortunately.\n\r\nBut anyway, I heard the song on the radio this morning and really liked it.\r\nMy basic interpretation of this song... I think it's really neat that she sort of absorbs his lifestyle after a while. \"He holds me in his big arms, drunk and I am seeing stars, this is all I think of... This is my idea of fun, playing video games.\" In her efforts, doing everything she does just for him, she begins to actually enjoy herself. And why shouldn't she?\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI had been hearing the last line of the chorus as \"baby now you're doomed\" which I thought gave it a real sinister twist. Listening to it again I can tell I got it wrong though.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nNow I've read the comments above I understand the song title 'video games' better. I have put Lana's singles in a playlist with AIR's Virgin Suicides album. I think they go well together.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nAfter reading the lyrics on their own, I would agree with most comments about the nature of this song, that she was trying to convince herself that she was loved and that she was fitting in. But then I went back and listened to the song again, and I would have to disagree. Yes the music is haunting, but I don't get the feeling that it is sad in the way many people have suggested. Rather, I feel it is more reminiscent and nostalgic. Sad yet uplifting. Sultry even.\n\r\nI also read an article in Esquire UK magazine in which she was talking about this song. She is quoted directly as saying that \"It's about a time when things were really simple for me... It was just me and a boy, and I would come home and watch him play video games...It was just about being together in the same room.\"\n\n\n\n", "comment_58": "\nCan anyone tell me some more about the part\n\r\n'Watching all our friends fall\r\nIn and out of Old Paul's' ?\n\r\nIs it a saying, or is Old Paul's a specific place?\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nAlthough this song is directly about how a guy preferred material pleasures over her love, I believe this is a critique of the pursuit of happiness, the American Dream. How we can lead shallow, meaningless lives simply by doing things that entertain us, and make us feel happy in the moment; games, beer, bad girls. But isn't the true answer to happiness love? I say this as a thirty-something single male, who likes games, beer and bad girls. I think this song questions our modern values of what it means to be happy, and therefore, how society works and revolves around that pursuit. A very appropriate song for our times.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nThis song is so heavy with a sad irony it kills me!! She is aching to give her love and have it reciprocated. In return she is largely ignored, bullied and abused by this moron. Is it too far fetched to think that 'drunk and I'm seeing stars' is a reference to being battered (seeing stars as in a cartoon)? Possibly!!\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\n\r\nI think this song is about a girl, I guess she sings about herself. In the chours she is siniging about what does she think of this relationship with him and what also isnt true, she talks about her feelings, but in the other parts she talks about real situation- she puts her favorite dress, her favorite perfume, and only thing he does is drinking beer and play his video games. I think the best description is in this verse: \r\n\"He holds me in his big arms\r\nDrunk and I am seeing stars\r\nThis is all I think of\"\r\nThis actually shows the reality- he is drunk again, but in his arms she doesn't want to accept it, she doesn't see the real situation, she sees the stars, and it is all she want to think about. Actually, this is a song about a girl who is in love with a jerk, but does not want to accept it . :)\n\n\n", "comment_62": "\nin my opinion alot of this song relates back to famous women who are icons of sex or danger and their relationship with the paparazzi. The reference to this one man is a symbol for the paparazzi as a hole.\r\nI Cannot be bothered elaborating but if you closely look at the lyrics with this interpretation in mind, it makes plenty of sense.\n\r\nAlso just my opinion\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nThis song beautifully captures what so many women are going through, and what I think must be particularly difficult for American women.\n\r\nThe woman â\u0080\u0094 or girl â\u0080\u0094 in this lovely song is infatuated with â\u0080\u0099himâ\u0080\u0099 and the world around him, a world she feels lucky to be part of â\u0080\u0094 but regrets sheâ\u0080\u0099s not THE other half of. Sheâ\u0080\u0099s sensing that sheâ\u0080\u0099s on the wrong track, trapped in an image that alienate herself from the people around her, when she really needs those big, loving arms. She tries hard to be the woman he wants her to be, which is consequently the same as hiding her true self. \n\r\nWomen want to be loved for who/what they are, but Hollywood has created a puppet-factory with guidelines for every woman to follow. These are the measures, this is how your front, your eyes, your lips, your hips, your nails should look like. Sure this dilemma has always existed, also in the 50â\u0080\u0099ies. The 70â\u0080\u0099ies was an exception. Sadly, the modern world has turned its back on most of the important values from his period. And now weâ\u0080\u0099re kind of back to the Stepford wivesâ\u0080¦\n\r\nI love the fact that she calls this song â\u0080\u0099video gamesâ\u0080\u0099. Being loved is all about being seen â\u0080\u0094 as the person you are. Not the person you are trying to be in order to please somebody. Video is Latin for â\u0080\u0099I seeâ\u0080\u0099 â\u0080\u0094 and this song is all about the games you play in order to be seen.\n\r\nShe sings â\u0080\u0099this is my idea of funâ\u0080\u0099. Yes! She wants to rebel. Against the people who wants to dictate what she can or cannot do. Only thing is, that even when you feel like youâ\u0080\u0099re fighting the dictators, you very often throw yourself into the arms of new ones â\u0080\u0094 if youâ\u0080\u0099re that kind of person. Hollywood is a nasty dictator.\n\r\nThe tone and tempo gives a feeling of numbness. It describes the feeling of lost love so beautifully. She felt like she was born for this love, this man, so when this is over, everything is over. Youâ\u0080\u0099re dead.\n\r\nBrr, I have so much to say about this song. But Iâ\u0080\u0099ll stop here. I wish the best for this incredibly talented singer(song-writer), and I hope that sheâ\u0080\u0099ll pursue this emotional honesty in her future lyrics too. Best of luck to you Lana â\u0080\u0094 and PLEASE do not let this evil industry get you down! Love and thoughts from a Dane\n\n\n", "comment_64": "\nWhere is \"Old Paul's\"????  I've been trying to figure this out forever now!\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nI'm Fairly confident this song is about prostitution. \t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nâ\u0080\u0098Swinging in the backyard\r\nPull up in your fast car\r\nWhistling my nameâ\u0080\u0099\r\nI think this meens that he is the superior one and almost like her master because of the whistling of her name it almost creates an image of someone whistling for there dog or pet to come running back to them. \n\r\nâ\u0080\u0098Open up a beer\r\nAnd you say get over here\r\nAnd play a video gameâ\u0080\u0099\r\nI think the meaning of this is she has to do things for him , he demands that she gets him a beer instead of him doing it himself. She is almost letting him boss her around. but then when it says go play a video game thereâ\u0080\u0099s two possible reasons one is  its almost like the video game is more important then her or  another is asif she is being played like a video game and he has the remote to control her. \n\n\r\nâ\u0080\u0099I'm in his favorite sun dress\r\nWatching me get undressed\r\nTake that body downtownâ\u0080\u0099\r\nWhen it says she in his favorite sundress its almost like she wants to please him and feels she has to to keep him occupied. She uses her body as show in â\u0080\u0098watching me get undressed , take that body downtownâ\u0080\u0099 to keep him with her as well and wants to do make him love her as much as she loves him in any way she can.\n\r\nâ\u0080\u0098I say you the bestest\r\nLean in for a big kiss\r\nPut his favorite perfume onâ\u0080\u0099\r\nWhen she says she tells him he;s the bestest , its like she is feeding him compliments to try make him love her more and try and praise him to win his heart. â\u0080\u0098Lean in for a big kiss  , put his favroit perfume onâ\u0080\u0099 , just like she said with his favroit sundress she wants to please him and by putting on his favroit perfume she feels asif she can do that. It stands out the way she says his favroit because its almost sujesting it may not be her favroit but she values his opinion over hers and will do anything for him. \n\n\r\nâ\u0080\u0099It's you, it's you, it's all for you\r\nEverything I doâ\u0080\u0099\r\nThis line sujests that she is remiding him that everything she does and everything she sacrifices is all for love of him. The line almost sounds desperate by repeating that itâ\u0080\u0099s all for him over again its almost asif she wants it to sink in so he knows that she truelly feels that way and wants him to aswell. \n\r\nâ\u0080\u0098I tell you all the time\r\nHeaven is a place on earth with you\r\nTell me all the things you want to doâ\u0080\u0099 \r\nBy saying she tells him all the time it brings back the element of trying to convince him she loves him but he is almost making an excuse that she doesnâ\u0080\u0099t to always have her trailing back to say she does. By saying â\u0080\u0098heaven is a place on earth with youâ\u0080\u0099 she is giving him a compliment that almost says he is her god and that when sheâ\u0080\u0099s with him nothing else matters and she feels like she is in heaven. When she says â\u0080\u0098tell me  all the things you want to doâ\u0080\u0099  it suggests that she is desperate to please him and again values what he wants so she can be that for him that what she really wants.\n\n\n\r\nâ\u0080\u0098I heard that you like the bad girls\r\nHoney, is that true?â\u0080\u0099 \r\nBy asking him this she is sneakily trying to find out weither she should be a bad girl to please him and whatever he answers she will be that for him.\n\r\nâ\u0080\u0098They say that the world was built for two\r\nOnly worth living if somebody is loving youâ\u0080\u0099\r\nBy saying this it means that she values what other say a lot and that she believes she will only be happy if she is with someone and that someone is a man who doesnâ\u0080\u0099t value her very much but she is blinded by this need to have someone. \n\r\nâ\u0080\u0098He holds me in his big arms\r\nDrunk and I am seeing stars\r\nThis is all I think ofâ\u0080\u0099\r\nI think this means that because he is showing some sort of embrace towards her she feels almost like this is what she wishes for , but the fact they are both drunk suggests that this isnâ\u0080\u0099t reality and when they wake up sober he wont be embracing her like that. It suggests this when saying â\u0080\u0098this is all I think ofâ\u0080\u0099 because its asif she dreams its what will happen but it never does so she hopes and thinks it will come true which it does but only when he is under influence of alchol. \n\n\r\nOverall I belive the song is about how a women yurnes for this mans attention but he plays her and doesnâ\u0080\u0099t appreciate her love for him and is more interested in other things for example video games then her. She doesnâ\u0080\u0099t see itâ\u0080\u0099s his loss but herâ\u0080\u0099s and tries at every effort to please him and somehow find a way to win his heart , she doesnâ\u0080\u0099t see his uses her for her body and has no love for her becuases she is blinded by the fact she needs someone to love her to live a happy life.\r\nThe song is rather sad really but can come across in many different ways as before I anaylised it I thought it was a happy love song but now I realize the song is almost bittersweet. \n\n\n", "comment_67": "\nNow you know what its like to be in love with a gamer. A hardcore gamer.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nNow you know what its like to be in love with a gamer. A hardcore gamer.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nI agree with the general consensus that the song is essentially about an insecure woman who is afraid to be alone and is willing to completely refashion herself for a guy, according to what she thinks he wants. I think the guy cheats on her or flirts with other girls, (\"I heard you like the bad girls/Honey is that true?\") and she gets the idea into her head that those are the kind of girls he likes, so that's whats he has to become.\n\r\nThe second verse, however, is a little bit harder to interpret, but I think it really holds the key to the real meaning of the song. I think it's illustrating how her devotion to this guy has arrested her development. I sort of see her as this small town girl who probably went to high school with him, and they're still doing the same things they've done since they were kids. They and their group of friends were probably the cool, \"In\" clique at school (\"Living for the 'fame'\") and that's their only validation so they're holding on to it for dear life. Everyone is afraid of evolving and maturing. Even the title and repeated lyric \"Playing video games\" brings to mind immaturity and childish pastimes, and their lives ARE a sort of video game; a simulation of real life. This girl can't leave and grow and start a real, fulfilled adult life because she is so focused on making this loser want her, and she's willing to stifle her progression for him.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nLove this song. \r\nWhen I first heard it I didn't think it was a new song, it has a really old feel to it.\r\n(In a good way)\r\nLove the video too.\r\nTo  me, it's about her being completely besotted and everything she does is for him, down to what she wears.\r\nBut he's like, yeah whatever.\r\nYeah.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nI also think that there is something darker going on...something we won't find in the lyrcis. I think Lana Del Rey is telling us a true tragedy and only she knows the true extent and meaning. I do not mean that Lana herself has experienced it, but she knows, in our world are stories, like the one she tolds us in her song. \n\r\nI absolutely agree with laurajaneface.\n\r\nGreetings from Germany...\n\r\nP.S. I love this song...it's special and it's a long time ago I heard a song that touched me like Lana Del Rey's 'Videogames'.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nShe loves him, but his (presumably) young ego won't allow him to see her for what she is and who she is. He's emotionally shut down, and pushes away, but gives just enough so that she stays engaged. She longs to be loved, but doesn't know yet that she doesn't have to wait, or settle for that matter.\n\r\nI lived this song. And I'm absolutely taken with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nYAY. First time commenting. First this song is now in my favorites. Now to the meaning. \n\r\nFor some reason I think that she's a \"good\" who has fallen in love with a bad boy. Its about her loving him more thn he loves her. She knows that he isn't serious and that he doesn't love her, but she likes the way he makes her feel. \n\r\nPull up in your fast car, whistling my name, and watching me get undressed: shows that he is young at heart. It also shows that their relationship is mainly about partying, having fun, and having sex, or to him it is. She wants more from him. She keeps trying to please him 'Put his favorite perfume on'. \n\r\nThe lyrics 'go play a video game' to me is also showing that he is more interested in other things thn her. Its hows how his \"love\" is towards her. It also shows that their relationship isn't serious. Video games are for kids. She's letting him go be a kid, but I think she's telling herself to figuratively \"go play a video game\" Its almost like when you say, \"get outta here?!\" when someone tells you something crazy. She knows their love isn't true, so shes telling herself not to take it seriously, but she's falling in love any way. \n\r\nAfter that line, the songs changes to a more serious tone. Its seems she talking about them as teenagers and thn as adults, their relationship has changed. It seems she is trying to hold their relationship together. He is becoming dissatisfied. She says \"heaven is a place on earth with you\", shes addressing how she feels for him. thn She's saying,\"I heard that you like bad girls, is that true?\" Its almost like she's trying to mold herself into the \"perfect\" girl for him. She's losing herself. Thn she goes back to talking about when they were younger, or when they lst got together. In all relationships, the beginning is the best, its fun, you feel so much. She makes a reference back to the video games.\n\r\n\"Holding me in his bigs arms, drunk and I am seeing stars. .\" he is too drunk to love her. The drunk part can be referring to both of them. She decides to give herself to him, hence her being drunk and seeing start, she's blinded by love. \n\r\nthe lyrics,\" this is my idea of fun\" I think she likes being with him. She doesn't necessarily like partying and drinking, but she thinks it makes him happy, so she does it. \n\r\nNOW the ending. \"they say that the world was built for two, only worth living if somebody is loving you. Baby now you do\" To me its seems she thinks that being in a relationship is the key to happiness even if that relationship isn't good. However, the song sounds sad. Maybe the guy shes with is going through problems and she's trying to help him. Maybe she gets tired of being with him and finally decides to live. \"now you do\" can mean that he realizes he needs her but she's gone. Or they are too old to break up and go back to dating, so now they have to live with each other. Also, I think she's talking to her self. \n\r\n\"now you do\" could also mean that now she realize what she needs. She's now admitting to herself that their relationship was nothing. I think she's ready to move on, she's mature, but he is still young. I just thought that, maybe she's telling herself to live with her decisions. She's saying to herself,\"You wanted to have fun, so now deal with the heart ache!\"\n\r\nLol that's a lot. This song is so amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nthis song is so strong...many have you have interpreted the lyrics so well that i'm only repeating what has been said. she is in love with a guy for whom she is willing to do absolutely anything for. she has lost all self respect for herself and she gives all that she has for him. completely relatable...\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nFor me this is a song about just being in love and simple things that makes you happy. Video games is the â\u0080\u009dviritual realityâ\u0080\u009d life is, the games and roles we play. I don't look at it as sad and I donâ\u0080\u0099t understand what people mean about her loosing her self respect? There is nothing wrong about making the one you love happy. Don't see anywhere in the lyric that he doesn't love her back either. It's about how she feels. Beautiful love song..\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nGuys this song is sooo deep and ironic. Lana del rey is really a wizard with imagery. A gangsta wizard.  She's so genuine and deep. She has an original message to tell. All that shit with the beer and the sundress and the perfume??? GOD so fucking sexy but in a deep way.  \n\r\nJust the BESTEST. Aren't videogames like a metaphor for the American dream?? And her bf sounds so hot!? Like with the big arms and stuff. CRUCIAL detail. Honestly nothing sounds more romantic than like bad girls and darts and shit. Truely true love. \n\r\nthis song is the DEFINITION of TRU LUV.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\ni think it's about playing games with a boy to keep up an image for him, but underneath is the truth which is revealed in the lyrics throughout the song.  i don't know how literal the lyrics are, hardly at least, i bet.  my favorite line is \"drunk and i am seeing stars, hold me in his big arms, this is all i think of\"\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nThis song is about losing your virginity. I'm sure of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nI love this song so much- been playing it on repeat all day.\n\r\nPretty much agree with the comments on here, can relate to the whole infatuation she feels that isnâ\u0080\u0099t really reciprocated. \n\r\nI personally think it is about an older man rather than a boy playing games, and think that he is just not bothered about her rather than actually playing video games- I see them more as a metaphor. He is more bothered in petty interests rather than loving her. \n\r\nShe will do anything to get more attention- wear perfume, his favourite clothes and be the 'bad' girl he desires but he just is not that into her.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nI've thought of a few interpretations.\r\nI thought maybe if it was on the sadder end, he still loves her, but she had to change for him. Not necessarily that he doesn't love her. I feel like perhaps the man in this sense is playing her, because he's controlling and possibly an alcoholic. However, I don't think this is unrequited love. I think he loves her, but just the new her.\n\r\nI think also it could be interpreted as irony. Because it actually sounds like perhaps they are celebrating their love. The snare drum in the back gives it some importance like their love. And perhaps she is crying tears of joy, because it's been so long before she can find someone as great as this person and now she has something worth living for. The majority of the music video is celebration, which is why I find it hard to fully believe it is all negative.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nI think that this song is both happy and sad.\n\r\nIn one way she seems to be reflecting happily on the great memories she had with this man she clearly adored.\n\r\nHowever in my opinion I think it's also quite sad because I don't think this man ever loved her as much as she loved him. As a result she tries to capture his interest in any way she can to make him love her in the same way that she loves him, I say this because she chooses to wear 'his' favourite sundress and perfume, not her own.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nI may be alone in this, and I have no idea if it was intentional on Lana Del Rey's part, but I find the narrator to be at least as much a part of the relationship problems as the man. She strikes me as overbearing and cloying, refusing to allow him any time to himself for fear that he might lose interest. She's making a big show of being submissive to his desires, and that's often a form of control. Ironically, the reason he's losing interest is because he finds her too needy, when he'd rather she just be herself instead of spending her life trying to please him.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nit has a sad term like you have lost somebody and video games are only left.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nShes in a relationship with a game addict.  Its an epidemic in america.\n\r\nShe will give everything to him, as long as they can be together.\n\r\nYes I cried too, she reminds me of my wife.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nThe song...I feel it's a sad portrait of what many women (and men, for that matter) believe love is, as well as what people are willing to do in order to achieve that often impossible ideal that we like to call 'true love'. \n\r\nWhat people are willing to do...that's where all the implications and undertones of this song come in. It can be interpreted in a wide variety of ways really; maybe she's a girl whose willing to put aside deeper meaning in order to allow herself to fall into a simple, picture perfect world where living life is as simple as picking up a video game and going to a world that's vibrant, fantastic, and blatantly unreal; maybe she's a spurned lover trying to convince herself that her true love did and does in fact love her, and that all she's done up until that point has in fact been successful; or maybe the darkest (and in my mind most likely) interpretation is correct and she IS in fact trapped in that ridiculously familiar cycle of abuse and affection, trying to convince herself that this IS what love is, but realizing that in the end, it's all just a game. \n\r\nBut no matter what the interpretation, this song is breathtakingly beautiful. It's haunting rendition of love will cloud my mind...well, likely forever at this point.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nI feel like this song is about a sexy vixen or an american geisha or something.\r\nwho this guy pays to have sex with and spend time with. I feel like her hanging out with him is not completely voluntary...\n\r\nsweet song though. love her voice--so sexy!\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nIt's about unrequited love.\r\nShe calls it video games because she knows he doesn't love her but instead of finding someone that will love her for her she plays along, knowing he only wants her for sex & stuff. It's her idea of fun because she can pretend it's real love, but she knows it's not.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nShe loves him very much and does everything to be with him and be pleasant to him. He's more like a bad guy who just loves her body (also his fast car, beer, video games). She's way more romantic, but trying to act like a bad girl, cause he likes the bad girls.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nLana del Rey is your Soul, or whatever you call it, talking to YOU. She is telling you that even though you are preoccupied with your pastimes and things of the world she loves you unconditionally and completely. If you understand this, now you love her too. \n\r\nNow listen to it again with this in mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nI think this song just might be everything everyone says it is. Sometimes when you write a song, it can take on different meanings and reasons behind different parts. i think maybe while she wrote, after or even before, she thought about EVERYTHING it could mean to anyone and everyone. And I think she just went with that. I think it has many meanings and whatever you think it means, probably does mean that!\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nI think this is what it means. Well to ME, everyone has their own interpretation! I think everyone here has a really good perception of it. But to me this is what it means...\n\r\nSwinging in the backyard\r\nPull up in your fast car\r\nWhistling my name\r\n(trying to enjoy childhood. Letting a guy take her over.)\n\r\nOpen up a beer\r\nAnd you say 'get over here'\r\nAnd play a video game\r\n(He's controlling her.)\n\r\nI'm in his favourite sundress\r\nWatching me get undressed\r\nTake that body downtown\r\n(He just likes her for her body, but she's okay with that. As long as she has him.)\n\r\nI say you the bestest\r\nLean in for a big kiss\r\nPut his favourite perfume on\r\nGo play a video game.\r\n(She does everything for him, absolutely everything to keep him happy. And all he does is play games.)\n\r\nIt's you, it's you\r\nIt's all for you.\r\nEverything I do.\r\nI tell you all the time\r\nHeaven is a place on Earth with you.\r\nTell me all the things you want to do\r\nI heard that you like the bad girls honey is that true?\r\n(She does everything for this guy. Tells him what he wants to hear and lets him do what he wants with her. She wants to be the girl he wants.)\n\r\nIt's better than I ever even knew\r\nThey say that the world was built for two\r\nOnly worth living if somebody\r\nIs loving you\r\nBaby now you do.\r\n(This is what she wants the relationship to be like. It isn't like this, but she wants him to love her. She doesn't think she can live if he doesn't love her.)\n\r\nSinging in the old bars\r\nSwinging with the old stars\r\nLiving for the fame\r\n(That's what she used to do in the old days when she was happy, doing what she wanted for herself.)\n\r\nKissing in the blue dark\r\nPlaying pool and wild darts\r\nVideo games\r\n(This is what she does now with him. Not what she wants, but what makes her happy.)\n\r\nHe holds me in his big arms\r\nDrunk and I am seeing stars\r\nThis is what I think of\r\n(She's love drunk by him. She just wants him, she doesn't care about anything else.)\n\r\nWatching all our friends fall\r\nIn and out of Old Paul's\r\nThis is my idea of fun\r\nPlaying video games\r\n(She's forgotten everything but him. She watches her friends have their own lives and do what they want, but she doesn't care because of him.)\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nI've always thought of this song as how you feel when you first fall in love. She's been waiting for a long time to fall in love and when she finally does she ignores everything negative about the situation or about the person. I always thought that he was young too and didn't really know what he had (her) and it seems like they grew up together. It's like she finally has the feeling of being in love but because she's so young it's not healthy how she loves him.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nSee I saw this as a commentary on how society hardwires women toward pleasing men.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nI haven't listened to this song for too long... so I'm not going to claim that this is a full interpretation... but I get the impression that she's very unsatisfied in a relationship. That she gives 100% and he doesn't even care. Also, that he has cheated, \"I heard that you like the bad girls honey, is that true?\".  I also feel like he would rather play video games than anything... as if it's a slap in the face to all the effort she puts into the relationship.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nlove this! lana is amazing!\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nIt's Lana trying to get her man's attention, but he just ignores herby playing video games and things like that\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nI think this song is about a woman, whoâ\u0080\u0099s desperately in love with a man who will never truly reciprocate her love. I think the title â\u0080\u0098video gamesâ\u0080\u0099 alludes to the fact that itâ\u0080\u0099s all a game to him, she sings â\u0080\u0098go play your video gamesâ\u0080\u0099 this to me feels as if sheâ\u0080\u0099s saying, yeah go and pretend. Thereâ\u0080\u0099s also a youthful element to this song, â\u0080\u0098pull up in your fast carâ\u0080\u0099 like most of Lanas songs, it seems that sheâ\u0080\u0099s singing about an older man, but in my opinion (and i could be wrong) it feels like the love that she feels for him makes her young like a child, the fact that sheâ\u0080\u0099s in love turns her almost childlike, something new and exciting., dangerous and wrong that shes experiencing and the fact that the man shes singing about is portrayed as an older contributes to the fact heâ\u0080\u0099s been here before, heâ\u0080\u0099s done all this with women, he knows the deal, and she knows this but still is clearly infatuated. â\u0080\u0098I heard that you like the bad girlsâ\u0080\u0099 he has a reputation, bad girls are often the ones that donâ\u0080\u0099t care if your attached to someone, itâ\u0080\u0099s always just fun, But clearly she does care, hence the chorus â\u0080\u0098its you its you its all for youâ\u0080\u0099 But this is juxtaposed with the fact shes telling him to play videogames, again saying i know its not real, but yeah go and pretend. To me is very melancholy and sad, its a love song about the youthful feeling love gives to you, the excitement and wild carefree memories created with the disadvantage of age and being wise enough to know its not real, it can never be, But still, like when we are in love, we will stay and try and persuade someone else whoâ\u0080\u0099s emotions are never truly invested that we love them, in hopes one day they will love us to.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nI believe this song is about being desperately in love with a bad boy and having him be good just for you.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nI agree with those who say it's nostalgic. I think the video games and street scenes with skateboards are about being replaced by hobbies. Being ignored temporarily increases the obsessiveness of a young girl in love. It's a reflection on a failed relationship.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nThis song reaches into your soul.\r\nIt, speaks to the hope that existed and a yearning to reach that place again .\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nI first heard this song in a television performance a couple of years ago, and I couldn't get it out of my mind.  I love that it is so enigmatic and subject to so very many interpretations. \n\nHere is my take on it: \n\nShe is a sweet and innocent young thing, very pretty but weak, impressionable and extremely needy.\n\nI see her as being maybe in her late teens (young enough to be \"swinging in the backyard\") and the guy is perhaps in his early to mid-20s (old enough to \"pull up in your fast car\").  Not a big age difference, but significant enough at that time of one's life. \n\nShe is totally infatuated with him, besotted and lovesick.  She will do ANYTHING to please him:  wear his favorite dress, wear his favorite perfume, take her clothes off for him. \n\nHe is completely emotionally uninvolved, however.  He lightheartedly \"whistles her name,\" but in the way that someone would summon a dog.  It's like another way of \"snapping his fingers\" at her to make her compliant. \n\nHe wants to \"take that body downtown\" to show off to his friends because while he is EVERYTHING to her, she is nothing more than a pretty face, a plaything for him, a bauble. \n\nShe is obsessed with him.  When they \"kiss in the blue dark,\" or he \"holds her in his big arms,\" she is \"drunk [with love] and seeing stars.\"  But he is just as content to hang out in bars, and play pool and darts....and video games.  When they do this together she says \"this is my idea of fun,\"  but either 1) she is being sarcastic, or 2) she's willing to try to convince herself she's having fun whenever she's with him, even though she would rather be alone with him than spend time together with his friends. \n\nShe is, basically, a good girl, but willing to be a \"bad girl\" to please him.  She is being extremely flirtatious [not to mention untrue to herself] when she implies that she will be \"bad\" if that's what pleases him.  Likewise when she tells him he's the \"bestest.\" \n\nThey way she croons \"it's you, it's you, it's all for you,\" I can't help but think of someone who would go as far as suicide if the object of her obsession were to leave her. \n\nLike many of the comments here will agree, this is a very dark, very melancholy song; and the tone of voice in which it's sung is perfectly fitting.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nThe first time I heard this song I thought it was kinda like an ode to modern men. Most young men these days are gamers and despite the negativity and antagonism towards gaming, girls still love them, and they have girlfriends and wives and children. I thought it was a kind of  an acknowledgement of video games being the new masculine hobby and bonding activity and how women will love men no matter what their priorities are. Even when he doesn't put her first she still adores him.\n\nHowever, now that I've read the comments I think I suck at interpreting songs and I'm sad now. :-(\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nI think this song is about how Lana is in a relationship with a man who doesn't pay much attention to her and if he does it's for an abusive and sexual favor.\n\"He holds me in his big arms drunk and i am seeing stars\"\nThis is about how Lana goes out and gets drunk to forget about her terrible relationship and her partner having to carry her out bars after hanging out with \n\n\"It's you, it's you, it's all for you\nEverything I do\nI tell you all the time\nHeaven is a place on earth with you\nTell me all the things you want to do\nI heard that you like the bad girls honey, is that true?\nIt's better than I ever even knew\nThey say that the world was built for two\nOnly worth living if somebody is loving you\nBaby now you do (Now you do)\"\n\nThis part is about how she'll do anything to keep her relationship saying things that he wants to hear and how she'll do bad things for him and complete sexual favors.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nI very recently stumbled upon Lana Del Rey. Shortly after that I discovered she's a recovering alcoholic who said herself that when she's talking about a love in her life she's probably referring to her \"first love; alcohol.\" As an alcoholic struggling to get sober her music gives me peace. This song, for me, is yet another interpretation of her struggled love affair with alcohol.\n\r\nThe first verse feels like an association to when she was first introduced to alcohol. Maybe it was a boy that would 'pull up in a fast car whistling (her) name' but I also see it as that exhilarating feeling  of alcohol as the drunkenness creeps in, calling for her to have a drink. 'Video games' is a reference to a life that's not real. Because life as an alcoholic is a life not really lived or experienced, no matter how much we convince ourselves its reality. \n\r\nThe next couple of lines remind me of sex when you're drunk. Its fun. Its sexy. Still not real. The 'Favorite perfume' will always be the smell of alcohol on someone's breath.\n\r\nThe chorus is most important. Its her love song to alcohol. \r\n\"It's you, it's you, it's all for you\r\n Everything I do\r\n I tell you all the time\r\n Heaven is a place on earth with you\" \r\nIf you're an alcoholic, this makes perfect sense. There is nothing that feels better than being drunk. Its a sweet release.\r\n\"Tell me all the things you want to do\"\r\n When you're drunk you have high aspirations, most of which will never play out as long as you're not recovering. \r\n\"I heard that you like the bad girls honey, is that true?\"\r\nBad girls are drunk girls. Alcoholic women live to test boundaries. They live to be sluts. They love to be vulgar. They love attention. They being me!\r\nThe last stanza is about giving yourself completely over to alcohol. \r\n \"It's better than I ever even knew\r\n They say that the world was built for two\r\n Only worth living if somebody is loving you\r\n Baby now you do (Now you do)\"\r\nNothing feels better than alcohol. And it can easily take the place of real human interaction. The alcoholic doesn't need anything but the bottle and their imagination. No need to worry if someone else will love you if you know alcohol will.\n\r\nThe second verse plays out a typical drunk night. They're all the same. 'Playing pool and wild darts'. 'Seeing stars' is all she thinks of now. Watching friends do the same drunken thin every night is her 'idea of fun'\n\r\nAnd then back to the chorus. \n\n\n", "comment_105": "\nTo me, the foundation for this song is pretty obvious given Lana's predilection for traditional gender & relationship roles, as well as 1950s & 1960s Americana.  She even styled herself a new-age Nancy Sinatra, and doesn't accept feminism.  In short, she's old-fashioned, supportive, and generally a more submissive female when it comes to her interactions with men she respects.\n\nSo, in a nutshell...She's in love, everything she does is for him, she styles her clothing to his liking, and is waiting patiently for him to return that attention...she longs for it.  She'd be content just sitting in the same room with him, focused on his needs while he has his attention on other things.  She's smitten.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nThis is probably so so wrong but this is just how I took it.\n\nSwinging in the backyard\nPull up in your fast car whistling my name\n\nOpen up a beer\nAnd you say get over here and play a video game\n\nI'm in his favorite sun dress\nWatching me get undressed take that body downtown\n\n-I think this is about a sinister adult who manipulates a young girl into doing things she wasn't ready for, and recording it-\n\nI say you the bestest\nLean in for a big kiss put his favorite perfume on\n\nGo play your video game\n\nIt's you, it's you, it's all for you\nEverything I do\nI tell you all the time\nHeaven is a place on earth with you\nTell me all the things you want to do\nI heard that you like the bad girls honey, is that true?\nIt's better than I ever even knew\nThey say that the world was built for two\nOnly worth living if somebody is loving you\nBaby now you do\n\n-I think that over time she learned to keep playing the role. She learned to act like the bad little girl that he wanted and act like everything she did was to please him-\n\nSinging in the old bars\nSwinging with the old stars\nLiving for the fame\n\nKissing in the blue dark\nPlaying pool and wild darts\nVideo games\n\n-I think this flash forwards to the future where everything she does is still just to please the same archetypal sinister male figure that manipulated her as a child-\n\nHe holds me in his big arms\nDrunk and I am seeing stars\nThis is all I think of\n\n-She might be with a nice guy, and she might be drunk, but all she can think about is the video games that she used to play-\n\nWatching all our friends fall\nIn and out of Old Paul's\nThis is my idea of fun\nPlaying video games\n\n-Again, it's all she knows-\n\nIt's you, it's you, it's all for you\nEverything I do\nI tell you all the time\nHeaven is a place on earth with you\nTell me all the things you want to do\nI heard that you like the bad girls honey, is that true?\nIt's better than I ever even knew\nThey say that the world was built for two\nOnly worth living if somebody is loving you\nBaby now you do (Now you do)\n\nIt's you, it's you, it's all for you\nEverything I do\nI tell you all the time\nHeaven is a place on earth with you\nTell me all the things you want to do\nI heard that you like the bad girls honey, is that true?\nIt's better than I ever even knew\nThey say that the world was built for two\nOnly worth living if somebody is loving you\nBaby now you do (Now you do)\n\nNow you do (Now you do)\n\n-Same old...maybe I am wrong. That's how it hit for me.-\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nI love Lana so much. Her music is the only home for me, the only thing that raises me up from the dead and inspires me.\n\nHer music has helped and still will always help and has gotten me through so much. I would listen to her music and cry, scream, laugh, get high, and just pray. Just pray that things will be okay and the end and her music helped me through all of that. \n\nI love you Lana so much.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nI think this is about having how you can have expectations about how a relationship should be, and then when you get in a relationship you realize heâ\u0080\u0099s not what you thought he would be. You wonder if youâ\u0080\u0099re too idealistic about love and tell yourself â\u0080\u009citâ\u0080\u0099s better than I even knewâ\u0080\u009d because you love him. But heâ\u0080\u0099s not as invested in the relationship as you, not trying as hard, or just has different interests and ways of showing love, and it feels like youâ\u0080\u0099re doing all the work trying to make it your dream relationship. Video games could mean heâ\u0080\u0099s playing mind games with her or is literally addicted to video games and ignores her. Either way she feels like the relationship is unbalanced where sheâ\u0080\u0099s putting in more effort. \t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nFor me, it's about a couple who likes playing videogames together as stated:\n\n\"Open up a beer\nAnd you say get over here and play a video game\"\n\nwhere the boyfriend calls the girlfriend for them to play videogame\n\n\"I'm in his favorite sun dress\nWatching me get undressed take that body downtown\nI say you the bestest\nLean in for a big kiss put his favorite perfume on\"\n\nshows how the girlfriend likes making things the boyfriend likes and she's happy with it, then \n\n\"Go play your video game\"\n\nis like when a couple has someone who likes videogames a lot(the boyfriend in this case) and the girlfriend lets the boyfriend have some time for his own videogames after they had love:\n\n\"I'm in his favorite sun dress\nWatching me get undressed take that body downtown\"\n\n\"It's you, it's you, it's all for you\nEverything I do\nI tell you all the time\nHeaven is a place on earth where you\nTell me all the things you want to do\nI heard that you like the bad girls honey, is that true?\nIt's better than I ever even knew\nThey say that the world was built for two\nOnly worth living if somebody is loving you\nBaby now you do\"\n\nand here you can see she really loves him and she knows he loves her and states at the end \"baby now you do love me, so it's worth living\"\n\n\n\nFor me, this song is about a couple who likes videogames and loves each other a lot. At the same time, they give each other space, but as it's the girlfriend point of view, it's more focused on her in relation to him.\n\nI know the official meaning, but for me, it's this meaning that makes the most sense personally.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\n@anicechianti ... I absolutely agree about the \"father\" angle.  Of course she isn't going to come out and say \"it's about my dad molesting me.\"  But the opening line \"swinging in the backyard\" is so evocative of childhood, it's almost like \"what else could she be talking about!?\"  If not her dad, then maybe an older boy that molested her while she was still pubescent.  \n\r\nShe wrote a song earlier in her career called PUT ME IN A MOVIE that talks about, again, making a movie \"video game\" with a man she meets.  \"If he likes me and takes me home, Lights, Camera, Action!\" and it goes on to say \"You know you like little girls, you can be my daddy.\"\n\r\nSomething VERY dark has happened to this girl!\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nIt could just be a straight-up song about an actual relationship. But here's my take:\n\r\nVideo games are fine, in moderation. But compulsive gamers use video games as a substitute for real life. They become content to control the images they see on the screen. \n\r\nSame thing happens with sexuality. Getting too caught up in popular sexual ideals can lead to objectification. Usually this means hotness becomes the ultimate goal. People will watch crappy movies, so long as the actors are hot. People will listen to crappy music, so long as the singer is hot. Del Reyâ\u0080\u0099s critics have slammed her for pandering to this type of consumer.\n\r\nThese lyrics seem too self-aware for Del Rey to actually be the pathetic woman in this song. And as an artist, she hasnâ\u0080\u0099t toned down her sexy image, at all. So â\u0080\u009citâ\u0080\u0099s all for youâ\u0080\u009d seems to be a sarcastic acknowledgement of her critics. She implies that the problem is with the consumer who chooses to ignore her music & focus on her sexuality, including those who demand that she tone down the sex.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nFor me this song is about a girl who has fallen in love with a guy who will never be hers but she does everything she can to be his. Even be attractive enough to keep his interests, especially when she knows that he likes bad girls. She sacrifices herself for him which can be seen in the way she is willing to do anything. He doesnt love her enough, he plays video games and is only half interested but in her head its so perfect and she will do anything to have that love worth having, even pretending she loves video games. I also get the impression she has fallen for someone who is older and gives her a whole new daring kind of life with beer and going to bars. Such a sad song. She will never quite feel good enough. Also seems reminscent of summer. \t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nThis song is about a very important feminist perspective commonly called \"Male Privilege.\" A male assumption that it is all about us. All of us men should be embarrassed by this song and do as much as we can to reverse the idea that males mistakenly should be in control and that females are forced to support that. Good on you Lana. Speak louder for a fairer and better world. Women should rule!\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\ni'll only comment on the first verse:\n\r\nafter reading the lyrics, i think \"video games\" in the first verse is about oral sex.\n\r\nOpen up a beer\r\nAnd you take it over here\r\nAnd play a video game\r\n[ in sleazy old man voice, \"wanna play with my joystick?\" ]\n\r\nI'm in his favorite sundress\r\nWatching me get undressed\r\nTake that body downtown\r\n[ get on your knees ]\n\r\nI say you the bestest\r\nLean in for a big kiss\r\nPut his favorite perfume on\r\n[ talk dirty ]\n\r\nGo play a video game\r\n[ joystick ]\n\n\n", "comment_115": "\nGuys this song is sooo deep and ironic. Lana del rey is really a wizard with imagery. A gangsta wizard.  She's so genuine and deep. She has an original message to tell. All that shit with the beer and the sundress and the perfume??? GOD so fucking sexy but in a deep way.  \n\r\nJust the BESTEST. Aren't videogames like a metaphor for the American dream?? And her bf sounds so hot!? Like with the big arms and stuff. CRUCIAL detail. Honestly nothing sounds more romantic than like bad girls and darts and shit. Truely true love. \n\r\nthis song is the DEFINITION of TRU LUV.\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nI am suprised no one has thought of this\n\r\nPlaying videos games  =  watching porn (playing with himself not her)\n\r\nThe bad girls = porn stars (if not what is another meaning of the bad girls?)\n\r\nHeaven is a place on earth where you tell me all the things you wanna do = I will do what you watch those bad girls do because I love you and it will be like heaven then because you are only interested in me and me in you\n\r\ngo play a video game = go cheat on me by watching porn I am over this unrequited love\n\r\nsad and very common ..... porn corrupts\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nI think it is about a woman who loves a young man who is in his teen years. He has the young mind which normally works around Video Games. (Like how young teen boys are obsessed with their video games) He plays with her like she is a Video Game herself. He has control over her, but she does not care because it means she has won he heart. She feels that she would not be complete if she does not have his love, so she continues letting him control her and play with her like a Video Game.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nI can't be the only person who hears \"heaven is a place WHERE you tell me all the things you want to do,\" right??? \r\nI, like everyone else, sees the song as being about someone who is far more invested in someone else than they are in them. The whole song is pretty sad. The guy being casually interested in her, or interested in her body (that he takes downtown), while meticulously puts on his favorite dress, his favorite perfume. It's sad for both parties. \t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nShe is in love with an older guy.  She is young and willing to do whatever she has to do to earn his \"love\".  He gets her to \"play video games\".\n\r\n\"Play video games\" = \"make pornographic films\"\n\r\nShe will wear his favorite dress, put his favorite perfume on while he cracks a beer and turns the video camera on.\n\r\nShe will be his bad girl if thats what he likes... she is willing to do whatever it takes to please him.  She thinks his approval is true love.  When shes in his arms shes drunk with love, when they are apart he is all she thinks of.  She feels that heaven is a place for two and when they are together she feels it, and wants him to feel it too.\n\r\nShe has confused sex for love with an older guy who understands the difference.  She has been taken advantage of, all the while thinking she is doing all the right things to get him to love her.\n\n\r\nSinging this song would make me cry too if this is not just my interpretation but the truth...\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nShittiest lyrics I've ever heard. There is no deep meaning. Stop interpreting.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nI think this song is about a girl losing her virginity for the first time and then just enjoying the sexual act between her and her boyfriend. \r\n\"Go play a video game\" seems to me like a request, it's her first time, yeah basically the 'video game' is in fact, the intercourse between them. \n\r\nWhen the second verse starts she's lost her virginity and seen that sex is beautiful. They keep 'playing video games'.\r\nThat's what I think, lol :)\t\t\t\t\n\t\t\t\t\n\n"}