{"comment_0": "\nHigh everyone!  I think the song is about herself.  It's about searching for the perfect person to fulfill your life only to discover that that person is you.  It is about being true to yourself, to your dreams, to you.  It's about finding out that the \"perfect person\" might not be what you envisioned.  Believe in yourself...be somebody!  That's my take... I relate to the song that way.\n\r\nFinding yourself is the \"Sweet Destiny\".\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\ncould someone explain this song? i can't see the relation between the chorus and the verses\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nIn the verses she is talking about the past and how hard it was, and how she seeked a perfect love and needed security, the chorus's are in the present saying that this \"someone\" had brought her love and it was all she dreamed, and wanted! I hope that kinda helped! I may have just spraffed crap! I hope u get what i said!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI Believe this is about God's love and how, after years of praying, her prayers have been answered in a \"Vision of Love.\"  She is grateful for what God has given her, and I think she is specifically talking about the opportunity and talent to launch her music career - but it could be anything.  This was the song that got Mariah noticed first, back in the days when she was still humble, about 1992 or so?\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nWell, I've always thought of it like a girl's wishing of meeting a dreamlike lover...and suddenly her dream becomes reality and destiny brings her a vivid example of everything she had been dreaming of, or even more than that. \r\nIt's a beautiful song to hear when you've haven't experienced anything...when it still feels look unspoiled and pure.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nCarey obviously depicts having a \"vision of love.\" She is grateful to God (not a lover, as some may assume) for guiding her in life. Carey describes how she had to work to get where she is now, but with the help of the vision that she received from God. It is an autobiographical piece, penned by Carey herself, that includes the personal struggles she had endured through time as she worked to fulfill her dream/\"vision.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nGreat song!!!! Powerful song. Her first release!!! wow.. how I wish I had've been a teenager when this was released!!! I was around 8, lol. Would have been so exciting when mariah first came onto the music scene!!!! There's no one like her!!! Her voice is out of this world. She is beyond talented!!! She sounds so free in this song, I love it. She is just so blessed and gifted.\r\nI lovvvve her big curly hair back then!!! wow. She was gorgeous!!! More naturally pretty.\r\nYeah, she was so humble back then.\r\nAnyway... i'll always love her!!!! This is an awesome classic!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nShe found someone she likes but finally realizes that she projected on this person what he wasn't - her true love. You know the drill; you meet someone, sparks fly, you fall in love, then after a series of let downs, realize that this person isn't \"The One\".\r\nI like Mariah skinny now. I hoped her boy toy doesn't spend all of her money.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nNo this song isnt about a loved one or finding love... its about her Music and how she survived by it. If you really listen to the lyrics you'll will understand it better... read below\n\r\nTreated me kind\r\nSweet destiny: Her music is her destiny\r\nCarried me through desperation: Music helped her through the hard times (I can totally relate)\r\nTo the one that was waiting for me\r\nIt took so long \r\nbut still i believed\r\nsomehow the one that i needed\r\nwould find me eventually: To the person she wanted to be\r\nI had a Vision of Love: The Vision of Love is her touching an audience with her voice... if you watch her live from 2006 onwards you will see how she waves her hand out from the left of the audience to the right\n\r\nPrayed through the nights\r\nFelt so alone\r\nSuffered from alienation\r\nCarried the weight on my own\r\nHad to be strong\r\nSo i believed\r\nAnd now i know ive succeeded\r\nIn finding a place i conceived : The place she conceived is the music in her where she can turn too any time and it will make her feel better\n\r\nI realised a dream\r\nAnd i visualized the love that came to be: Her dream was to become an artist and she fell in love with it\n\r\nCause you treated me kind\r\nSweet destiny: Her music treated her kind and it is her destiny\n\r\nDoes this song make sense now... this is my perspective of the song and the reason its my favorite song of all time... cause i can totally relate...\n\r\nplease reply\n\n\n\n\n", "comment_9": "\nOne of the more optimistic songs with a bluesy refrain.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI see why it could a bit confusing in finding the meaning of this song for a lover and the love of God; although, please keep in mind that this is a soul genre song. \n\r\nI personally think it's about her and the struggles she's been through to get to where she was at that moment. She believed, had strong faith, and it got her what she always wanted. Her vision of love was for a dream to come true and this song symbolizes the moment it occurred. \t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis is a gospel song. \"You\", the one she prays to, is God, of course.\n\nAt first it's insinuated that she asked God to give her a husband who would give her everything she needed. But God gave her a vision of love.\n\nAnd even though she sings that her prayers were answered, she still keeps on saying that the vision of love was _all_ that God gave her.\n\nSo did she or didn't get the loving husband from God?\n\nThe final verse gives the answer: \"I had a vision of love and it was all that _you_ (God) turned out to be\"!\n\nThe vision of love was God Himself! This is deeply a gospel song about God being in the first place in every woman's life.\t\t\t\t\n\t\t\t\t\n\n"}