{"comment_0": "\nIt's about getting the short end of the stick in a relationship. Wanting someone more than they want you, finally realizing this is the source of the problem to begin with. The person feels let down because they were the one who was more emotionally invested in the relationship:\n\n\"I kept waitin on a reason, in a call that never came\" --Wasting time waiting for someone to change, to suddenly put as much effort into it as you are, only realizing after time that it's not going to happen, because you want this to work more than they do.\n\n\"In the end it seemed, there was no room for me, still I tried to change your mind\" --Subconciously, the person knows that holding on is a lost cause, but at the same time is bound to them by the flickering hope that there is still something left in the relaitonship.\n\nIn the end, you see the person finally realizing and adressing the problem to the relationship (\"I guess I wanted you more\"), now understanding that it is unfair to themselves to remain in a relationship that is not fully benefitting them.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song relates to me so much it's scary.\nI believe this song is about a guy that just stops talking to the girl, randomly. (\"I kept waitin' on a reason -that he just stopped talking to her-, a call that never came\") She doesn't know why and she had her hopes up so high that this guy was perfect for her and they were going to be together forever, but it turns out that she had just wanted him more. She says she \"should have seen the signs\" and that she was \"just too blind\" and he apparently didn't have room in his heart for her.\n\nThis song seems like it's pretty much written for me. I went through something like this and I was that girl. It's sad and it hurts that someone could just wake up one morning and never talk to you again.. and you have no reason why they did that.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nA \"real\" relationship doesn't work out. They are pondering the reasons and decide it is because according to each and their p.o.v they worked harder then the other-they wanted the other more then the other did them...??But then they don't need the other anymore.\nI guess I wanted You more?\t\t\t\t\n\t\t\t\t\n\n"}