{"comment_0": "\nIt's the 2014 League of Legends World Championships theme.\n\nSpecifically, it's the anthem for the struggle of players getting to pro and getting to LCS/Worlds\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI think this song is someone who is different from the rest realizing that they have what it takes to become powerful.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nWhen I hear this song, I'm thinking of a man who is training his apprentice. But he knows that soon he will have to leave his pupil (most likely dying), and as his final piece of advice, he's telling him of the legacy that he and his people has left, and that eventually the youth will take up that torch, and that he's ready for it.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis song reminds me of America (my favorite song from Night Visions). I think it's about a revolution (perhaps the American Revolution), and the song is one revolutionary talking to another like a mentor:\n\n\"As a child you would wait\nAnd watch from far away.\nBut you always knew that you'd be the one\nThat work while they all play.\"\n\nThat last line for me means that the people seemed to ignore what was going on, and just went with it. The revolutionaries would have to change things (That work while they all play) It could also be an allusion to the fact that the British exploited the Americans to pay off their war debt.\n\n\"In youth you'd lay\nAwake at night and scheme\nOf all the things that you would change,\nBut it was just a dream!\"\n\nPretty straightforward. The revolutionaries wished for change individually but, without assembling, it seemed as a dream. The dream could also be their goal.\n\n\"Here we are, don't turn away now,\nWe are the warriors that built this town.\nHere we are, don't turn away now,\nWe are the warriors that built this town\nFrom dust.\"\n\nAwesome chorus. It just says to keep hope and faith in what you do. (If we continue in the American revolution subject, the town could be a metaphor for the US)\n\n\"The time will come\nWhen you'll have to rise\nAbove the best and prove yourself,\nYour spirit never dies!\"\n\nFarewell, I've gone to take my throne above,\nBut don't weep for me\n'Cause this will be\nThe labor of my love\"\n\nThe mentor has died, perhaps from fighting the revolution. He prays that the other revolutionary will take his place, continue the fight and be courageous.\t\t\t\t\n\t\t\t\t\n\n"}