{"comment_0": "\nI personally like to think that this song was written about my family! lol (my last name is Champion)\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nTo me, this song is really about overcoming.  This became especially apparent while working through a somewhat deep depression a while back.  Before, especially as a kid, all I ever saw it as was a victory song to be played after a sporting event or something of that sort.  It had no meaning to me beyond that.  Because of that, I always kind of overlooked it because of how overplayed it seemed to be.  In the thick of it, while I was on the verge of tears, it came on the radio and I actually started really LISTENING to the lyrics.\n\r\nThat's when the overcoming theme hit me.  Maybe it's kind of obvious to a lot of you, but for me it took a while.  Now, when I hear him say \"We are the champions,\" I'm not envisioning a guy scoring a last minute goal.  The \"we\" Freddy Mercury is singing about is actually you and me.  If you've ever had a time where you felt like laying down, giving up, dying, but you're still here.  You're not giving up.  You're going to stick through to the end.  You're going to get right back up every time life throws you to the ground and keep fighting, no matter how big a challenge is standing before you.  No matter how hopeless your goal may seem.  That's how you're a true champion.\n\r\nThank you Freddy, for your encouraging words.  They've helped me through tough times more than you could know.  May you rest in peace.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nHeh...so many people complain about this being used as a sports anthem (including me) but Freddie actually wrote it as a sports anthem: \"...I was thinking about football when I wrote it. I wanted a participation song, something the fans could latch on to. It was aimed at the masses; I thought we'd see how they took it. It worked a treat. When we performed it at a private concert in London, the fans actually broke into a football chant between numbers. Of course, I've given it more theatrical subtlety than an ordinary football chant. You know me.\" Though he said he may also have been commenting on Queen's success: \"I suppose it could also be construed as my version of 'I Did It My Way.' We have made it, and it certainly wasn't easy. No bed of roses as the song says. And it's still not easy.\" (queen.musichall.cz/…) Though all of the other meanings of the song could still apply, even if they weren't what Freddie originally intended.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nWhy does everyone assume every song Freddie's written is about being gay?!!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nAnyone here who claims this song is about homosexuality makes themselves look ignorant and small minded, not to mention probably prejudiced in some cases. I think it's obvious what this song is about; it's that fighting spirit, rising to the challenge when the going gets tough and giving the finger to difficult people who judge us for what we are but not who we are. In other words refusing to quit, lie down \t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis is basically Queen giving the finger to all those ppl who put them down and said a band wif a gay front-man would get no where. \n\r\nTheir biggest critics were the \"good folks\" from 'News Of The World' tabloid. I guess its no wonder they named the album 'News Of The World.' ;-)\n\n\n\n\n\n", "comment_6": "\nThis song is timeless, it'll always be around and it'll keep getting played, no matter how homophobic some sad losers are. I challenge you all to find someone who hasn't heard of this song. And anyway, it doesn't matter if Freddie was gay or whatever. He was a damn good entertainer, and that's all that matters. How would you all like it if everyone knew everything about you, even about your sexuality, which Freddie kept a secret until it was necessary to tell people what was going on cos there were so many rumours going around?Leave him alone! Enjoy the music!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nIt's not about gays, Please people !\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI curse the day that this song got reappropriated by shite sports events\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nIt's obviously a gay anthem, and about struggling as a closeted homosexual, which many gay men of that time did. What else are the lines \n\n\"I've paid my dues\nTime after time\nI've done my sentence\nBut committed no crime\"\n\nabout then? Explain. It's about living in a closet, when society hates your guts. Doing a sentence, time after time. Which was the reality for gay people especially in the past. How else you're gonna explain these first 4 lines? What sentences you've been doing, as a straight person? Closeted gay people know all about it. People are really blind if they don't see this :D \n\nObviously Freddie wouldn't say it aloud, he never admitted being gay either. It was the hidden, true meaning of the song. He probably laughed in his mind about the football explanation. If he told what's it really about, it wouldn't have been as popular, and never adopted as a sports anthem.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nlol, you could put it that way, or just say it's a great song\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nyup... yup... one of the best\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nHe's gay?  What?!?  Really!?!  Wow!  Next thing you'll be telling me that Village People were gay too...pfft...like anyone'll believe that...\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI think that when Freddie Mercury is singing this song he trying to say that even though they are famous it took a lot of work and a lot of fighting to get up on top. They're saying that the people who said that they would never make it are the real losers and now they don't have any time for them\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nclassic sports motif\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\ni don't agree with that butterfingersbeck, and what about Alicia Keys with her falling, obviously copied the pianoroll from this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nWhat exactly do you not agree with? Freddie not knowing in 1977 that he would die 14 years later? \"Send In the Clowns\"? \"Naa-naa na-NAA-naa!\"? The song having an unoriginal melody? It not being a bad song? Come on - be more specific!\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nHmm i dont really like some parts of the melody it could have been better\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\ncome on guys...seriously. just because freddie murcury was bisexual (i think he was bi not gay...correct me if im wrong) doesnt mean that that theme is the basis for every one of his songs. he had other inspirational motifs than his sexual preferances\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nthis is a wicked song but has anyone seen the freddie tribute where liza minelli absolutely slaughters this song?\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nIt's obviously about just about a group of people (not neccesarily the band) who have fought hard over the years to reach their current position, i.e. they've achieved all they can achieve and more. They're saying it hasn't been easy but they've finally made it and stuff. A very inspirational song I think.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI'm pretty sure Freddie was bi. He had a girlfriend... at least in his early life, and his affair with the opera singer in \"Barcelona\" has been described as \"well documented.\" So either he was bi or he started straight and switched.\n\r\nSpeaking of his homosexuality, though:\n\n\r\n\"'We Are The Champions'\n\r\nIn 1992 eighth-graders at Sacred Heart School in Clifton, New Jersey, were forbidden from playing the song 'We Are The Champions' by the British rock group Queen, at their graduation ceremonies. School officials refused to allow the song after learning that Queen's lead singer, Freddie Mercury, was gay and had died of AIDS complications a year earlier. When students tried to protest the decision, officials canceled the entire graduation ceremony rather than let the song be played.\"\n\n\r\nHomophoebic or what?\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nthis, along with We Will Rock You started out as gay anthems you know, but it was used so much by sports that it kinda changed what they ment\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nThis song didn't START as a gay anthem you uneducated fool. Gay groups just picked it up after a bit since \"not so classy\" Freddie Mercury was gay.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nwow..ok. freddie mercury was not bisexual.  practically every homosexual person has straight relationships before they realize their true sexuality. they don't \"switch\" or \"become gay\". now that i got that off my back i have to agree with stupid greg a little. sexuality is not the only inspiration for lyrics. come on. its simple: the song is about overcoming obstacles and the journey queen took to get where they are.  Pretty straight foward.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI think you can blame Allmusic.com for all this \"WATC = Freddie's gayness\" ****. But where they got the connection to WWRY from, I'll never know. There's only two Queen songs where I see any links to homosexuality: Get Down, Make Love and Body Language, and both are pretty unknown (and very bad anyway).\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nIts a Gay Rights Song...the end...that is what the song is about..not a band strugglin or whatever else you think it is\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nits about overcoming adversity and reveling in it.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThis song is a phenomenal song. The deep meaning to this song- could it be connected to his homosexuality,did he know that he was going to die over 14 years after that...who cares abt that? this is an inspirational song, sung by an amazing artist, who unfortunately passed away from AIDS related reasons. This is an inspirational song.Anyone who makes a big deal just because its a gay related song..or him revieling his deepest feelings about gay rights, is just doggie. Let him rest in peace! He is a legend! Will always remain in the hearts of those who appreciated his music without bias! May god bless him! PEACE OF FREDDY MERCURY!\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\ni really doubt this or we will rock you were gay anthems. that's just being redicilious. This song couldve been about making it against odds, people saying they'd never make it big with a gay lead singer or something like that, but gay anthems? no. And wasn't freddie not openly gay until after the band made most of their music or am I mistaken?\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nexactly. and if i ever hear this played to some sports bullshit again, i swear to god i will put the teeth down the throat of the person at the cd player. they used to play this every single 'sports day' when i was a kid and it nearly ruined it. i think the meaning of this song is somehting a little more significant then winning a fucking game.  oh, and ScuTTerBoB, what the fuck are you on? freddy was totally fit. and i'm not even gay. and i never say 'fit'.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI think that when Freddie Mercury is singing this song he trying to say that even though they are famous it took a lot of work and a lot of fighting to get up on top. They're saying that the people who said that they would never make it are the real losers and now they don't have any time for them\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nthis song is sooooo great!!! i love it! =) not about freddie's sexuality, get over it!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI don't think it's about ANYONE's sexuality, some people are, a little homophobic in my opinion, back on point:\r\nOne of the best songs ever, just showing that because all of their hard work, the band has become a part of music history, other  bands start covering this song when they hit the big time (Green Day, I heard Good Charlotte, etc.)\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI definitely do not think this is a gay anthem. I think the interpretations that it's a song about Queen's success make the most sense. Queen is thanking their fans for all of the success, but saying that it wasn't always so easy: \r\n\"You brought me fame and fortune and everything that goes with it \r\nI thank you all \r\nBut it's been no bed of roses \r\nNo pleasure cruise\" \r\nIt may also be saying that what the critics say doesn't really matter: \r\n\"I've had my share of sand kicked in my face \r\nBut I've come through\"\r\nBut paulothemanio makes a good point...it doesn't just have to apply to Queen or a band, it could apply to anyone that's worked really hard to get somewhere.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nwhile he was not/did not know he was sick at the time of writing this song, it sends shivers down my spine when i listen to it. so much of it can be likened to someone fighting a disease they know they can't beat. specifically the first verse, about facing a sentence but having committed no crime, aids being the sentence, homosexuality the \"crime\". it seems very prophetic to me, and is a beaufiful song, no matter what you think it is about. its a great song about someone overcoming hardships, and i think almost anyone can relate to this.\n\r\nand i happen to like liza's version. wanna discuss butchering? how about axl and WWRY?\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThis song at its core is overcoming adversity or overcoming sins, problems things in your path.\n\r\nPossible conatations could be overcoming illness, overcoming adversity in life, overcoming a hurdle in sport.\n\r\nAchieving a goal against odds.\n\r\nIts a song designed to be applicable to a wide degree of situations.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nNow I love how yall say this is a so called *Gay anthem* now to be Honest I think this song was about how he came from a shit for nothing child-hood growing up in a possible bad household to becoming a Legend. There are no Sexual remarks ni this song...only thing I hear is \"We did it..took a while and we went through some hards times...But look at where we are at now\"\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nCause when he says \"You brought me fame and fortuen and everything that goes with it \r\nI thank you all\" how n the fuck can gay ppl bring Fame????? i could see if it said \"You brought me out of hiding and thank you for it, everyone\" but it dosnt so if you think this is a Gay Anthem you can ryd on my Nizuts\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nHonestly, I think this song can mean anything. I think the thing that makes Queen such a great band is that their lyrics can mean something to one person and the opposite to another!! I think that they wanted the song to mean something special to everyone, whether it be a gay or sports anthem.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nGod, no wonder Green Day does a cover of this in each of their shows.  I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\ngreen day sux ass\n\r\nive heard better political punk\n\r\ntake \"the Varukers\" for example\n\r\nbadass band, not well known (politial punk unfortunately isnt that good) but not wussy sounding\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nIMHO Green Day is one of the best, but that's besides the point. This is one of, if not the best song(s) ever written.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nkickass song for Queen.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nwasnt fredie bi-sexual not gay? anyway it just seems like hes declaring himself champion for whatever reason, his sexuality or maybe it could be his position in the band.  But really its just a declaration of victory that could be used for anything.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nno! he wasn't fucking bi! shut up!\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nmeursaultsrevolver do u like Queen or somethin cause u said stuff about freddy on his other song \"Bohemian Rhapsody\" anyways this was another great song by freddy mercury and proabably one of the best songs he ever wrote which is saying somethin since in my opinion he wrote great songs\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\no ya and i dont think he was bi i think he was 100% gay\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nThis song is about Ice Cream and Lollipops\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nWHY?!?!?  Why do so many people think all Queen songs are about being gay?  Just because their lead singer was gay doesn't mean everyone else in the band wrote songs about being gay too.  The people who think that are the same people who think all Led Zeppelin songs are about LotR and all Beatles songs are about getting high!!  It annoys me so much.\n\r\nAnyway, I think this song is about overcoming your obstacles in life.  It really inspires me to not give up.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nTo me, this song doesn't come off as celebrating homosexuality. It strikes me as being about living thgough media attention and how they have overcome adversities to reach the point they are at now. It's really about life in general, also. Having a full life and realizing at the end of it that you know who you are and that you've overcome and survived this long. \r\nDeep, if you think about it. \r\nI love Queen, there's so much more to their music. They can write, play, /and/ sing. That's a REAL triple threat. You never see much of that with the bands of today. *sigh*\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nhmmm\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nhmmm\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nlol...yeah, it could be...maybe we should ask Freddie...\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\num...or not parlicious. you have fully just insulted and degraded the song by your long and indecent explanation.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\num...or not parlicious. you have fully just insulted and degraded the song by your long and indecent explanation.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nOkay, everyone knows they're going to die, when it is or how it is, well most of us don't know that. Whether or not it was the basis of this song, well I can't really answer that. However, this is an anthem, in fact, if only people spent less time looking for deep inner meaning, the outer meaning is clear and special enough.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nFucking punk-ass piece of shit damn-it-all-gone track.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nI think it's Queen's ode to their fans. In their time, they were huge with their fans, but not really with music critics, who were often harsh about their music. So it's a bit like \"Our music isn't as bad as this disco that's out there, but, we're doing our time for this crime we're accused of, the critics have kicked sand in our face, but so what? You, the fans are there by our side (giving me fame, fortune...) and we'll show them, we'll keep rocking, because we're the m-f'n champions!\" It just has that personal, heart to heart, from the singer to the listener feel to it, and that especially comes across in footage where Freddie's performing it live.\n\r\nI think people are doing a disservice to the songwriting talents of Mercury, May, Deacon and Taylor to think that every single song the band has done is about Freddie's being gay or AIDS.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nThis is a well deserved self congratulation. I think it speaks of what a fight it is to be at the top of the rock world. I also think he is saying that it is much harder for a gay man to achieve it. Most of the world had no problem with his sexuality but the U.S. did. I have been a Queen fan all of my life and heard comments in the past from people about him being gay. They could not appreciate his genius because of their hangups. I think that this country is finally realizing that some of the most amazing musical accomplishments came from this man. Freddie Mercury was and is one of the greatest perfomers and writers of all time. Brian May is his only real competition. They were the Lennon-McCartney of the 70s and 80s, but more consistent. Freddie was also a much better singer.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nI just wanted to know what virtualfactor means by his comment. If you can't speak English then you can't possibly understand the depth of musicians like Queen.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nI think it's great how both sports teams and gay groups the world over could pick this song up and claim it as their own.  For how many other songs by other groups would that be possible?  \r\nBrian May has gone out of his way recently to say how the \"we\" in this song means everyone, not Queen.  This song was written with audience participation in mind, as was WWRY.  Loved how Freddie nodded to the audience at Wembley during \"I thank you all\".  \r\nDramatic with power.  This got played a lot when my team won the Super Bowl this year. :P\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nThis song is very much tongue in cheek.  It is very arrogant and slightly ironic.  Freddie then starts to revel in the attention.  A great song about making it good (with a knowing wink)\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nKick ass song! Always ended their shows with this one. In my opinion, Freddie wasn't gay......he was bisexual. Mary Austin, the alleged 'Love of His Life' must confirm this. He was just very fond of experimenting. He was a very real, very shy, extremely passionate, immensely talented individual and human being. I miss you Freddie and I miss Queen.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nWhenever you feel down, or whenever you want to win something play this fucking amazing song.... and stop saying all freddie songs are gay......\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nfree wheelin. im sorry, but ur just an idiot. call me crazy but i think it might be possible for songs to be written about things other than sexuality or love. not every song written by a straight person is about being straight. so every song written by a gay man is not about being gay. anyone else who thinks its about gay rights or pride or anything is just an idiot. its about uprising an sticking it to the man\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nNo time for losers cause we are the champions-that's just too funny. Love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nI, personally, think it's a simple, self-explanatory song. But that doesn't ruin the genius of it. Not at all.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\ni love this song i am listening to it right now again just another fun tune to sing everytime you win something no time for losers cause we are the champions of the world\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nmy favorite queen song!!!\n\r\ni agree with FreddieIsMyIdol, queen's definitely amazing since a lot of their songs mean certain things to certain people...\n\r\nanyone who's ever faced any trial (which happens to everyone) and overcome it can definitely relate to this song.\r\nactually, it's not just a song for the triumphant... even though it says \"no time for losers\" there's also \"bad mistakes, i've made a few, i've had my share of sand kicked in my face...\" meaning the CHAMPION also had \"loser\" moments before.\r\nit's really a song for everybody..\n\r\nQueen Rocks!!! GSTQ!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nHaha this song was at the end of the movie The Mighty Ducks... which was my brother and my favorite movie when we were kids.  I'm so proud that he's doing so well in school and with his test scores that I have decided to dedicate this song to him.  Haha... it's just a really great song... he is going to grow up to be a champion at whatever he does... yippie!  A song by queen for a little king... lol\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nWake up!\n\r\nObviously Mercury couldn't spell it out - 'cause homophobia always rears it's ugly head (as demonstrated in these comments), but this line says it all:\n\r\n\"I've done my sentence   But committed no crime \"\n\r\nAlmost up to our days, being gay was considered a crime - thankfully, this no longer goes in our part of the world. \n\r\nFunny though, seeing sport jocks belting out \"We are the Champions\" - THE Gay Athem of all times...\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nThis is song you play when your son loses his hockey championship.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nThis song can be interpreted how you like, in some ways. Regardless, it's a great song. Queen were a great band and, to further state the obvious, Freddie was an amazing singer, still a great loss. But at least people still appreciate them, hey?\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nI think this is a anthem for gays. Plain and simple. When this was written, homosexuality was beginning to be accepted..\n\r\nOddly, it can work as a sport's tune for the cinderella team.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nHere's my take on the song:\n\r\nIt's not simply about winning a sports championship, and it's not simply about rising to fame despite those who put you down.  It's about rising up and overcoming ANY obstacle.  Every one of us will go through hard times, and those of us who continue on as life throws one hardship after another at us are champions simply because we don't give up on life, our goals, or the things we love.  We're still here, fighting till the end.\n\r\nSee, it doesn't matter if you're not an athlete winning a big game.  Everyone has challenges, and those challenges in your day to day life can be so much more difficult than any game.  We've all had to pull through, so let's bask in our victory, because WE are the champions, my friends.  Every one of us, in our own way.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nOut of respect for the late great Freddie Mercury, I won't post the lyrics. This was my high school's unofficial song at all sporting events except football (and we were a powerhouse in basketball, ice-hockey, baseball, and wresting). I love how it's so upbeat....gives the listener the feeling of being unstoppable. And considering Mercury was battling Aids (in private...for the most part) this song has more meaning...although the timing of its release was probably before his diagnosis). \t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nThis song is about freddie Mercury and his path to glory. \"I've done my sentence, but committed no crime\" Therefore, people judged him for his homosexuality, but he committed no crime. also, \"You've brought me fame and fortune And everything that goes with it I thank you all But it's been no bed of roses no pleasure cruise and I consider it a challenge before the whole human race And I'd never lose\" In other words, he thanks everybody for his fame and fortune. but it was not easy to get that far. And, he considers it a challenge to get all of humanity to accept people with homosexuality, and he will never lose the fight. Another thing, \" we'll keep on fighting till the end\" he will keep on fighting for his rights till he dies.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nThis is a great song. It may have been made at the same time as We Will Rock You with a popularity to match, but its more like early progressive rock songs they did like Bohemian Rhapsody. The backup singing reminds me of Lion King.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nWe are the champions\nWe are the champions\nNo time for losers\n'Cause we are the champions\n--------\n\nMy song. And Freddie Mercury is/was the best! Here's to an excellent musician.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\n\"And we mean to go on and on and on and on\"...my song. Freddie rules...even all these years later few have what he had (musically). RIP.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nFreddie stated that this song was about football, but as everybody knows, Freddie would act very coy when asked to define his songs. I think you really have to look at what was going on in Queen history at the time to understand the scope of the song.   Basically, Queen were hated by critics and the music press.  Yet, they were selling out arenas around the world and were selling a massive amount of records.  I think this song was basically a braggadocios  \"fuck you\" to the music press.  It's a song about the perseverance and resiliency of the band.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nI heard that this song is supporting gay ppl. Freddy Mercury is gay, and I guess he was saying, getting by wasn't easy.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nquality tune.fucking quality\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nthis is a wicked song but has anyone seen the freddie tribute where liza minelli absolutely slaughters this song?\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nVery amazing song. Although Freddie was one ugly mother :|\r\nhehe\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nTo AND512:\n\r\nEr - Freddie must have been amazingly prescient to have known in 1977 - when the song was recorded - that he would die in 1991 of a disease completely unknown at the time! \n\r\nApart from that, I can hear two melodic influences in the song - \"Send in the Clowns\" and the ancient playground taunt \"naa-naa na-NAA-naa!\" Doesn't mean it's a bad song, though, just not very original.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nI think it's pretty obvious that this song is about breaking up and a girl that he loved.\n\r\nHe felt like he and his lover were the champions of the world cause she could suck a mean dick.  And I don't know about you, but after I blow my load down the back of a hot girls throat, I feel like a champ.\n\r\nAlso, the part where he thanks everyone, he is thanking the 70s era society for making it ok for girls to be sluts, which means he gets lots of cocksucking.\n\r\nAnd in the part where he says that it's no bed of roses, etc, I think he means that he was trying to get the same girl to do anal, but she wasn't very cooperative, so instead of coaxing or romanticizing her into it he just dropped some roofies into her drink and took her anal virginity.\n\r\nBut then his penis had poop on it and the race he talks about was a race to get the poop and blood from her anus off of his dick before she woke up.\n\r\nThen when he says he's committed no crime, he means that it's ok to do what he did if your girlfriend won't give up her chocolate starfish and that you should do just what she did.\t\t\t\t\n\t\t\t\t\n\n"}