{"comment_0": "\nFirst of all I just want to comment on how much I love Mariah and that I am proud to be the first to comment on this song. I also wanted to add that this song is at the top of my list on her best. The meaning is obvious...it is about a man who she is no longer with but misses dearly. It is about always reuniting with your true love and who u belong with!\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI Love this song, it really shows the real Mariah Carey from the old times is still around. Beautifully sung & written.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nGreat song. Pretty self-explanatory.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI have been anti-mariah for as long as I can remember, but this song is actually pretty good.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nABSOLUTELY LOVE IT. cant even explain how much i like it. after my and my boyfriend brokeup, i was on the phone with him and this song came on and he said i was our song... mariah carey always has made songs that tough the heart...\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nWOW!  i love this song for so many reasons.  i knew it was a song that my baby liked and then we had some problems and every time i heard this song i just thought about them even more.  just everything about it reminds me of how i was feeling without this special person in my life.  i love my baby so much.  and this song is all that could keep me going through those rough times and now everything's all good and i'm so happy once again.  i love my baby so much and it's because of this song that i can be myself once again.  i love you sean!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nAnd yes, these lyrics are abit effed up\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\ni have to admit that up until now i hated mariah carey, i really didnt think she was all that, but after listening 2 this song - god she is amazing!! its so easy to listen to this song and relate to bits of it ( if not all of it) i love it!!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nso deep....its very great song. with her angelic voice...\r\n\"I only think of you\r\nAnd it's breaking my heart\r\nI'm trying to keep it together\r\nBut I'm falling apart\"\r\noh God.. i miss her so much! damn hahaa\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ngooooosh mariah has a lovely voice!!! this is a great song...  great meaning... i love her voice not many people can reach that many octaves!!  such a sad but great song!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nOK... I am a HUGE Mariah fan... and I LOVE this songs and so many other songs by Mariah BUT this is one of my ALL time favorite songs.  It is about true love... no matter where you go or who you go with... you will always think of your true love.  Unfortunately, real life doesn't play out like the video MUST of the time... so you just have to think of that person ALL the time!  It's a battle everyday... some days I keep it together, other days I fall apart!\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nthis is just an amazing pop song\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\ni use to talk to this guy all the time n i really liked him. well we were just friends, i always had a bf and never had the nerve to leave him. but now that i look back on this song and think about it i wish i woulda gave this guy a chance bc when this song came out he sang it to me n told me that no matter wat hed always have feelings for me. i think it makes this song really special to me and kinda upsets me to read the lyrics n think bout him. we dont talk anymore n thats wat hurts the most!\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI thought I was over my failed relationship, but I don't know.\r\nI heard this song again randomly on the radio..-sigh-\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nmariah is my girl- we really relate i feel, her lyrics always hit a spot w me\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\ni love this song...but i really dont get how its a follow up to the last on..but thats probly me being slow agen :p\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\ni'm not a fan of hers but i like this song.. she sang it on oprah.. she did a good job\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThis song is so pretty! I love Mariah Carey, too. She has such an angelic voice. This song is about how she screwed up a relationship with the man whom she obviously belonged to, and now she misses him. nothing negative to say at all, except that tinkerbabie fucked up the lyrics a little bit.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\ni LUV this song. lol and im a guy. i reckon its a sweet song. reall well sung and heaps of ppl can relate to it. nice job! \r\n...............we belong together.......\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nListening to this song each and every time makes me think of my ex-fiancee, and I can relate to this song even tho it's directed to a guy. I love the video how she leaves the guy at the alter cos she sees her ex watching her from afar, just incredibly romantic, but that rarely happens in real life. People sometimes marry the wrong people...oh well. that's life and it sucks.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\ni love song it has bitter sweet for me :):(\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\ni don't like mariah carey or this style of music all the much..but this song is amazing. it gives me the chills. especially her voice at the end of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nHer voice....omg she would have to have one of the best voices of all time\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nthis song is amazingly pretty but the video is tacky as hell\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis song is awesome!!! it is the best song! i love the video too and i definitly dont think its tacky!\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nthis song is my favorite ever. it relates to every relationship ive ever had.. which is one. we broke up because he realized he was gay, but i tried to convince him he wasnt. i did a lot of crazy things to get him to like girls again but he just wouldn't get over his homosexuality. it really pissed me off and i still can't quite get over it. i think if he would jsut suck it up and have sex with me he'd realize that he likes girls and that he shouldn't be gay anymore, because \"we belong together.\" everynight i cry and call him at 4:37 a.m.... i think he's gonna get a restraining order pretty soon..\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI'm not much of a fan of Mariah Carey, but I really like this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\ni lov this song! its the best and any1 who thinks otherwise can anser 2 my evil goldfish. arh u stupid goldfish eating my pencil................GET OFF! NO THTS MY ONLY PENCIL! nnnnnnnnnoooooooooooooooo! ok im fine now any1 who wants 2 fite my goldfish just say so.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI love this song for some reason i dont know why,its a nice and slow nice song.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nthis song is my favorite ever. it relates to every relationship ive ever had.. which is one. we broke up because he realized he was gay, but i tried to convince him he wasnt. i did a lot of crazy things to get him to like girls again but he just wouldn't get over his homosexuality. it really pissed me off and i still can't quite get over it. i think if he would jsut suck it up and have sex with me he'd realize that he likes girls and that he shouldn't be gay anymore, because \"we belong together.\" everynight i cry and call him at 4:37 a.m.... i think he's gonna get a restraining order pretty soon..\n\r\nYou're pretty pathetic.. eugh. If your boyfriend is gay, let him be. You cannot choose his sexuality!\n\r\nThis song is basically about a girl who had a relationship, they lost it, she found somebody new but still loved her ex.\n\r\nI've seen her perform live and she sounds even better live than on the cd. I don't usually listen to Mariah but this song is really really good!\n\r\n♥ hil\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nwell, human do errors in their life and human just try to fix it with every way, including by making this song...good babe mariah!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI think Mariah's always being good, but underappreciated lately. I'm glad it took her back to the spotlight, tough.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nThis song is perhaps her best and she mentions Babyface which is the bomb! For any of you softy's who have perhaps just broken up get a few Babyface songs into ya, its sure to send you into depression... lol... anyways the way Mariah puts emotion through her voice into this song is shithot, and she couldnt of done a better job...\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nMost of her songs are towards Marshall Mathers. More commonly known as Eminem. I love this song, and most of her others. \t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nmy god this song must of been written for me.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nItsLikeThatYall, only one of her songs is about Eminem - 'Clown' on Charmbracelet\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nmy students like it more than I do. But I like Mariah.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\ni love mariah and im inlove with this song\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nniiice...me likey..\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\ni know mariah gets bagged out a lot. but the cd that this song is on is one that i probably have played the most out of all of my CD's. This song always nearly makes me cry. Really meaningful. Great stuff.\r\n- hayles -\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI HIGHLY\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nI HIGHLY\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nuGH didn't tell it to send.\n\r\nAnyway...I HIGHLY doubt it, but is the song about Tommy Mattola?\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nAlright nevermind, I found out the album is about getting away from him. Pretty stupid and shallow, and quite bitchy of her to say \"freedom\" from Motolla. If it wasn't for her, she might not even be as famous as she is.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nshe made a mistake to dump the first guy and realized she truly did care for him. the song is NOT about homosexuality,just not konwing what really was the best thing before.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nMariah Carey my all time favourite female singer great vocals and songsss love this song and basically all her other song and ummm the clip for this song Wentworth miller ummmm yummmm love him soooo hotttt!!!! lol yeah well read the lyrics lol doesn't take a genious to figure it out M.C is the best in her own league\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nis this video supposed to be a sequel to it's like that? with the old guy and wentworth miller\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\namazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\ndefinitely about heroin. \t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nThis song, WOW, Mariah at her best!! \r\nWithout a doubt this is the best song, she has ever released and the summer it came out, I played it so much, over and over again, and when it came on the radio me and my friends all sang along. Her live performance of this at BET and The Grammys 2006, where awesome!! Proving, with the right preparation, Mariah can still sing amazing!!\r\nI dont know anyone that doesnt love this song, if you havent got it, download it! itunes does the CD single, with several tracks on, for Ã\u0082Â£1.99!!\r\nWhen I was single, for so long, if would give me hope that I would find someone, I love so much I can talk to on the phone till the sun comes up, someone I cant live without. This must be the most beautiful, brakeup song ever, specially if you lost someone you loved.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nI don't think that this song is about a love that Mariah let slip away and is now regretting it...I used to think that thought until I was listening to it the other night, and feeling down, but I realized that the song is the other way around.  Mariah didn't want to let the relationship go with the man, but pretended that she agreed (I didn't mean it when I said I didn't love you so...I should have held on tight).  I think that she misses this person and knows in her heart that they belong together and she is regretting allowing him to get away because she didn't fight hard enough for the love she knows they both felt...\n\n\n", "comment_51": "\nWhen you left\r\nI lost a part of me\r\nIt's still so hard to believe\r\nCome back baby please\r\nWe belong together\n\r\noh yea thats so me right there\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nThis is a perfect pop song. Good ol' Mariah.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nits about  relationship ending of no good reason \t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nPersonally I think that this Mariah Carey thing and also other pop music artists like Katy Perry, Jonas Brothers, Pussycat Dolls and other \"talents\" have a decent voice, marketable features, like decent sized boobs, and fairly quiet personalities, just crank out money for the corporations (major fucking record labels). and all these songs are shallow, yet somehow many people can somehow relate to them, and many people are unfortunately unable to see through the corporate greed behind these cookie-cutter artists. And I do not think that these songs are bad, or that these people have poor singing talent, but I absolutely hate, with every fiber of my being the greed and money there is to be made through these artists, and the shallow people who buy these records and cannot seem to understand anything aside from their own feelings and buying something that sounds good, but in essence, has no meaning. \t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\ni luv da lyrics......f****n awesum!\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nom i lu tis song so totally remid me of me ex boyfriend and me longgggg story of  what happen \t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nthis mean how two ppl belong together but if you leave my side who would be there??\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nthis song is well writen and it always reminds me that i have a special someone and that i should never let go of him because i will want him back and the pain i will have without him\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nI get the feeling that this was written for Tommy. This song fits their life perfectly; even the video. Itâ\u0080\u0099s obviously not about Nick because she was with him back then. Just listen.... She said that this was her favorite song on the album, and that it was written from a lot of memories. She even cries in the video. She also does live performances and really puts her feelings into the song. No other song I've seen her really get into it like this one. She looks like she is about to have a breakdown. There was a performance where she was ask about Tom, and immediately right after she performed this song. Not to mention that her wedding dress in the video looks a lot like the one she wore on her wedding day to Tommy. They said that they both were devastated when it ended. I feel she still loves him. I feel for her situation. Breaks my heart that she's trapped in this business, and can't be truly free. She clearly has a lot of pain. It's not all roses and sunshine.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nYou know what? Honestly? I always thought it was kind of a message to the music industry. This was her comeback album, and she was still recovering from Glitter and her emotional breakdown. And I know Virgin paid her like 130million to leave because of how terrible Glitter was. Sebsequetly she had to sign to a slightly less powerful label and spent a few years resting. She made 'Charmbracelet' during this time, her lowest selling studio album at that point. And didn't she put on her old wedding dress for the video? Who the hell puts on their old (divorced) wedding dress? Sounds like someone misses someone alright. And wants to go back. Its like the song was a \"take me back\" message and the industry answered.\t\t\t\t\n\t\t\t\t\n\n"}