{"comment_0": "\nThe chorus gives away what the song is about.\n\r\n\"You're a... rockstar (baby)\r\nEverybody wants you (everybody wants you)\r\nPlaya... Who can really blame you? (who can really blame you?)\r\nWe're the ones who made you\"\n\r\nThis is basically saying \"don't forget that you got really famous because of your comedy songs and celebrity bashing\" or that Eminem would be nothing without the celebrities he's made fun of. \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nok kids\r\nthis may be the least amount of swearing he has ever done in a song bar just the two of us/'97 bonnie & clyde. this song was released one day after it was announced that lindsay lohan and sam broke up which makes the joke outdated before the song was released. the female vocal is dina rae who has appeared on track 13 of eminem's previous albums, i REALLY hope this song is track 13. en.wikipedia.org/wiki/…. it would be great if eminem could go back to his roots but he can't for two simple reasons, he can't rap about being poor or street because he is not anymore and would be a poser and a hypocrite for always bashing on fake people like fred durst and everlast. he also gave up making explicit drug references when he stopped doing hard drugs i believe between devils night and eminem show in 2001. my opinion? easy to listen to because it is new and the boy can rap, but disappointing because lyrically it's a collection of name drops and a fart sound. \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nYeah, this song would be great without the accent but good song and hilarious video. Can't wait till Relapse.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nFuck yeah first comment! This song kicks so much ass! Shady is fuckin back!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nNot bad, the meaning is obvious.\n\r\nUusal Em first single.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nan elite song. eminem is back, and this song is him telling everyone that he is the man. when he says \"i am the only one for you\" he means he's the only rock star who understands his audience (white middle-class suburbanite boys). he is really smart and this song is the beginning of another chapter of eminem making fun of us all :)\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nPersonally, I reckon Em's older stuff was better. I LOVE him, yet i really think he failed with this song. I hope we get our original, angry Marshall back soon =(\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\n??\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nitz the half song ...\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nwow missing half the lyrics to the first part and half the song.. nicee\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\n\r\nI think its \r\n\"And this time it wont be for the Ritalin binge\"\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI think this is a song that grows on you, but I do love it. \r\nI think it's not as good as his old stuff, but he's obv. gonna release the 'comedy' songs first then his serious stuff. which is always his better work ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nIt grows on you, I love it now. \r\nWho's singing the chorus? \n\n\n", "comment_13": "\nI love the \"You're my Amy, I'm your Blake\" bit =]\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nBut Lindsay, please come back to seeing men\r\nSamantha's a two, you're practically a ten\r\nI know you want me girl, in fact, I see a grin\r\nNow come in girl.\n\r\nThis made me laugh\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nCall me stupid but who the **** made who? \r\nFans made Em?\r\nGirls made Em?\r\nCelebrity's made me?\r\nEm and Co made those girls?\n\r\nI can't work this out..\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nclassic hilarious eminem\n\n\n", "comment_17": "\ncuzzamuzik.blogspot.com/\n\r\nHave a read of this, it has my full view of the song.\n\r\nI feel this a poor effort and not the type of comeback I would have hoped for!\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nhe's so skinny in the video--that's what caught my eye cuz he's pretty cute now and i had no idea he could dance like that.  he's definitely got my attention now\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThis song was on the news when it first came out.\r\nEminem said this song is poking fun at certain celebrities because of their behavior and such. Though he shouldn't talk. Ahah. I enjoy his songs, though. Some celebrities were offended, but some were flattered by being in his song, apparently. Love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI think it takes a few listens before this song really sinks in but once it does you start to love it.  The beat is classic Dre and Eminem flows like crazy on this.  The lyrics are funny and the hook is tight.  Relapse is going to destroy.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\ndidnt like this song at first... but its growin on me!!! \t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nCharmagne Tripp is the girl that sings in the chorus\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nTo me, it seems like he's making fun of people who are famous because of something other than talent. And how scandalous celebrities attract more attention/love from the fans than talented celebrities do.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nit grows on u, its funny, but still..dissapointed dissapointed dissapointed .... =(\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\naw he makes fun of brett michaels in the music video! That's so sad, rock of love and poison kicks ass! Addmittedly though, i can see why one might mock a reality tv star/ ex glam rocker. This song is very witty and catchy...great single\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nthis is the weirdest fuckin rap song ive heard in 10 years.. who would bump this ? he has a country beat in the background and he's rapping with an accent ? \r\njust don't see why one would listen to this song on their free time..\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI like this song but i wish more of his album was more serious.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI like this song but i wish more of his album was more serious.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nOcelocity  has got this one down. The chorus gives it away. its sorta backwards because the chorus is telling Eminem not to forget that they're the ones who made him because without them he wouldn't have much to rap about. I haven't listened to all that much of Eminem's stuff but in my opinion he's a really great rapper. The song has a funny flow, it sorta grows on you.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis song really does grow on you. The whole album does.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI like the vid and the song. hahha!!! they made fun of bret michaels!! rofl\r\nthe meaning of this song is way deeper than people think it really is.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nAt first I hated this song and I didn't really like Eminem's newer stuff \r\nbut this song has totally grown on me and i love it now. Way to go Eninem, I love ya.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nwhat does \"samanthas a 2 , ur preactically a ten\" mean?\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI thot the line \r\n-Lindsey please come back to SEEING MEN \r\nwas\r\n-Lindsey please come back to CNN!\r\nhahahahaha! I just caught it \r\nyesterday. wups! :P\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\neminem is my all time favorite artist!\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThis song sucks!  Eminem has completely lost it, he needs to go back to his roots and give us what he brought on his first three albums!\t\t\t\t\n\t\t\t\t\n\n"}