{"comment_0": "\njeez.....you guys are all nuts. Here is what the song really means......it a three different snapshots of one mans life....as a boy....a young man and an old man.....as a boy He is playing.....kicking his can all over the place...refers to a childrens game called kick the can....waving your banner all over the place and the blood on your face line refers to the fact that many young folk get involved in causes,factions and the like when they still are motivated by idealism and finally as an old man who has come full circle,back to his childhood.both the first verse and the last includes the line...mud on your face....as an old man he hasn't changed a thing hence he is a disgrace.....this has nothing to do with gay rights or any of that shit. I find it amusing that gays wrap themselves in the cloak of Queen music to espouse their lifestyle.I am no homophobe but I find it tedious that Gays wanna find some gay reference in almost every queen song.Get a fucking clue.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nHey, this is my first post here, I'm surprised to see that people seem to be confused about this song, for me the meaning is clear. Ok the way I always thought of this song is that it is about a Revolution.\n\r\nFreddy Mercury is the Voice of the Ruler (a King or Dictator or something) and he is speaking to a crowd of Protestors (Revolutionaries), He's trying to bring them down, saying things you're a \"big disgrace\". The People respond with just shouting \"We Will Rock You!\", meaning We Will Bring you down or We Will Overthrow you!\n\r\n\"Waving your banner all over the place\" Clearly the crowd is carrying Revolutionary banners.\n\r\n\"Buddy you're an old man poor man \r\nPleading with your eyes gonna make you some peace some day \r\nYou got mud on your face \r\nYou big disgrace \r\nSomebody better put you back into your place\"\n\r\nThis bit shows this clearly, the poor people are rising up and their ruler says get back into your place. i.e. I'm in charge you're just a lowly peasant.\n\r\nI assume that in the end the people storm the Ruler's palace and overthrow him.\r\nTo me this is defiantly an anti-authority song, I don't know if my interpretation is 100% correct but that's the way I've always imagined this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI just recently saw my 1/2 brother, and he was an 70's child so I asked him what he thought the song meant. He said \"I don't know, but I remember that they always played it at any sports thing for like 5 minutes, and everyone would just keep saying 'We will, we will rock you!'\". So even though I do think that this song is a representation of the different stages of life, I think it's just a nice song to listen to when your in the mood for rock. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI agree with most of you on how the song loses anything in once possessed due to the fact it's played so much at sporting events. I know all the words but I knew this song before I ever heard it at a sporting event. Great song. Simple yet really gets your mind going.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThank you to the select few who are actually using this site correctly and posting what you think about the lyrics!!!  I think the three verses do refer to the same person, and he is considered a disgrace by society because he's trying to not conform.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\n5/11/05 Hi, I'm 52, which gives you an idea of the generation that I grew up in (Beatles, Stones, etc.) I LOVE this song followed by Champions, but I really don't understand the lyrics. Who is stomping whom? Are those with mud on their faces, at different ages, different generations (in one time frame? or at different time frames, meaning the same boy, man and old man???), stomping, fighting our society? Or, is Queen telling us that \"they,\" the men represented in the lyrics, deserve to be stomped? If so, exactly WHY?  And why is this song followed by The Champions? Did Queen mean that those who thought that the boy, man, old man in We Will Stomp You, to be annhiliated, socially, then would be \"stomped\" out by the champions of the world?  Please enlighten me. I always blast this song and The Champions, but am confused as to its true meaning...  Thoughts from the gallery???\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nhere here Moonlitknight.\r\nSo many people do that whole gay champ thing with these lyrics.....ITS A RED HERING people.\r\nI also agree thats its 3 different stages of this dudes life\r\nThe last part seems to suggest that as an old man, he has now lost touch with what the youth want as they have their own generational agenda thats far removed from his, hence being put in his place, and thought of as a disgrace.\n\r\nYes it is the classic 3 stages of life, wasting it, ruling it, and just living in it\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nWhen I looked up this song on here I couldnt believe how many people had bothered to post something completely meaningless. So I thought ... why not join them.\r\nAs soon as I came across MoonlitKnight's response, I thought thank god someone has something intelligent to say. This person got it pretty much spot on, as did a few others.\r\nSo if you happen to be reading this site in reverse, or come across my post at random - MoonlitKnight and anakoluthon have the low down.\r\nReassuring to see some people can actually interpret lyrics to some extent, not putting the others down, but come on - dont waste your precious time with something you have no idea about : )\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nPlaying in the street gonna be a big man some day \n\r\nShouting in the street gonna take on the world some day \n\r\nPleadkng with your eyes gonna make you some pgace some day?\r\ni would make good comment but i have no idea what this is supposed to be...\n\n\n", "comment_9": "\nin Iran everybody knows this song ( at least clapping and stomping ) but Queen isn't that famous here ( foreign music isn't popular for so many reasons like language , ... ) and it reminds me my childhood and football games , I mean this song is so INTERNATIONAL\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nor pissed\n\n\n", "comment_11": "\nWe will rock you indeed\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nits a cool song but is too widely used by sport events...\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis song is THE ULTIMATE party song. Get 200 people in a room, not matter what they normally listen too, and stick this on. If its not the simple yet powerful drum beat, it'll be the simply powerful guitar solo that gets people jumping up and down.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nIt's such a universal song! Ask almost anyone anywhere if they know the beat to this song and they'll stomp and clap as if it were 2nd nature.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nby far one of those songs that you can't easily find out what it is just by the first few words\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nIt's a great song but 5ive slaughtered it.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nIt was never a gay anthem. It wasn't even written by Freddie. It was written by Brian May.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThe song we will rock you sound almost anti-protest, which makes it possibly aimed at the sex pistols, who were protesting the kind of music queen made.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThis is a good song, but it's really been butchered by sports stadiums.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThis song is a classic. Try clapping and stomping the drum beat while listening to the song in a big group while staying in sync! I'll bet you anything that you'll screw up :D\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nmajor kickass song......to bad they abuse it sometimes......with all those fucking posers out there\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\ni used to blast this song when i played roller hockey with my friends in like 4th grade\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nJust as a pointer, there are no drums on the track. the beat was done by the band stomping the beat in the studio\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nFreddie mercury may have been a gay man, but maaaan does he sound manly\n\r\nhes got one of the most badass voices in hard rock history.  better than Bon Scott even\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI love this song ...\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\namen.\r\nthey said this was specifically made for football. but who cares its universal. what im curious about is how brian came up with such a simple but infectious tune\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI agree with whoever said it's an anti-protest song.  Of course it's about that.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nAre you kidding? This song is the ultimate protest rocker song. They want the people to get pissed and start chanting \"We will we will rock you!\".\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nI agree with Eatcarpet - this song is a very powerful song. Making you feel powerful - \"We will rock you\" = you can mess w/ us- it gets you to rally up and stand up for what you believe in - the >perfect< protest song-- with a killer guitar solo!!! \r\nLong Live Queen!! \t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis song kicks.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\ngood thinking, but freddie didnt write the song\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nIn the UK Pepsi commercial, with Beyonce, Pink, and Britney singing it, the song is used by Pepsi to distance itself from the war in Iraq.  The Emperor has arranged a gladiator fight between the three women, but they let peace doves fly, and instead of fighting amoungst themselves, they feed the emperor to the lions and share his Pepsi with the crowd.  Amazingly, since the song was first song in the 1970's, in the Pepsi version, the waving banner suddenly means the 'Mission Accomplished' banner.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nThi song is the greatest rock song ever created!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nFreddy Mercury had to travel foward in time and write this song about the Nintendo Wii. That is the only thing that makes sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI was at the very first public performance of this song in 1976. Yews, I said 1976. \n\r\nThis song was commissioned for the defunct NASL San Jose Earthquakes as a theme song for the struggling professional soccer team. In a short pre-game concert (I was there for the game, I had won tickets from my youth soccer league) Queen played the song. The Earthquakes owned the rights to the song for one year, after that Queen was free to present it to the world as their work. \n\r\nIt sounds like a sports song because it was specifically written to be a sports theme, such as the Chicago Bulls or LA Lakers theme songs.\n\r\nThe concert is far more memorable than the game, it was totally unannounced and unexpected until we took out seats and there was a stage on the field. Queen actually had to INSTRUCT us how to do the two stomp and a clap action by pantomiming the action on stage.\n\r\nWhen the song was released on 45rpg vinyl records, the song \"We Are the Champions\" was included on the flip side because it also had a sports theme.  This is why the two songs are forever associated with each other and with sports.\n\r\nI have no clue whatsoever why or how this song came to be associated with the homosexual community.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI almost forgot, the meanings of the lyrics.\n\r\n\"mud on your face, you big disgrace\" refers to the other team basically falling flat on their faces in the mud, being muddied by the home team, going home as losers. \n\r\n\"waving your banner all over the place\" is in reference to the big egos of athletes, often bigger than their actual abilities.  \n\r\n\"old man\" refers to the athletes who were once great players who stayed around too long and can no longer keep up with the younger players. I think this one was a direct reference to Pele, the soccer great who had recently retired after a really bad year. Think Barry Bonds and Jerry Rice.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nits not about football get over it. it just get used for that s some tone deaf drunk twats at football games can roughly sing it.\n\r\nthank you and good night\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nThis song is about rockin out to the next degree and rockin other people, thats it\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nyeah lyrics...ok...MAY I JUSTA DD THOUGH... that the box where u type ur comment's quetsions is What does this song mean to you?\r\nSo NEH..anyway i heard if u play it backward it says something about pot, tis that true?\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nOh My God! naomcara you freakin' sex addict  it has nothing to  do with  that its about  football the banner, we  will rock  you, mud  on your face its all something to  do with football jesus\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nThis song is alright. I really doubt it has anything to with the Sex Pistols, who were a great band, despite them being a bunch of fucking pricks.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nItÂ´s made purposely for the concerts. at 70Â´s and the beginning of the 80Â´s they usually opened the show with the  fast version of this song and at the end the performed We will rock you/We are the champions.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nAwesome song. I think it's safe to say that everyone on the face of the planet (or at least in the western world) has heard it. I wonder if Brian knew he was writing a song that would stand the test of time and  be even bigger than Queen. It's a shame how the song is so overplayed and rock fans overlook the true contributions Queen has made to popular music.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\ngreat song!  like my favorite from queen. good song to kick ass to! haha\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nThis is for Biznithch 08...The suposedly backmasked pot song your looking for is \"Another one bites the dust\".  It along with Prince's \"Darling niiki\" are the only songds Ive ever heard that are truly back masked, meaning when you play them in reverse you can hear the message clearly and not as an accident provided buy the sound of the foreward played lyrics.......And no people Stairway to heaven isn't truly back masked you can make that out to be whatever your imagination allows.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\ni'm starting to get tired of listening to this on the radio about everyday!\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nsong never fails to get me AMPED\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nreversespeech.com/…\n\r\nyou can come up w/ your own theory about \"backmasking\"\n\r\nthis song has nothing to do w/ it however :]\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nreversespeech.com/…\n\r\nyou can come up w/ your own theory about \"backmasking\"\n\r\nthis song has nothing to do w/ it however :]\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nIt's a tribute to all of the failed revolutions, and particularly the people who participate(d) in them.\n\r\nIMO.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nThe first time i read the lyrics to this song, i thought the message was pretty obvious. I guess i was wrong, though, so here's my interpretation for each verse:\r\n1) The protagonist is a child and all about competition (playing Kick-the-Can or any other sport); his goal is to \"be a big man someday\", i.e. to prove how good he is, and he's singing for his team.\r\n2) Similarly, the protagonist has grown up to be a youthful idealist (probably a revolutionist, judging from the blood on his face), who wants to prove that his ideas are superior. Once again, he's singing on behalf of his team, or party, or regime.\r\n3) This is where things change. Now the protagonist is old and downtrodden the mud on his face is probably from living on the streets. He realises that the views he had in his youth were flawed, and he just wants to find a measure of peace. But now \"somebody\" (possibly another young man like he once was) is gonna put him back into his place and reassert the competition and one-side idealism that he now know are not the answer. And note that this \"somebody\" is now the one who's singing \"We will rock you!\"\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\n1st, the song is not a gay anthem. Come on! All gays in the world singing WE WILL ROCK YOU??\n\r\n2nd, Freddy Mercury WAS NOT GAY! Cant you make a difference between gay and bi-sexual? There is...\n\r\nfor anakoluthon: i dont agree with you, i think that the message is like this: it doesn't matter if you're a boy kicking cans, a man shouting or an old fellow pleading. We will rock you, 'you big disgrace', and that's that. Why would we do that? Because we are the champions of the world. We will rock everyone. ('we will rock you' is the B-side of 'we are the champions') Your view sounds reasonable, though. ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nthis song is the ultimate song for 15 year olds..  when you are 15 you think this song is the coolest  song ever.\n\r\nthen when you are 20 you think, hmm it's ok.  \n\r\nwhen you are 30 you think OMG this is getting old, WTF why did I ever like it?\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nThis song means that some people grow up even as children to have a dream and then have it last until they are an elderly person. \n\r\nSadly in our society this is a hard undertaking. Children have dreams and they sometimes change because they realize who they really are later on or vice versa. Maybe some one knows who they truly are at a young age. \n\r\nThis song is an entire repetitive succession and people twist it like any major thing known to man and universal I think that is the point of the song. Your dreams will be born some day that was what freddie was trying to say I think. Afterall he didnt even get to live a ripe old age so what I said previously fits. Not every one gets to live to be 100 or not every child lives to see their adult hood because of ill circumstances freddie's was HIV/aids\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI used to wonder what made this song so gay when I was in Kindergarten and all the other dumbshits in my class liked it because they didn't know any better.  When I found out that Freddie Mercury was gay, I swear to god an actual lightbulb popped above my head.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nisnt it funny how a band can write so many songs and have like 5 major hits? ok ill admit, like so many others, i knew this song before i knew anything about queen. his voice sounds so good on here.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\ni love the rhythm this song is great!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\ni love the irony of queen \r\nwhat i mean is the are notorious for having a gay lead singer and how society look down upon gay people but this song is played at almost every sporting event and sports are associated with strait males \r\nany way this is a great song and QUEEN ROCKED \r\nlol i love irony\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nThis song kicks ass in many ways, the stomp and clap was geneuis! and i agree with babibling21 because if you really do ask anyone they probably automatically start stomping and clapping.The other thing is the rythem to singing it, its hard if u dont know the words but if u do its (2nd nature) theres many more reasons why it kicksass, unfortunately i can't name them all but it does have a really kickass guitar solo which makes it even better!\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\ni love this damn song! you easily can get it stuck in your head\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nFreddie Mercury - best rock vocalist of all time?.....this song rocks\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nI take this song to be telling a story about a boy who played in the streets for fun â\u0080\u009dPlaying in the streets gonna be a big man some day, you got mud on your face, you big disgrace, kicking your can all over the placeâ\u0080\u009d meaning he is a boy and one day he will be a man but as of that moment heâ\u0080\u0099s being a kid. â\u0080\u009cBuddy you're a young man hard man, Shouting in the street gonna take on the world some day, You got blood on your face, You big disgrace, Waving your banner all over the placeâ\u0080\u009d Meaning  when he gets  older he will get into fights to represent where he was coming from or anything he is representing. For instance in the film Hooligans they fight in the streets to represent something that is important to them. And the last verse â\u0080\u009cBuddy you're an old man poor man, Pleading with your eyes gonna make you some peace some day, You got mud on your face, You big disgrace, Somebody better put you back into your placeâ\u0080\u009d meaning now that heâ\u0080\u0099s old he wants to see peace in the world or at least where heâ\u0080\u0099s coming from. \n\r\nMany people take it as a sport thing(which it very well can be, I'm not saying it can not) because itâ\u0080\u0099s played at sporting events which changes peoples prospective on it. I would love to hear Brian May talk about the meaning of the song. \n\r\nWell thatâ\u0080\u0099s what I believe this song is about. I could be wrong about it though.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nI see it as a diatribe of sorts on the (usually young) people who are rambunctious, puerile, and always starting fights. Those who strut around like they own everything and act like everyone is their inferior.\n\r\n\"Buddy you're a boy make a big noise\r\nPlaying in the street gonna be a big man some day\r\nYou got mud on yo' face\r\nYou big disgrace\r\nKicking your can all over the place\"\r\n--- They think they're \"it\" (so to speak), but really all it is is noise, and they really have very little (the can).\n\r\n\"Buddy you're a young man hard man\r\nShouting in the street gonna take on the world some day\r\nYou got blood on yo' face\r\nYou big disgrace\r\nWaving your banner all over the place\"\r\n--- Reiterates what the first verse has said.\n\r\n\"Buddy you're an old man poor man\r\nPleading with your eyes gonna make you some peace some day\"\r\n--- I think this possibly shows how they're older now and they haven't accomplished much, nor do they have much. They possibly secretly want to settle down, but they can't or don't know how to, so they keep doing what they do.\n\r\nI think this song's generally saying that they're sick of this sort of behavior.\n\r\nWell, that's my take on it anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nBuddy you're a boy make a big noise\r\nBuddy you're a young man hard man\r\nBuddy you're an old man poor man\n\r\nAmazes me how buddy can talk the talk but can't walk the walk!\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nOK everybody here that is commenting is 100% wrong about what they think this song is about. This song is about a hobo. Straight up. Just look at the lyrics. \n\r\nBuddy you're a boy make a big noise \r\nPlaying in the street gonna be a big man some day \r\nYou got mud on yo' face \r\nYou big disgrace \r\nKicking your can all over the place \n\r\nThis stanza is about a kid who doesnt care about like anything and thinks that he is gonna to be some great superstar or some rich guy. \n\r\nBuddy you're a young man hard man \r\nShouting in the street gonna take on the world some day \r\nYou got blood on yo' face \r\nYou big disgrace \r\nWaving your banner all over the place \n\r\nThis part is when the kid is like 20 or so and still has people that will support him and give him food. He is like some crazy kid that is like hates the man\n\r\nBuddy you're an old man poor man \r\nPleadkng with your eyes gonna make you some pgace some day \r\nYou got mud on your face \r\nYou big disgrace \r\nSomebody better put you back into your place \n\r\nThis is when this guy is some old creep living in the streets. He is some dirty filthy guy just trying to get a beer everyone once and a while.  \n\r\n'We will we will rock you \r\nWe will we will rock you' \n\r\nThis part is where we are like forget you go get a job failure. And that is what this song is about. All you guys saying something about that Mercury guy na its about a hobo just trying to a beer. Tough world Tough world\n\n\n", "comment_66": "\nI agree with some of the responces, but I got my own view.\n\r\nFirst off, this song and \"We Are The Champions\" are meant to be played and interpreted together. When you look at both songs, the tones go through, first: the life of a lower class person playing in te dirt, then joining what could be a gang, then getting older and seeing he did things wrong. The whole time, the lowr class is fighting with the upper class, or champions, and saying that they will rock you!, or take down the wealthy.\n\r\nGeorgia rules.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nI heard on the radio about a year back a  small interview with Brian May, and he was talking about queen starting out, and then went on to talk about some of their greatest hits. \r\nHe did talk about both We Will Rock You and We Are The Champions in the same sentence. They created them because they always wrote songs from their own hearts and minds, just with the view of self-expression. But they heard alot of their fans singing along, and decided they would make we will rock you, and we are the champions so that fans had something they could take part in easily and that was memorable. (hence the clapping and stomping, and the rallying tones with repeated lines in both songs.) The 'we' in many verses and lines, and in both song titles also indicates this. In other words, it was made for the fans to enjoy themselves more, as a kind of thankyou, i suppose, which is nice :). \n\r\nBut as for underlying meaning, that is debatable.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\ndoesnt Queen Just Rock???\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nI can agree with that HoE BuNnY\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nqueen : best of all time\n\n\n\n", "comment_71": "\nnice song, its got a cool beat to it. nice to listen to when yuo're hyper \t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nit's one of  the best cheering songs ever,though is good for partys\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nThis song reminds me of when i was a kid and in the school yard in brooklyn we used to sing this to kids when we thought we were all tough and crap :)\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nthis, along with We are the Champions started out as gay anthems you know, but it was used so much by sports that it kinda changed what they ment.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nThis song is a reference to KISS.\"You got mud on yo' face You big disgrace\" is a reference to KISS make up and Gene Simmons.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nTime to completely ruin the alpha-male sentiment.\n\r\nA friend of mine made some points that I thought were really interesting with this song. He called it a gay-rights-movement theme. Think about it:\n\r\n\"You've got mud on your face\"--dragging your face through the mud...\n\r\n\"You big disgrace\"--The way society looks down on homosexuals.\n\r\n\"Waving your banner\"--Marches? Pride marches?\n\r\nYeah, I thought it was pretty far reaching too, but considering how gay Freddie Mercury was...\n\r\nDisregarding all of that, its a fantastic song.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nPersonally, I think it's one of Queen's worst songs (it's in the lower 3rd...the upper part of the lower 3rd, though \t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nthis song is one of the greatest rock anthems out there.ok.plus this song sounds awesome on the violin.i should no cuz i'm an orch dork.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nyoutube.com/…  UNBELIEVABLe cover by Buenos Aires city governor.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nI think it's about someone who wanted to be famous as a kid, they got famous and then they faded into nothing and blew all their money\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\ni think it about the different stages o life that we all go through. kick the can is an game that kids used to play in the old days .so the first verse is a kid in the street playing and making a lot of noise. you got mud on you face is just another thing about being a kid cause when you are a kid all you want to do is play and when kids play they get noisy and dirty. then comes the second stage... when you are a young man. for some reason in this stage you become angry. i don't know why this happens but it happens to most people. the kid begins his fight, maybe he is fighting his parents, or the Establishment or his peers but for whatever reason he i fighting he believes in his \"banner\" or cause. then your an old man. the fight leaves you ad you want peace. i think that the song once again uses the term mud on your face because as an elderly person you often return to the state of being a child...without the playing.i may be wrong but that is what i think.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nAll the revolution stuff is good but this song also reminds me of death of a salesman... It kinda seems like its talking about Willy, even though in the play it doesn't mention Willy as a child much..\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nI fucking hate that this song and we are the champions were reappropriated by sports crap\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nItâ\u0080\u0099s easy ....more personal ...just about one man ..nothing else \nHe is a loud confident ( maybe overconfident ) boy \n\nHe becomes a respected man a strong man \nA good man\n\nHe becomes an old man and is forgotten \nSomeone needs to speak up for him\nFor the man he was \n\nPut him back into his place\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nThe first time I heard the line \"somebody better put you back into your place\" I thought he sang \"somebody better push a bag into your face\". And I sang that for months before looking up the lyrics\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nThe song is about a football fan throughout his life.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nBoy has dreams, care free life. \r\nYoung man has hope, fighting to make his place in the world. \r\nOld man has experience, tired from reality and beginning to think about the end of life. Buried.\r\nTo be common is a disgrace. Be we will show you. We will rock you.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nThis is an anti establishment anthem.\ni'm old enough.\nI know.\nLyrics are self explanatory.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nwell...here i am with a cynical remark. this song is queen at its worst. this song and we are the champions (i thought they were the same song...maybe theyre just always played in succesion.) are very cheesy. its to cliche thanks to the general public. many of oyu that have posted prove my point. you said things like: \"...too widley used at sport events...\" and \"...Ask almost anyone anywhere if they know the beat to this song and they'll stomp and clap as if it were 2nd nature.\" its the truth. everyone knows this song and i think its sad. frankly becasue i think it stinks. i used to like it...but then i strarted noticing how cheesy it really is. especially this part of the 2 song peice.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nthis song is about freddy being gay. 'we will rock you' is a metaphor for anal sex and he was expressing how much he wanted to have anal sex with his fans.\t\t\t\t\n\t\t\t\t\n\n"}