{"comment_0": "\nI think that all songs will mean something different to all..you know \"Eye Of the Beholder\" type shit.\r\nThis song talks to me about my mental ilneess of being bipolar.\r\nI feel alot of the rage and being misunderstood as crazy when in fact I am not. The word mental illness gives people a certain image that is just not fuckin'true.There are different degrees of everything.\r\nBeing \"Labeled mentally deranged\" but by who?\r\nI have read alot of these lyrics from day one and with the most recent St Anger song \"Unnamed Feeling\" get the impression that James might be BP also.It lad me to drug abuse to change my moods I didn't like and try and keep people away.\r\nOne problem with BPdisorder is that you \"cycle\" these feelings and moods can't be controlled.There is no cure.  \r\nSo i tcan seem that time stands still at times and no one leaves, it's always there.\r\nI know this isn't a very fuckin' metal explination but believe me I am VERY metal.This is just a song that gives a point of view from someone that has been called mentally ill and is being forced to see that his views on things are wrong.Finally the only way to feel like you can make a point is to kill the fucks that have been holding you down and telling you that you are getting better.\r\nTrust me this disease isn't fun and and the funny thing is the docs  tell me that this music is too negative. Like \"Fade To Black\".. I say bullshit. I feel good knowing that there is someone else that feels alot like I do and has the balls and talent to sing about it. Want more BP lyricss? Read \"Until It Sleeps\" and alot of others and as mentioned \"Unnamed Feeling\". Everyone feels like this jsut some of us have a harder time controling it.\n\r\nNow the funny side of this song is I used to listen to it on my way to work at the factory and it fuckin' fits perfectly there for me too!\r\nBy the way..\"Master Of Puppets\" is THE best thrash metal LP EVER. Bar none. From  \"Battery\" to the last kickyour ass tune \"Damage, Inc\" it just doesn't get ANY better!\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nUh dude, what the hell are you talking about? A man drowns himself, a man slits his throat, someone cuts his nuts off and bleeds to death, they smoke pot, visit prostitues, and someone gets a lobotomy, causing him to have a fate worse than death. Then, the Indian kills him because he knows he wouldn't want to live that way. The Metallica song doesn't do the book justice, and if you haven't read it, go pick it up immedietally, it's a great read.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ni think its about people being thought to be crazy when they're not and its the way that the \"inmates\" are treated\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nIt is about someone who is in a sanitarium. A sanitarium is a mental institution which can be left on a inmate's own will. \n\r\n\"No locked doors - No windows barred\" \r\n\"No things to make my brain seem scared\" \n\n\r\nOn the other hand the 'sanitarium' could also be a simile for the society.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI feel it calls our entire existence the sanitarium. How the general population is controlled and exploited by the government. How those who rebel are made to seem crazy.\n\r\nPeople do not use logic and reason but preconceptions and peer pressure to determine such a thing and it helps them keep us in a bubble.\n\r\nBut the song refuses to give in, with frustration trying to rally the people to wake up and take charge.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nIn my opinion, the Ten Commandments was a soft movie, and one I wouldn;t have thought  would make people scream \"Die! Die!\" as loud as they could, but it happened. Based on the book or movie, I could care less, this song just fucking rocks.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nPartly based on a movie called, \"One Flew Over the Cuckoo's Nest\", it's about breaking down and being kept in a sanitarium.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\n  I belive this about how parents, including mine, had a preconcieved image of what Metallica was.  I belive this song points out that they don't like it.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\ni think its about people being thought to be crazy when they're not and its the way that the \"inmates\" are treated \n\r\nthe movie/play \"one flew over the cuckoo's nest' is about that subject... so king nothing already kinda said that ;-)\n\r\nTo me it's also about feeling that things never change and it'll always be the same (see first couplet)\n\n\n", "comment_9": "\nit does! you fucking fuck! what kinda name is that anyway!? i like bean!? does that mean you like farting too u fucking puff! i fucking hate dicks like you pussy dick boy!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nu know now i am gonna have to hunt u down and rip your little balls off if u have any u cock sucking queer! uniformed peoces of shit like u deserve to be fucking burned to death u hoop smashing faggot.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nGirls Girls Girls. Tampon Time.\n\r\nI'm actually not a rocker, but I LOVE this fucking song. Although I prefer the gloomy depths of industrial/gothic genres, this song is simply a classic to be revelled.\n\r\nI wish more rock bands like Metallica were ever present in this day and age.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nIt is about someone who is in a sanitarium. A sanitarium is a mental institution which can be left on a inmate's own will. \n\r\nthat 'retarded' movie of yours... is about a sanitarium, but one guy is locked up in there\n\r\n\"listen damnit we will win\"  is NOT about leaving the place whenever you want to!\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nOne of the greatest songs ever written about other people's misconceived notions of who YOU are.  This song is an anthem to anybody who has ever wrongly been accused of something.\n\r\n  Metallica has composed their masterpiece with \"Sanitarium\".  The lyrics can be applied to many different circumstances in life, yet the underlying meaning of the song is quite clear.  Far and away the best Metallica song ever, and worth the price of the \"Master Of Puppets\" cd alone.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nOne Flew Over the Cuckoos nest seems a bit too soft of a movie for a Metallica song, doesnt it?.. It would make more sense if the song was about the book, which instead takes the point of view of the indian who only pretends to be deaf and dumb. He does this because he doesn't want to conform with the rest of the institute or anyone else. Makes sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI'm surprised so few people posted about this song. Anyway, bottom line is that this is one of the most quintessential Metallica songs of all time, and every single solo in it fits the mood of the song as best as it seemingly could. The dynamics of the playing also come out very well. One of my favorite songs of all time, without a doubt.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nAnother thing to keep in mind is that, around when this song was written, many of the corrupt mental hospitals (Danvers, in particular), were being shut down, as more and more of the cruel treatments became public. Along with things like hydrotherapy and electroshock, many of the pschiatrists at these hospitals literally gave patients multiple personalities or D.I.D. by making the patients think they had these disorders, which do not naturally occur.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThis is a great song. I really do think it is about a crazy person, not one wrongly accused of being crazy. \"....your dream is my reality....\". \r\nTo me, that means that in a normal person's dream, their's can be as weird as it is. But the crazy person's real life is that weird. He/she imagines all that strange stuff and thinks it's real.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nMy point of view : the song is a confession from a man who lives in a society where he's misunderstood and where if he tries to think against society's will  he becomes a sort of an outcast. They try to send him 'straight' boycotting him blaming him for things that aren't true labeling him 'mentally deranged' . He takes refuge in his own world of dreams \r\n 'Sleep my friend and you will see\r\n  That dream is my reality'\r\nhe wishes the world would be a better place to be.\r\nin his mind he creates a revolution, which is bound to fail . It's a cry for help ,unheard by anyone.\r\n  Also bears some resemblance to 'The Unforgiven'.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI think the song is a metaphor for being insane..\r\n\"Dream the same thing every night, \r\nI see our freedom in my sight\"  I dont see it as being locked up and trying to get out, more as being on the recovery.\r\nSo.. maybe the sanitarium itself plays a part, but what really is his \"cage\" is his own mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\n\"Fear of living on \r\nnatives getting restless now \r\nMutiny in the air \r\ngot some death to do \r\nMirror stares back hard \r\nKill, it's such a friendly word \r\nseems the only way \r\nfor reaching out again\"\n\r\nseems \"he\" preferred his crazy-thoughts :P\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI think some people are interpreting this song a little too figuratively when it should be read more literaly.  People with mental \"issues\" are getting more and more agitated by the conditions in their institution and are on the edge of revolt.  A nice angry theme perfect for a song of this caliber and great lyrics to complement this very excellent song.\n\r\nOf course there are some symbolic parallels you can draw about being repressed by society and all, but the case for symbolism isn't as obvious as in the title track Master of Puppets.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nthis is my favorite song ever.  i can identify with it so much, as i feel i'm locked up in a cage.  metallica63, awesome comment man.  metallica will always fucking rule, and if you don't know, buy the black album.   yeahhhhhhhh!!!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nmetallicat63, I wonder what do the docs recommend u listen to ? Can u find any with better tastes in music? :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\ngreat explanation metallicat63.....very interesting.for me this song has a lot of meanings but for me it fits better this.for me its about feeling everybody hates what you do or what you say without really a reason and you begin to think that there is really something wrong with u.then in the end you just want to kill all those people so you can be alone and safe again.maybe im BP too!!!!\r\nexcuse my peruvian english hope you undertand\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nya are u guys talking bout bipolar disease?\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\ni personally like the idea of it being based somewhat on the book (or movie) one flew over the cookoo's nest, it seems to fit...\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nits about an innocent man who goes insane inside a sanatarium\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nYeah, maybe the Sanitarium makes him insane, insted of vice-versa.\n\r\nBut it's probably about an innocent man inside a Sanitarium, and he's free to leave at will; But he wants to prove himself to them before he leaves but he doesn't realize it's making him crazier.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nWell, i Believe that every songs had a different meaning to every body. and Some songs may have been written purposefully with more then one meaning. I agree wit metallicat63. his explanation makes sense cuz i have a close friend who is BP and she says that how she feels. I also agree wit Visit Romania because thats how i feel.  I personlly don't think it is about one who flew over the cukoo's nest, but i never saw the last 15 to 20 minutes of it so.......\r\nMetallica is the best band ever and this is my favorite Metallica Song, right up there with Astronomy and Both Unforgivens. I don't kare if astronomy was originally done by blue oyster cult or not metallicas version is better.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nOne of the best songs ever written, not just in the 80s or in the genre.  How much does Kirk Hammett kick ass? You know a guitarist is good when he puts a chill down your spine, with a solo. He plays very melodically, and with accuracy, and badassness in the 3rd solo. This is better than the title track, but not as good as Damage, Inc.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI like how you guys are actually talking about the meaning behind this song and not complaining about some insignificant thing that everyone does.  NEWAYS ON TO MY THOUGHTS.  I think this song covers some of the same topics as The Unforgiven.  It's somewhat about society locking us in our cage to be like everyone else i.e. make us mentally well. The thing about no locked doors or bared windows is interesting.  That probably means that it is like a sanitarium where they dont lock us in and we can leave, but ppl are too afraid that they will stand out and look stupid.  Sry if you think im over-analyzing the song.  Good song though, i listen to a radio station in Indianapolis that has something called \"Mandatory Metallica\" where they play three songs by Metallica every night.  They've been doing it for YEARS and the play their older stuff more than they play their newer stuff.  Big plus.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nyeah that is a kinda accurate understanding of the song...i think the song is mainly about society as osmeone earlier said...but the way the bureaucrats attempt to pacify the public the way they see fit, which does not sit well with everyone...don't get me wrong, I am not an anti-establishment crusader, on the contrary, I am completely white-colar, but from a nonconfromists point of view, this song cries out the fact that people in society need different attentions, and that the current (in the 80s) system does not aggree with the narrator's idea.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI agree with realmusiclover/romanchristopher's comments on the song.\n\r\nAfterall, the world is just one big mental institution. Overall it's a comment on society, and how the writer feels within that society.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nWell, since this thread has no common sense, I'll lay some down for all of you.  This is Metallica's 3rd best song, yes it is, don't fucking argue.  Whoever hasn't posted about this song is a fucking idiot.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nlol AEnema yes it is dont argue... This song is awesme but its about someone that feels like his life is being controlled by other people in a mental hostpital (thast what a sanitarium is by the way) so thast what i believe its about\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nIt's a very psychedelic song, connected in some way with a mysteriuos mental state. This song, as many people has written, is about the life an inmate carries in a mental asylum, what he thinks, what he fears, what he sees. This an incredible piece of music.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI think the song might be about how maybe locking crazy people up might not be the best way to help 'cure' them.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nIn my opinion, this is one of Metallica's worst songs\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nwell said metallicat63...well said indeed\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nThis song rules, I used it in my collage media project for a music video (filmed in a real ex-insane asylum), it kind of disturbed all my classmates who did conventional 'pop videos', but I think the song rules, I think its meaning is fairly self explanatory, crazy people should not be abused, crazy people get free, crazy people kill there oppressors, long live the lunatics...\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nThis song can relate to anyone in a situation where they feel restricted. From something as simple as stuck in detention, to something as serious as a prisoner of war or someone actually in a sanitarium. This is a great song, the power in the lyrics is absolutly amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\ni cant remember where i heard it, but i heard that this song was about alcatraz prison and people going insane in there\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nYou think you know?  You'll never know--Metal is stronger than wood.  That is why I built my temple on a base of rock.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nThis song can go both ways. It can be talking about being mentally ill, and litterally being locked in a Sanitarium, or being caged by society. To me, it speaks to me about my expirence in a mental health institution. It was scary as hell. You have NO control, unless you go there voluntarily, and if you would do that, then you really are crazy. You have people who tell you when to wake up, and when you refuse to put up with their bullshit, they put you on another damned drug. You cant go home. Its...one of the most depressing, horrifying things one could ever experience.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nI'm not one for deep meanings of songs and all I get from this fantastic song is description of a horrible sanitarium and good instrumental play. One of my favorite songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nppl...\n\r\n\"James Hetfield: The idea for that song came from the movie \"One Flew Over the Cuckoo's Nest\". \"Fade to Black\" worked well, and we wanted to have another slow, clean picking type of song, this time with a chorus. I had trouble singing that chorus. It's really high, and when I went singing it in the studio, I remember Flemming [Rassmussen] looking at me like, \"You're kidding.\" I said \"Shit, I don't know if I can do this!\" So I ended up singing it lower than I intended, but we put a higher harmony on it and it worked pretty well. The riff for that song was lifted from some other band, who shall remain anonymous. (GuitarWorld issue of '91) \"\n\r\ncheck out :\nencycmet.com/songs/…\n\n\n", "comment_47": "\ni think it has to do with being a war prisoner\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nI have to hand it to metallica, they have some great  lyrics not for a party but just a dark image of something its great.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nIt was a good song until they got to the \"sleep my friend\" part.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nThis song is so cool.  The video kicks fuckin' ass.  5th best Metallica song. It seems to be either about teenage anger towards their parents (if so, there's a lot of metaphor), or it could simply be about crazy people being mistreated and rising up as one to murder the bullying motherfuckers.  Oh, and DarkCandler, WELL SAID.  Nice job using this song instead of all that popular shit.  \n\r\nFUCK pop music.  \r\nFUCK mindless conformity.\r\nMetallica fucking rulez!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nThis song is kickass.  It's probably about people  who aren't really insane trapped in an asylum, with extremely abusive caretakers, then the inmates get together and murder those bullying motherfuckers.  It could also be about teenagers who are angry and frustrated with their parents and society in general, and feel like they're trapped in a place where everyone hates them.  Oh, and DarkCandler, good call with that project you were telling us about.  This is a good song to use for a video project!  I know what you mean when you say it disturbed your classmates.  I brought this album to gym class once, and it freaked everybody out.  I'm not ashamed of it though, I never will be.  People listen to such shitty music these days, they need a wake up call like this song to be taught good music.  \r\nFUCK POP MUSIC\r\nFUCK MINDLESS CONFORMITY\r\nFUCK EVERTHING POPULAR\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nThis song rulez\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nSorry I posted so many times, but the first time I tried, nothing happed, so I tried again and again.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nHow good is James' voice in the first verse???\r\nWhat I love about this song is Kirk shows not only can he play some of the fastest solos in the world, but he can also play some of the nicest, most relaxing lead guitar. He nailed that intro solo.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nThis is THE theme song for the \"mentally ill\" population (larger than you think it is) I should know, i have been diagnosed with more psychological disorders than you can shake a stick at(although who wants to shake a stick at psychological disorders any way! roflmao)\n\r\nshortened list:\r\nautism\r\nschizophrenia\r\nbipolar\r\nadhd\r\nadd\r\nand my presonal favorite:\r\nados or attention defficit-ooh! squirrel!\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nOk people hereâ\u0080\u0099s how it works, the brainwashing flows in this order, government, religious(fanatics), white color(with something to lose), parents, then to the children and the â\u0080\u0098nativesâ\u0080\u0099(subclass). This song might be â\u0080\u0098basedâ\u0080\u0099 on that movie, but it involves much more. It compares the brainwashing techniques(and believe me they exist) of  society to that of a mental hospital. There is a cage that people build for themselves so they can be â\u0080\u0098normalâ\u0080\u0099 where â\u0080\u0098no one leaves and no one will.â\u0080\u0099 But in his dreams he is free, and those dreams have become his reality. So he invites us to sleep, to close our eyes to what weâ\u0080\u0099re told to be, told to see, and made to believe, and thus recreate society.\r\n\tâ\u0080\u0098Build my fear of what's out there and cannot breathe the open airâ\u0080\u0099 could refer to the government scaring the people about whatâ\u0080\u0099s out there (weapons of mass destruction) but doesnâ\u0080\u0099t want us really see for our self. Or how we build our childrenâ\u0080\u0099s fear of the â\u0080\u0098realâ\u0080\u0099 world without letting them see for themselves, unable to love, trust, or truly feel. Sanitarium is a man made often self made cage. A revolt from the norm is the war cry. â\u0080\u0098They see it right, they see it wellâ\u0080\u0099 If left to our own we are surely â\u0080\u0098crazyâ\u0080\u0099 but mass control is saving no one, on the contrary it has enslaved us all. â\u0080\u0098No more can they keep us in Listen, damn it, we will winâ\u0080\u0099\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nThis song gives me memories, when i was like 5 years old my cousin was into metal and all, so one day i searched through all his disks and i came upon master of puppets, i played this song and i just couldnt stop listening to it, then 8 years later i heard this song and i said \"I think ive heard this song before\" i hunted down my cousin and he said that this song was from master of puppets, and i just had a crazy feeling, so this is probably the greatest song of all time for me.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nthis song is probably the ultimate \"inner struggles\" song out there...hell, the live shit version was even better...the strongest song off live shit, i'd say\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nWhenever i listen to this song, i feel like it was written specifically for me... i read the book \"One flew over the cuckoos nest\" and it really added a lot to the song.  i'd recommend to anyone to read the book, because it's really good.  I can't get enough of this song, because that's exactly how i feel so much of the time.  METAL UP YOUR ASS!\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nWhenever i listen to this song, i feel like it was written specifically for me... i read the book \"One flew over the cuckoos nest\" and it really added a lot to the song.  i'd recommend to anyone to read the book, because it's really good.  I can't get enough of this song, because that's exactly how i feel so much of the time.  METAL UP YOUR ASS!\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nThe ending of Welcome Home has one of the most metal grooves! Maybe Sandman is more \"groovey\" but hey. SANITARIUM KICKS ASS!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nwelcome home (sanittaruim) is defenetly about being insane. its a master piece, the whole album is\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\none of metallicas best songs.  i think its about being in some kind of metal prison (whether physically or mentally) and thinking about how normal you think you are.  in my opinion, you could take any normal, sane person, lock him up and eventually anyone would go crazy.  this song shows the horrors of being judged and \"labeled mentally deranged\" my favorite line is \"keep him tied- it makes him well. hes getting better, cant you tell?\" oooh that always brings chills to me when i hear it. anyway kick ass song by metallica. master of puppets is THE GREATEST thrash album EVER :) rock on\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\noh and to metallicaman9999: dude thats so cool that you heard that song when you were five. i would give ANYTHING to have listened to master of puppets album at that young of an age\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nOmg you people are dumb and before speaking should listen to what Jaymz the writer of the song said it was about for christ sakes everyone who said the song is based off one who flew over the Cuckoo's nest is right.so if you said that you can speak because you actually listen but ppl like I like beans I was listening to this befor you were even allowed to listen to metallica I seen them at waldorf october 18th 1982 I have seen this band over 100 times live I have met Jaymz Hetfield on multiple ocassions along with the rest of the band including Cliff Burton in 1984.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nhey, don't know if it was already mentioned. has anyone thougt of seeing \"sanatarium\" as a metaphor for the whole world with its sometimes crazy society? even if it wasn't hetfields meaning, why not? for me it would make sense...\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nI've changed my mind about this song.  This has officially replaced Master Of Puppets as my favorite Metallica song and favorite song of all time.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nThis song is played at the beginning of Paradise Lost: The Child Murders at Robin Hood Hills.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nCouldn't it be about rehab? I mean I've been through rehab before and it does a great job describing the experience I had during my time there. \r\n\"Whisper things into my brain\r\nassuring me that I'm insane\" \r\nThat's exactly what they do in rehab. they think that your some insane monster.\r\nThat's just the meaning it has to me. besides that great song and one of the greatest albums ever. hands down.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nNice one! Awsome guitarplaying!\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\ni believe that this song talks about anyone who is deprived in any way of the life he should lead and its a call to take back what is rightfully his.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nfor a start i love this song. i think it is awesome obviously one of their best. I always have it with me on my ipod or my phone.\r\nI think it basically describes what goes on in sanitariums\n\r\nlines like\r\n\"No locked doors, No windows barred\r\nNo things to make my brain seem scarred\"\r\n\"Whisper things into my brain\r\nassuring me that I'm insane\"\r\n\"Keep him tied, it makes him well\r\nhe's getting better, can't you tell?\"\n\r\nthat is exactly what happens in an asylum trust me i have first hand experience.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nits really plain to see they are talking about someone in an asylum \n\r\nif you have ever been to a mental hospital for 6 months and had nothing wrong with you and your parents just leave you there and talk to the doctors about you while hiding everything from you and just keeping you locked up while you just want to be left alone you want out of there more than anything it drives you insane.. the song is right on the money as far as cannot breathe the open air and dreaming about freedom and everything they say its hell in those places pure hell \r\nthe only thing you can think about is going home or escaping but they tell you that you are unstable they dont even care you just want them to leave you alone and eventually you will explode on them JUST LEAVE ME ALONE!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nThis song is even more relevent in modern times, where many thousands more are being drugged EVERY YEAR, and countless others committed, no small proportion because of drug side effects and withdrawal. Yet psychiatrists continue to bury their heads up their rear ends and blame the underlying disorder. Sure, guys. Sure, 25% of the population needs to be taking drugs. Sure, we're all defective. It's time we say enough is ENOUGH! Give objective evidence instead of vague pseudo-answers, or go away. Even then, that doesn't excuse violating peoples' basic human rights to 'treat them', especially in an inhuman environment.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\ni love the lyrics here\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nheard the bfmv cover of this song?\n\r\ni think the outro there is better, with the faster tempo and all.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nI don't know if some one has already said this but oh well...\n\r\nThis song is about how Metallica felt about how prisoners in mental institutions. How people just lock em up (They keep me locked up in this cage can't they see it's why my brain says Rage), and leave them to try to work out their own problems (Keep him tied, it makes him well he's getting better, can't you tell? :and: They see it right, they see it well but they think this saves us from our hell) Does that make sense? Yes it does.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\n2 me this iz about feeling trapped because everyone lookz at you az if you are a peice of shit or crazy just because your different, and you just want 2 be left alone\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nI think that sanitarium could be used as an idea or state of mind to describe how someone could be locked up inside and cant realease what is locked up beCause of the judgemental peopple around trying to brainwash him.\n\r\nbut One Flew Over the Cuckoo's Nest has sumpn ta do with it (just trying not to sound like a dushbag)\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nFirst off, for all of those of you who don't believe so, this son WAS inspired by \"One Flew Over The Cuckoo's Nest\" because I read an interview with Kirk and James in Guitar World Magazine that said so. Secondly, I think this song is just about someone who is locked up in a Sanitarium and wants to break free but can't. The part that says \"No locked doors, no windows barred, no things to make my brain seem scarred...\" means that he's locked up in the Sanitarium, but they make it seem like they are not prisoners there by not having locks on the doors, or barred-windows, they just don't let them leave. They do this sometimes for mental patients and it makes them seem like nothing is wrong with them, so they don't feel like imprisoned or insecure\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nTHIS SONG REMINDS ME ALOT ABOUT A HORROR MOVIE FILMED IN WAVERLT HILLS SANITORIUM.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nSORRY, I MISSPELLED WAVERLY.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\ni wrote a creepy poem based on this song, this song also reminds me alot about the horror movie, death tunnel, and the place it was filmed in{waverly hills sanitorium}.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nOne Flew Over the Cuckoo's Nest was a BOOK before it turned into that movie! For you Metallica fans, they happen to base several of their songs on literary works of art, such as \"For Whom the Bell Tolls.\"\n\r\nRead a goddamn book!\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nAlle har forskjellige drÃ\u0083Â¸mmer, tanker og planer for fremtiden. Noen vil bli veltrente modeller, andre hÃ\u0083Â¸yutdannede leger. \r\nI modell, sang og skuespiller bransjen er det mindre sjans for Ã\u0083Â¥ lykkes og tjene til palass en i medisinens verden. \r\nDet er naturlighvis ikke like ''glamourÃ\u0083Â¸st'' Ã\u0083Â¥ vÃ\u0083Â¦re lege eller noe annet som krever lang utdanning, men det er som oftes de som lykkes best og tjener mye.\r\nJeg sier ikke at du tjener lite pÃ\u0083Â¥ Ã\u0083Â¥ vÃ\u0083Â¦re modell, men der er det vanskelig Ã\u0083Â¥ nÃ\u0083Â¥ helt til toppen.\r\nHusk ogsÃ\u0083Â¥ at det er de med lengst utdanning som er smartes og best til Ã\u0083Â¥ hÃ\u0083Â¥ndtere forskjellige ting. \r\nOgsÃ\u0083Â¥ kan du jo alltids bli en sÃ\u0083Â¥kaldt ''golddigger''. Da gÃ\u0083Â¥r jobben din rett og slett ut pÃ\u0083Â¥ Ã\u0083Â¥ pynte deg, flÃ\u0083Â¸rte, gifte deg med en mann med penger(mye penger), og vips ; du er rik!Dette mÃ\u0083Â¥ jo vÃ\u0083Â¦re ganske sÃ\u0083Â¥ overfladisk, Ã\u0083Â¥ bare leve pÃ\u0083Â¥ mannens inntekt. Det Ã\u0083Â¥ ikke ha noe Ã\u0083Â¥ jobbe med hverdagen, vil bli ganske sÃ\u0083Â¥ kjedelig i lengden. \r\nNoe jeg selv har erfart da de to siste ukene av sommerferien gjennstÃ\u0083Â¥r, er man ganske sÃ\u0083Â¥ lei av Ã\u0083Â¥ bare henge rund, og Ã\u0083Â¸nsker seg gjerne tilbake til skolen. \r\nMen la oss ikke hoppe av temaet her. \n\r\nDu bestemmer selfÃ\u0083Â¸lgelig helt selv hva du vil bli og hvordan. \r\nMen de vil senere angre de som ikke gjennomfÃ\u0083Â¸rte vidregÃ\u0083Â¥ende, eller tok en videre utdanning. \r\nFor det er jo ikke sÃ\u0083Â¥ gÃ\u0083Â¸y Ã\u0083Â¥ ende opp i kassen pÃ\u0083Â¥ rema 1000, siden du rett og slett ikke gadd Ã\u0083Â¥ gjÃ\u0083Â¸re leksene dine. \r\nDu vil vel ikke bli den som sitter og taster inn matvarene, da dine gamle og velsuksessede klassekamerater punger ut med pengene.\r\nDet er viktig Ã\u0083Â¥ legge grunnlaget, helt fra barneskolen av. Og pÃ\u0083Â¥ ungsomsskolen er sÃ\u0083Â¦rlig det siste Ã\u0083Â¥ret viktig, for Ã\u0083Â¥ fÃ\u0083Â¥ gode nok karakterer til Ã\u0083Â¥ velge akkurat den veien du vil gÃ\u0083Â¥, uten at karakterene stopper deg. Det Ã\u0083Â¥ velge en linje kan vÃ\u0083Â¦re litt vanskelig, for vanlighvis vet man ikke helt hva man vil for fremtiden. \r\nDa er det selfÃ\u0083Â¸lgelig best Ã\u0083Â¥ gÃ\u0083Â¥ almen, slik at du fÃ\u0083Â¥r alle fagene. En ting er det at hvis du for eksempel liker Ã\u0083Â¥ drive med musikk, men ikke fÃ\u0083Â¸ler det vil bli noe du kan leve av. SÃ\u0083Â¥ gÃ\u0083Â¥ musikklinjen, da vell.  Det gÃ\u0083Â¥r fint ant Ã\u0083Â¥ bli f.eks politimann eller sekretÃ\u0083Â¦r etter det, hvis du bare studerer videre. \r\nOg da kan du jo alltids senere, nÃ\u0083Â¥r du f.eks jobber natteskiftet pÃ\u0083Â¥ bakerhuset, ta frem gitaren og satse pÃ\u0083Â¥ musikken, hvis du har en lite krevende jobb. \r\nDet er prÃ\u0083Â¸ver Ã\u0083Â¥ si er at hvis du har en drÃ\u0083Â¸m, sÃ\u0083Â¥ sats pÃ\u0083Â¥ den. Ikke gi slipp, du fÃ\u0083Â¥r ingenting til hvis du ikke prÃ\u0083Â¸ver. Ikke gi deg, ikke gi fra deg drÃ\u0083Â¸mmen din, og ikke la noen ta den.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nthis songs all about being kept in a mental house when youre not insane and being locked up for so long drives you to the point where you are and when everyones telling you youre insane, you believe you are(whisper things into my brain, insuring me that im insane) the titles badass to \t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nI always thought that this song was about a whole bunch of mentally insane people wreaking havoc on a place after they were all mistreated by the sanitarium there....\r\nIt might be just me, but it seems as though Hetfield in the entire master of puppets album is singing from the eyes of the superior pov (as compared to ride the lightning, where, outside of creeping death, he is singing from the inferior pov), such as in battery, master of puppets, disposable heros, and the list goes on....\r\nI could be wrong though.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nI think this song is about people who dream \"the dream is my reality\" but people keep them locked up or keep them from going after there dreams 'They keep me locked up in this cage\" and they don't like being locked up. They just want to go off and see if they can get there dream. \n\r\nThis (I feel) is like alot of the house hold problems are about now a days. A kid wants to be a wrighter or guitar player or whatever and the Dad wants the kid to play football or follow in his foot steps. I'm not saying all dad's are like this mom's do it to just dad's make it more known! \t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nI believe the song is about someone who has gone insane by his own life.  He believes that we are all crippled by the limits of reality.  He realizes what an outcast he is in society and takes notice of how everyone calls him crazy.  But to him, they're the insane.  Eventually, he is drawn to homicidal thoughts, believing that he is doing the world right by \"freeing\" the others of their limits of the real world, thus preparing to kill by the end of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nwhen i heard the song i thought it was being in an insane asylum and everyone rising up to escape\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nIt's about how being locked in a mental asylum can make the insane go even more insane.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nMETALLICA'S AWESOME!!!!!!!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nMETALLICA'S AWESOME!!!!!!!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nI conceive the lyrics slightly on James' issues with his relationships with his family, His father didn't really care and his mother died of cancer (he blamed Christianity for his mom's faith, see god that failed for more.) His parents were extremely religious and did not approve of \"Rock music\" and when James started his band, they freaked and then later his issues with his mother poured onto his plate and encouraged his alcoholism. The supposed \"Insanity\" he preaches throughout the song seems to be about the effects of Alcoholism: Short fuse, Apathy, and mood swings..so on so forth  ( First verse the frozen image you get explains the apathy part and the mood swings in the choruses.) And The Second verse explains the therapy sessions he takes and the restrictions of activities and sessions that seem to last forever to him frustrate him to no end and he thinks they don't know what they're doing and they don't get him. Then in the pre-chorus leading to the  second chorus explains that they start to get it but they don't know how to really fix it. And the final verse: about the natives are his friends and possibly the media, pressuring him and the mirror part seems to be about looking at himself and hating himself for what he is but he still denies that he has an issue and just has an urge to kill everything around him and getting away from it all (most of this information is from the metallica histories on their site and Wikipedia.)\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nThis song from metallica decribes a lot of the shit i believe about the mind control prison system in which we live. Listen to what he says, its all mental thinking not a physical sanitarium you would first think. The system has you until people wake up and realize what it is so we can fight it. Open your eyes the world is not what it seems.\n\r\nHe is describing when you dream the world is so at peace and it just feels right, not like the awake world were your under constant control and mind manipulation. This is his peace ful dream world which is the right world. no influence just free mind dreaming. you mind cannot escape this system until you dream or fight it\r\n'' Welcome to where time stands still , No one leaves and no one will\r\nNo locked doors, no windows barred , No things to make my brain seem scarred'' .\n\r\nThis describes the matrix system and what it does to you.\r\n'' They keep me locked up in this cage\r\nCan't they see it's why my brain says â\u0080\u009crageâ\u0080\u009d\n\r\n'' sanitarium, leave me be ,Sanitarium, just leave me alone ''\n\r\nThis describes what the government does to you and how they control you with fear and propaganda. Thing is they make people like me who understand them out to be crazy ,all because we are the real threat to them just like the always have.\r\n'' Build my fear of what's out there, Cannot breathe the open air\r\nWhisper things into my brain, Assuring me that I'm insane\r\nThey think our heads are in their hands, But violent use brings violent plans ''\n\r\nThis describes the inner locked down voice that screams lets fight back and stop them controlling us and thinking they know better.\r\n'' No more can they keep us in, Listen, damn it, we will win\r\nThey see it right, they see it well, But they think this saves us from our hell \t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nThis song is a ballad told in the eyes of someone in an insane asylum, or sanitorium, hence the name \"sanitarium\". About a man who plans on taking over and breaking out \"Mutiny in the air\". btw Awesome solo, awesome song altogether\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nThe song is about a sane person who becomes locked in an insane asylum, and is made insane overtime by the doctors who constantly re-enforce the message that he is insane.The treatment backfires when protagonist loses his sanity and is convinced he must kill everyone.\n\r\nA lot of people have mentioned the film One flew over the cuckoos nest, a film i have not seen. However i'd like to mention the possible connections to Stanley Kubricks A Clockwork Orange and Peter Weirs The Truman Show. Both this song and the films are about a protagonist whose mental illness is produced by the failure of the societies that imprison them, ultimately result the protagonists to defy their rules of their society through drastic measures such as murder,suicide or escape.\n\r\nAs with metallica63, this song struck a personal chord with me. As a young child, my parents became concerned about the slow pace of my development, in contrast to my siblings. The doctors, teachers, and occupational therapists they spoke to said that i was intellectually disabled, and advised that i be sent to\r\na school where i would be placed in a support class.Everyday my class followed a  routine that involved doing mainly kindergarten things  such as dancing to kids songs and watching preschooler shows. However it hit the fan about two years later in 1999, when i realized that the routine given to the whole class was not going to change and each year we would only be taught at kindergarten levels. Soon I realised my older brother,who was at a different school, was actually learning more advanced things .As the repetition of the aforementioned routines became more apparent i gradually changed from being a happy sociable person, to a frequently upset hypochondriac who would sometimes behave violently if things didn't go my way. Eventually it climaxed when my parents realized that the advice the sought out was incorrect and I was transferred to my brothers school, without an apology or an explanation from my folks and consequently I did not know this until many years later. \n\r\nWhen i did find out, it was in an especially painful period of my life where i was trying to cope with the fact that the relationship between me and one of my few and closest friends was broken. My friend said that the reasoning that i was overly obsessed with video games at the time. At this time, I pretty much had zero support and i did not say anything to my parents about what i was going through. During this period though, my parents at one point had to clean out their cupboards and i stumbled upon a folder containing my medical records which included several letters from the doctors who provided my diagnosis. These letters mentioned that i had displayed symptoms of autism such as obsessionality which i immediately linked to my alledged obsession with video games. The impact of these letters left me devestated. Within a handful of minutes I had been told the following things\n\r\na. Why i spent several years in a dreadful school environment\r\nb. That i was born with an intellectual disability that my parents never told me about.\n\r\nand due to a lack of understanding at the time, i had the impression that\r\nc. My friend had left me because an external factor was interfering with the functionality of my brain and was stopping me from being myself. \n\r\nPoint C was particularly important to me as i spent several years wishing i had known about the diagnosis earlier so my friend would understand my obsessionality. Consequently i lived in denial about my hobbies believing they were the result of the autism and not me being me. \n\r\nEventually in recent years, i began bringing up my past in several conversations to my parents who explained that the doctors had mis-diagnosed me as being intellectually disabled and are trying re-enforce the message that im doing well in school. I doubt that though as I'm now considering leaving school, because i wish to avoid a repeat of the emotional traumas I've experienced. My friend came back into contact with me and confessed that he was a jerk at the time. We're now best friends. \n\r\nIf any one of you have managed to read this far into my post, you're probably wondering what the point of it is. I'll say it now. The point I wish to make is that judging from my personal experiences, the song Welcome Home (Santarium) performed by James Hetfield, Kirk Hammett, Lars Ulrich and of course the late and sorely missed Cliff Burton, provides the warning that a mis-diagnosis and the related treatments can have a serious effect on the lives of patients especially in regards to their sense of self. The effects can be serious enough to nearly break ones sense of identity, causing their behavior to go hay wire, before they spend the rest of their lives dealing in its aftermath.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n", "comment_98": "\nI was in a mental hospital few months ago and this song keep playing in my head. All the words make perfect sense\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nI think lines like \"dream the same dream every night\" and \"fear of living on\" suggest the person is a guy in an asylum with some kind Of disorder. It also seems to deal with how he is treated as a patient.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nWell, I relate to this song, too. growing up with a family member that is close to you that is like 98% gifted and being the idiot of the family (Having my father thourougly convinced Im Mentally ill, hell flip out on me for no reason and shout \"YOU HAVE A MENTAL PROBLEM!\" or \"YOURE A HEADCASE!\" and thats where the \"Sanitarium, Leave me be....\" part ties in for me)And the second verse describes how i'm determined to show the world that I am worth something too, (The  \"Listen,Damnit, We will win\" Part)and the last part, the \"mirror stares back Hard.....\" Suits how in the end i always think: \"Who am I kidding? I'll never be good enough\" The thoughts of giving up. It is an excellent song. I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nReminds me of One Flew Over the Cuckoos Nest. Good movie! A little further in depth though, I think this is about someones normalcy to themselves but labeled and judged differently by others. The rage of being told that their mentally deranged when they themselves dont feel different at all is stifling. \t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nI've always thought this song to be about a person who is wrongly held in a mental asylum and tries to convince others that he's not mental, and trying to get away, but then he just seems more crazier to them... But I'm most likely wrong. Everyone has their own interpretation!\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nI believe this song is about a man with some sort of incurable illness who seeks help in a sanitarium. He was thrown out of society for acting in such a strange manner. In the beginning he enjoys his stay. He can do almost anything he wants there. The longer he stays at the place, the worse his illness gets. He wants to leave but he has become so unconsciously dependent on this place he doesn't. He later goes insane and thinks that the people there are mistreating him. He becomes so crazy he decides the only way to truly leave he must kill himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nThe people that have unjustly targeted people as unforgiven and bully them making them believe they are mentally ill trying to submit them into suicide will never win cause you can't hold a good person down. \t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nLove this song â\u009d¤\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nwell this song is basicaly the more badass, master of puppets version of ride the lightning.\nits very to the point.\nit is about a guy who is mentally ill and is put in a sanitarium. but he hates it there. he thinks its a prison with no bars.\n\"no locked doors no windows barred, no things to make my brain seem scarred\"\nhe is commenting on how its a wolf in sheeps clothing. it looks nice but it is just like prison.\nhe continues to say how he wants out.\n\"i dream my freedom every night\"\nbut his dream came true in the worst form possible. its the sanitarium he resides in.\nalso, the whole time he is talking to someone. hes telling this \"freind\" to just let it show him the horror of the sanitarium. so he tells him to leave him alone and get some sleep.\nhe comes back tomorrow and the man tells us more.\n\"build fear of whats out there, cannot breathe the open air.\"\nthis is about how the sanitarium treats the victims. it crushes their hopes with fear of the world and how it will be worse.\n\"whisper things into my brain, assuring me that im insane\"\nmore on how the sanitarium treats the victims\n\"They think our heads are in their hands but violent use brings violent plans\"\nthe man talks on how the torture and pain of the sanitarium fills him with plans of leaving and escaping.\n\" keep him tied it makes him well, hes getting better cant you tell?\"\nthis is a tidbit not from the man, but from the nurses.\nthis is how the nurses talk to one another about the paitents.( i will explain later)\n\"No more can they keep us in listen, damn it, we will win\"\nthis is the man on his plans of escape. and how he will bring others to safety. away from the sanitarium.\n\"they see right, they see well, they think it saves us from our hell\"\nmore on how oblivious the nurses are to the pain\n\"Fear of living on\nNatives getting restless now\nMutiny in the air\nGot some death to do\nMirror stares back hard\nKill, itâ\u0080\u0099s such a friendly word\nSeems the only way\nFor reaching out again\"\nand this is the saddest part. this section details his escape and how he out of fear murders someone.\nand thats what this song is about. how sanitariums dont ever help. they are worse than prison. they torture the victims and they rarely know better than to stop them because of their condition. and the sad part is this isnt really getting better.\nand im sure it wont for a while.\nplease avoid putting your loved ones in homes. they suck.\nmy mother is a licensed psychologist and she hates sanitariums and homes.\neverything from the nurses to the enviornment is absolute shit.\nand thats what this song\"s story is.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nOk I am a big metallica fun and I came up with this little story based on the titles of metallica songs. the titles are in capital letters.\n\n\r\nI park my 2*4 and step out, home at last but Iâ\u0080\u0099m in a FRANTC state thinking about my narrow ESCAPE. I get into the house and I drink some of my WHISKEY in a JAR but that doesnâ\u0080\u0099t ease the pain clearly caused by the THORN WITHIN. At this point even i know the only solutions to deal with the STRUGGLE WITHIN. In the SMALL HOURS of the morning I stare into the dark night and see ORION, but now is not the time to think about ASTRONOMY the pain is too much it feels like I'm TRAPPED UNDER ICE yet I cant seem to convince myself that its my fault, betrayed by who i thought was a friend and betrayed by THE JUDAS KISS now I go towards my bed in this old rugged house, how am I supposed to sleep in THE HOUSE THAT JACK BUILT after I shot him between the eyes and left him STONE DEAD FOREVER and at that point it felt like NOTHING ELSE MATTERS. I close my eyes and try to sleep hoping it will all just FADE to BLACK but THE MEMORY REMAINS clear to me that I will always be UNFORGIVEN and it worries me because the things i just did make me wonder AM I EVIL. This cant be I was raised right how did I turn to this BAD SEED I know what I did was wrong but I canâ\u0080\u0099t feel it, itâ\u0080\u0099s like I am on ANESTHESIA.\n\r\nI had lost my mind when I decided it was KILLING TIME, I ran around taking them all out high on drugs I believed I was the INVISIBLE KID and the opponents I took out one by one where DISPOSABLE HEROES. I canâ\u0080\u0099t sleep so I stay up looking at the DIRTY WINDOW and start to think maybe its time I DISAPPEAR because right now I am CREEPING DEATH at any point the cops and feds will be all over looking for me. For so long I looked forward to exerting my revenge but that day seemed to be THE DAY THAT NEVER COMES nothing hurts more than taking the life of your BROTHERS IN ARMS. The pain was too much yet still I feel like the HERO OF THE DAY and I decided not to think about what others thought of me after all to the one who I was revenging I would always be the perfect PRINCE CHARMING her LOVERMAN as was the case when she lived and everyone else called me KING NOTHING. As my nerves began to calm I remember what MAMA SAID about salvation forgiveness trusting in God and THE FOUR HORSEMEN but I will not pray to THE GOD THAT FAILED seeing as he let my loved one die she truly was MY FRIEND OF MISERY so I decide to live the rest of my life with NO REMORSE.\n\r\nKnowing my fate as I step into the bathroom that bottle of CYANIDE seems appealing but I will not give up I will FIGHT FIRE WITH FIRE. Arrested I find myself locked in a SANATARIUM because the cops couldnâ\u0080\u0099t believe any normal person could do what I did. The DEVILS DANCE is what they called it and maybe this is where I would spend the rest of my days on THE FRAYED ENDS OF SANITY. A brilliant mind I donâ\u0080\u0099t deserve to be here but what i did deserves to be punished and that is SAD BUT TRUE. At this rate I donâ\u0080\u0099t think even a priest can PURIFY my soul. I think of to myself POOR TWISTED ME but I decide to not have self pity because when it comes to who killed those men I will always be the ONE. From a motherâ\u0080\u0099s boy RONNIE went on to become a killer and sometimes I would think SO WHAT right until the judge decided i would RIDE the LIGHTENING. I know I am SOME KIND of MONSTER but do I really deserve to die. The judge is not letting me off easy as he proclaims THAT WAS JUST YOUR LIFE and now youâ\u0080\u0099ve reached THE END OF THE LINE. Alone in my cell I think it seems I have become THE OUTLAW TORN thinking about SUICIDE AND REDEMPTION what to do I cant let them kill me oh the STRUGGLE WITHIN talk about THE THING THAT SHOULD NOT BE. After a nights sleep I think maybe its fine after all TO LIVE IS TO DIE what is this THE UNNAMED FEELING maybe its time to TURN THE PAGE. \t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nby the way...the song has NOTHING to do with any retarded movie\t\t\t\t\n\t\t\t\t\n\n"}