{"comment_0": "\nI think this one is pretty straightforward, but it is such a good song that I just discovered recently, so just wanted to share my thoughts on it.\n\nSongs can have so much meaning that can be unique to an individual. A song can bring you back so vividly to a time in your life when you were really into that song. They say that smell is the strongest sense tied to memories, but the sound of a particular song is probably a close second.\n\nThis song is clearly about a guy after a break up where he is not over her, he wants her back and can't stop thinking about her, and he is wondering about what songs she is listening to now, because he wants to know what state of mind she is in now? Is she like him now, and listening to sad songs wishing they were back together? Or is she partying and having fun, forgetting about him? Or worse, is she listening to a love song and thinking about someone else?\n\nGreat song, great lyrics, clearly a gifted song writer.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nSuch a great tune. The song starts where the guy puts on a record and listens to a song that he and his old girlfriend used to listen to together. That he listens to it on repeat is the first indicator that he's not over this girl. He hasn't been able to let his feelings for her go. It also lets the listener know that listening to music together  was an aspect of their relationship. And it implies that the meaning of the song they listened to described their relationship.\n\nBut they're no longer together and so he's wondering what song(s) she's listening to now. He doesn't know where she lives or what she's doing these days but he knows, or at least believes, that whatever song(s) she's listening to would give him an indication of where she's at emotionally. And he wishes he knew.\n\nThe sentiment in this song is somewhat similar to Bob Dylan's \"Girl From The North Country\" where Dylan is pining for his old girlfriend whom he's not seen for many years and is wondering if she still remembers him, if she still looks the same.\t\t\t\t\n\t\t\t\t\n\n"}