{"comment_0": "\nA very good production by Mariah And Whitney. A duet very well composed and emotional. The song tells of miracles. Which mankind has forgotten over the years. We ask how could Atlantis be so advanced in technology? Because of MIracles! Once again, a very good song! Gotta listen to it ;) Believe people. Believe and you will achieve! :D \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nive loved this song ever since i saw the movie prince of egypt\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nVery beautiful this song\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\ni like it\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nPrince of Egypt, all the songs in it is good - especially this one\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song is very beautifully represented by Mariah and Whitney. It basically means that when your at your lowest when you feel like you should just give up, if you believe you can make it through the rough times. Its a great song, with great lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nOne of the few Mariah songs i can actually sing with. (why does her voice have to be so damn high?)\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\ndwddwdw\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI liked to hear them both together, they are wonderful in their own way, I wish I was older back then to fully understand English.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nok. Is there actually black people replying to this song. I'm not trying to be rude. But Mariah only appealled to a lot of caucasion people when she had that song shake it off and we belong together. honestly. it sounds true enough\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nyay\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nit's obvisously about the Jews and how they had to go through a lot of pain and suffering, but how they still managed to keep their hope alive, by reminding themselves and each other, that all you have to do is believe, have faith, and that they would be saved, a miracle would come to them...and it did.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nAn awesome duet!!! I am so glad they sung this together!!! The two best voices in the world, in my opinion!!! (well I personally prefer mariah's voice, but I definitely adore whitney's voice!!!) this is such a beautiful song, it is so hopeful. Fantastic!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI've always loved this song, but I had no idea that this song was biblical until I watched the prince of egypt (again, I've watched it when I was younger, but being so young, I don't remember), which I didn't know was biblical either. The song's about how the Jewish (known as hebrews then) slaves wanted to be free from the Egyptians rule, and how it took awhile. They just had to believe, and their prayers were 'delivered'. It's a very uplifting and inspiring song, and it has a new meaning to me now that I know it's biblical.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nWhen I was in 4th grade\r\nAt the school talent show\r\nEverybody was singing\r\nthis song. I think half the\r\nnight was listening to this\r\nsong, just over and over\r\nand it strangely never got\r\nold. It's so pretty.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nwith the Prince of Egypt movie i really liked how they had this song right after Ramses son died, but from Moses's point of view. it shows that he still cares about the man he once called brother, and it was his one low point once the Hebrews were freed.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\ni know most people don't post lyrics as comments, but i can't figure out the artist, and the song is from the same movie.\r\n     The Plagues\r\n[Chorus]\n\r\nThus saith the Lord:\r\nSince you refuse to free my people\r\nAll through the land of Egypt...\r\nI send a pestilence and plague\r\nInto your house, into your bed\r\nInto your streams, into your streets\r\nInto your drink, into your bread\r\nUpon your cattle, on your sheep\r\nUpon your oxen in your field\r\nInto your dreams, into your sleep\r\nUntil you break, until you yield\r\nI send the swarm, I send the horde\r\nThus saith the Lord\r\n[Moses]\n\r\nOnce I called you brother\r\nOnce I thought the chance\r\nto make you laugh\r\nWas all I ever wanted...\r\n(Chorus)\n\r\nI send the thunder from the sky\r\nI send the fire raining down\r\n[Moses]\n\r\nAnd even now I wish that God \r\nhad chose another\r\nServing as your foe on his behalf\r\nIs the last thing that I wanted...\r\n[Chorus]\n\r\nI send a hail of burning ice\r\nOn ev'ry field, on ev'ry town\r\n[Moses]\n\r\nThis was my home\r\nAll this pain and devastation\r\nHow it tortures me inside\r\nAll the innocent who suffer\r\nFrom your stubbornness and pride...\r\n[Chorus]\n\r\nI send the locusts on a wind\r\nSuch as the world has never seen\r\nOn ev'ry leaf, on ev'ry stalk \r\nUntil there's nothing left of green\r\nI send my scourge, I send my sword\r\nThus saith the Lord!\r\n[Moses]\n\r\nYou who I called brother\r\nWhy must you call down another blow?\r\n[Chorus]\n\r\nI send my scourge, I send my sword\r\n[Moses]\n\r\nLet my people go\r\n[Moses and Chorus]\n\r\nThus saith the Lord\r\n[Rameses]\n\r\nYou who I called brother\r\nHow could you have come to hate me so?\r\nIs this what you wanted?\r\n[Chorus]\n\r\nI send the swarm, I send the horde...\r\n[Rameses]\n\r\nThen let my heart be hardened \r\nAnd never mind how high the cost may grow\r\nThis will still be so:\r\nI will never let your people go...\r\n[Chorus]\n\r\nThus saith the Lord:\r\n[Moses]\n\r\nThus saith the Lord:\r\n[Rameses]\n\r\nI will not...\r\n[Moses, Rameses, and Chorus]\n\r\nLet your (my) people go!\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI just realize how atheist this song is\n\r\nWith no proof anyone could hear = there is no God\t\t\t\t\n\t\t\t\t\n\n"}