{"comment_0": "\nthis is a love song in its purest form. just so beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\ni love your point k_3_l....i really recognise my self in your explanasion of the song\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nfor me, the song is about two people who share something way special that not everyone can have... unfortunately, they have to keep things mellow for some important reasons or they reached the point wherein they cant be together anymore. but despite the gap or the changes, one of them tells the other that he/she was thankful for him/her because he/she was able to know or find his/her true self and that he/she changed him/her into a better person. he/she reassures him/her that whatever happens, he/she would be there no matter what... =? \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nright on k3l i couldnt exactly explain it and you've got it..its like they cant go on together, but they will alwz be there when they need them\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nthis song means so much to me. it seems like the 2 ppl in the song are having a delema cause they are to far away to be with each other. but when they ever need the other 1 2 be there, they will. i think this is suck a romantic song and it shows how much the 2 ppl in the song love each other.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI love this song...it is so soft and sweet.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nTHIS SONG IS THE BEST LOVE SONG TO ME. I like the duet version of this song is better(with Brian Mcknight). But either way this song is very beautiful lyrically, and mariah(like always) knows how to make her emotions fit her voice.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI see this as two people in love, and one is going away, but they will always be there and love each other still even if they can't be together.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\n:'( memories.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\na beautiful and incredible song!!!!!!!! wow. I love both versions - with and without brian mcknight!!! her and brian sound awesome together!!! perfect voices!!! This is a very special song, very moving and emotional, its amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI notice on here that the only Mariah songs that get many replies and get the \"deep meaningful and I relate to it\" crap are the Butterfly tracks.\n\r\nI hate to tell you all, but you've been brainwashed. Butterfly is depressing and overrated.\t\t\t\t\n\t\t\t\t\n\n"}