{"comment_0": "\nThis is a beautiful song. I love it a lot. He is the ONLY, and yes, ONLY rapper I will listen to. Because,\n\r\n(a) His songs have meaning. They're not about sex and cars and bling blingin' rims.\r\n(b) He has talent. He can actually rap. I don't think d12 is any good. =/\n\r\nAnyway. I love this song and I'm getting his new CD right now... hehe.\r\n-Sarah\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI cant believe this song actually makes me cry, I dont know why.\r\nJust the way some words are sung really hits something deep down inside of me. I feel so sorry for him.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nEminem has said publicly that he feels incredibly guilty that he hasn't been there for several important events in Hailie's life. He almost missed her first day of school because he was in rehab recently.\n\r\nI believe he's saying that he is effectively \"killing\" Slim Shady because while Slim Shady made him famous and rich, now he wants that part of him to die so he can go back to being Marshall Mathers, father.\n\r\nAwesome song and lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nPersonally, i dont think eminem is retireing.  I think hes gonna be like all the older artists and take a break from singing for a while so he can watch hailie grow up.  Then hes going to come back and bite all our asses with a kickass song! lol\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nWhat I get out of the song is that he's killing only Slim Shady, the part of him that started all of the controversies and created all the problems. If and when he breaks out another album, I think it will probably be all serious-set songs. I personally always liked the more serious songs. He'll be back.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI also want to congradulate Eminem on making a really great song. This is the only song that has ever made me cry!\r\n\"I walk right up to Kim and kiss her\r\nTell her I miss her\r\nHailie just smiles and winks at her little sister\"\n\r\nDoes this mean Marshall is getting back with Kim? If he is, I hope Kim does'nt break his heart again, that would be fucked up.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nIt's nice to see he can still put out decent records, after the horror of his 'Encore' album.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI think that this song shows how busy Eminem is, and how Hailie's more grown up now as his Eminem's past songs about Hailie she was only a very young child or a baby..\r\nThis also shows the \"life\" from Hailie's point of view too. I reckon that's cool. \r\nYeh, I think this song is really great.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nOnce again,another awesome song by eminem. They just don't stop coming.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis is one of Slim's most sentimental and heartfelt songs. I am so happy for him that he actually got back with Kim.  After listening to the LP album, I never would have seen that coming in a 1000 years.  I love the metaphor, and how he kills himself and goes into a heaven with Hailie and Kim.  This song is destined to be a classic.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis song is fantastic on so many levels -- there is real depth in the emotions that he is expressing. Eminem says he would \"give an arm\" for his daughter, and then castigates himself for abusing her mother, \"who's the spittin image of her\". While trying to give Hailie the life he never had, he deprives her of time with her father, becoming \"the main source of her pain\". In his nightmare, Haillie tells him it's too late, \"go out there and show [the fans] that you love em more than us\", i.e. that he's been lavishing the love that he should've been reserving for his family on his fans.  He symbolically suicides his Slim Shady persona, and awakens to a better life, with Kim and Haillie and Laney.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\ni absolutely love this song. But i don't think he's gone forever. he's gunna sit back and be the dad he hasn't had the time to be.....for now anyway. then when hailie's older and we're all least expecting em's gunna come back and kick us all in the ass with a fuckin bangin song...outta nowhere. mind you, this is one of the few rappers i constantly listen to....i'm more into alternative and punk-rock....so yeah...but i love eminem more than any music i listen to. this seriously has to be one of his best songs...\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis song is one of only a few I like by eminem, I do believe that he will be retiring. Even if he doesn't come back, he has made enough of an image to be remembered. \n\r\nThis song was great, the lines are the most powerful I've ever heard in a rap. It makes you realise that although he is hardened to the world, he can be sensitive. I think he doesn't necessarily want to quit his rap career. I think he wants to kill the image that he has created...\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\ni think what is going on in this song is that Eminem feels like he's been giving more love to his fans than to his own family.  So, he's telling us what he told them,\r\n \"And when I'm gone \r\n  Just carry on \r\n  Don't mourn, rejoice everytime you hear the sound of my voice\"\r\nThis is a kind of goodbye to his fans.  he's telling us to carry on and just be glad to hear his music when it comes because he's not gonna push himself anymore to write and tour constanly but he's going to do so when it comes to him.\r\npersonally, I believe the quality of his music will only improve if he makes this move.  No forced songs, just the naturally passionate music that makes him great.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nomg what is UP with the censors on the radio edits? they censor every other word! its like todays kids can't cope with guns and pills - i mean, come on. there are 5 year olds whose parents let them watch autopsy... i think they can cope with some guns and pills. and even with the censors it's pretty obvious what he's saying, i got the jist of it. amazing song, though, when i bought it and listened without the censors it made me cry\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI love this song god its brilliant its a touching rap song... who'd a thunkit well i love this song i will only listen to eminem and im a guy who  thinks rap is crap i hate it all around but lately im falling in love with eminems new songs cause they have meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nthis song is the best song by eminem. i dont like some of his other stupid songs but this really touched me. i cried. it sounded like his heart was breaking. he wants to be there for his daughter more, his career has taken up too much of his time.\n\r\nthis was such a great song.\n\r\nand im happy for eminem if he decides to stop singing and dedicate himself more to family values. he doesnt need to be entertaining kids all his life when he has a daughter growing up and that needs him.\n\r\nxoxo\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nbefore this song i thought eminem was just another moody wankster but now i know hes not all bad and the line\"help mommy her wrists are bleedin\" is so extreme coming from an 8-10 year olds mouth haly is livin in a really messed world even though i cant relate to it i still get what the song is bout.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nEminem is like a different person when he raps abut his daughter. It is like he loves her so much, but he and Kim have got to the point they can't stop doing things to hurt her, and then they hurt Hailie as well. He hates himself for hurting Hailie, because he would die for her, but he can't seem to stop doing those things.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI just adore this song, i adore Eminem.\r\nHe's the only rapper i can listen to, same reasons as someone's already said.He actually gives meaning in his songs and.. it's strange because you can really get a picture of what he's all about as a person.x\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThis song makes me cry.  The video's pretty sad as well... It's pretty obvious that it's about his guilt, but at the same time, I think it's about leaving something meaningful for his daughter.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nHAS ANYONE NOTICED THE VIOLENCE!!\r\nYeah, look they all get shot, or threaten, I believe Eminem is going thru the whole mid-life crisis, but for him its not a crisis, its more like a new lease on life... He's looked back, all his songs were about miserable things or using the excuse of drugs to get out of it, I feel altho hes done something either wrong or seen the light, Yet like 2 weeks after the song was released maybe less than he went back to kim and hes married again, I think hes a great guy, hes looking back and changing what he did wrong... I think this song is completely directed at his listeners, \"And when I'm gone\r\nJust carry on\" hes trying to say that this is the end, and ive made my mark, and i maybe back but if not, tough, Im going to back to my family, Hayley needs me, and His wif does to, why would she be depressed? Its either than or hes killing his Alta ego, coz in this song he calls himself marshal, and Eminem, if you look at it Me in me. Or i could be that hes killng his alta ego to go back to the way he was before he became famous! Good on him! Hes a great guy!\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nwow I think this is my favorite of his songs.  I think he's basicaly saying that Hailies growing up and she isn't gonna always keep forgiving him for not being there.  Pretty soon she's gonna understand everything and shes probly gonna be angry too.  I almost cried when I first heard this, I like it even better than Mockingbird.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nEminem is so deep, many people under-estimate the meanings meant by him.  Despite his \"absurd,\" to some people, lyrics, some sogns such as this one have a sweet and loving meaning and itention on his part.  He is telling his daughtoer that yes, he has made mistakes, but he loves her more than anything.  He wants the best for her and he wants her to know that her Daddy is always there for her.  He is a soldier and loves her.  I love the lyrics to this song.  They are sweet, genuine, and I honestly believe this is one of the many sides of Eminem- sincere and heart-felt.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nGod, this song is incredible, as are all the songs Eminem's made that focus on his relationship with his daughter.  It's obvious he loves his daughter more than anything else in the world, and although he's had some problems, he wants to be there for her as much as possible.  I almost cry every time I listen to this, it's so moving.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI think that perhaps eminem maybe finally giving a hint to the roumers about his retirement, in this song.\n\r\n\"I turn around, find a gun on the ground\r\nCock it, put it to my brain\r\nScream Die Shady!, and pop it\"\n\r\nThis part particularly makes me think he might be laying down his carrer as Slim Shady, possibly to concentrate more on being a record producer and father..\n\r\nEminem is obviously also saying how guilty he feels for not being there for Hailie , and not allowing her to have a proper \"Mother and Father\"..\n\r\nOnce again another fantastic song by Eminem!\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nthis is probably 1 of eminem best song....love it\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nThis song is just fantastic.\n\r\nI was a bit worried with the quality of the second half of encore, but he has restored my faith with another brilliant song.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\n^^^ Great song by the way!\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\n\"That's Slim Shady, yeah baby Slim Shady's crazy\r\nShady made me\r\nBut tonight, Shady's rock-a-bye baby\"\n\r\nIn this one, I think it especially hints either retiring or a looooooong break of music. Personally, I think the break or him being retired would do him and his family good. I do feel sad I won't be able to hear more songs if he retires, but it would be good for him cause then there would be less stress on him, and he could have a more normal life and relationship.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI only know of a few rappers who are almost or as good as Eminem.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI only know of a few rappers who are almost or as good as Eminem.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nGreat song. Now that em is back wit kim i think he is gona sit back for a while and the just cum out wit a song so gud it wil remind everyone that he is the greatest. I think he will be apearing much more on other rappers albums such as Obie, G-unit etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nThere are several laughable mistakes in the lyric transcrip abovet.\n\r\n\"But baby wasn't sweetin\r\nHow did you get this sweetin?\"\n\r\nshould be\n\r\n\"But baby we're in Sweden.\r\nHow did you get to Sweden?\"\n\r\n(Keep in mind the scene takes place at a concert...)\r\n------\n\r\n\"You rap about\r\nYeah word ke-keep it real\"\n\r\nshould be\n\r\n\"You rap about\r\nYeah word, kid keep it real\"\n\r\nAs for the meaning of the song, I love it. And I traditionally haven't even really enjoyed Eminem's music.  But this song is self indictment of both his admittedly hubristic career and how he put too much weight on his career and in the process failed as a father.\n\r\nGood stuff. Great rhythm to the lyrics too.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nThe day Curtain Call came out, Eminem did a special on all of his music videos with VH1, and he said that this song was the death of Slim Shady. Maybe not necissarily Eminem's retirement, but Slim Shady is gone. Depressing yes, and I too think that he is hinting towards his own retirement. and I feel sadened by this fact, but his should always worry about his family than complete strangers. He may retire, but I dont think that he is completely gone from us in his musical career, just not as devoted. But who can blame him, he just wants to have a healthy family for once.\n\r\nR.I.P. Slim\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nGuyz... he not retireing....  noticve how he sayz \"baby\" in the chorus which iz tellen everyone he is retireing....  well y wud he call everyone baby.  hes obviously talkin to hailie.  hes saying  \"when hes at a concert, dont worry I'll be back\"  \n\n\r\nAnyone want to aregue wit me?!?! huh huh?!  BRING IT!!\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nUhh... you're wrong.  Come on dude, \"Curtain Call?\" Releasing what is essentially  a Greatest Hits CD?  These are all indicative of him calling it quits to creating albums.  As most people are saying, I think he'll strictly produce CDs now, similar to how Dre's career went.  \n\r\nI think it's a graceful ending to an otherwise mostly dick and fart joke career.  Don't get me wrong, I like a slew of his songs but... christ. I've about had it with his self-created controversies.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nNone of this song is addressed to Hailie.  It's all addressed to you, the fan.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nThere is too, there is \"Hailies Song\" and \"Mockingbird\" so nah.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nIMO, eminem is just saying that he doesn't like who he is when he is 'slim shady'.  I very well doubt he is retiring, and hope he isn't.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\n\"by xoDonnieDarko on 12-06-2005 @ 08:26:09 PM  \r\nThis is a beautiful song. I love it a lot. He is the ONLY, and yes, ONLY rapper I will listen to. Because,\n\r\n(a) His songs have meaning. They're not about sex and cars and bling blingin' rims.\r\n(b) He has talent. He can actually rap. I don't think d12 is any good. =\\\"\n\r\nI agree with that comment 100% Eminem is the ONLY rapper I will listen to cuz his songs have meaning and he has talent.(Other than the songs about killing Kim and His own mother)...\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nwell.. just to clear this up: eminem is retiring. he said so. he is going to produce another artists. and yes he and kim are back together.\r\nbut i think he will be back with another cd in some years...i think he wants to completly retire..but he will not resist and he will come back like in 5 or 7 years...dont know...\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nwell.. just to clear this up: eminem is retiring. he said so. he is going to produce another artists. and yes he and kim are back together.\r\nbut i think he will be back with another cd in some years...i think he wants to completly retire..but he will not resist and he will come back like in 5 or 7 years...dont know...\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nreally hope he will b back...\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nOK... so maybe hes retireing....  its probly bcuz he wants to have a strong comeback.  Like backstreet boys tried to do... btu no1 likes them so it didnt work out lol. all i can say is c ya slimmy\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nWat happened with Kim in the first place? Did she f' up or was it eminem? Is she hot? Where can I get a decent pic?\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nActually he's not retireing. He's taking a break to help out other rappers and get their songs on the radio. When and If he ever retires HE's gonna announce it himself. He put out cutain call and wrote this song to explain to his fans why he would be taking a break. Because he feels that he isn't spending enough time with his family. He said all this and more on \"The Cutain Call Hits\" on Vh1 where he explained what he was thinking when he wrote all the songs and what they mean. And he is back with Kim, He said they might remarry.\n\r\nJust acouple changes:\n\r\n\"I give you one underdog, and you gotta swing by yourself\"\r\n-It really is \"I'll give you one underdog, then you gotta swing by yourself\"\n\r\nInstead of: \"I get this point\", \"Fine, me and mommy are goin\"\r\nits really: \"I get the point, Fine me and mommy are going\"\n\r\nand \"You rap about\r\nYeah word, kid keep it real\"\r\nIt's really: \"You rap about it, Yeah word, K-keep it real\" k-keep its like the records scratching or something.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI think the chorus could have two meanings...\r\n1) It could be addressed to his fans. When he's gone, everytime you hear one of his songs, be happy that he made it.\r\n2) It is to Haile, when she hears his songs or sees him on T.V., smile because he loves her and he will be home soon.\r\n(Most likely #2)\n\r\n\"And when I'm gone\r\nJust carry on\r\nDon't mourn, rejoice everytime you hear the sound of my voice\r\nJust know that\r\nI'm lookin down on you smilin\r\nAnd I didn't feel a thing\r\nSo baby, don't feel no pain\r\nJust smile back\"\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nthis song in many ways is like saying to his family that hes not gonna be here and sings about his whole life and how  he lied to hallie and how she felt upset when hes not there with her and her mom like the lyrics \" when I'm gone \"\r\n\"Just carry on\"\r\n\"Don't mourn, rejoice everytime you hear the sound of my voice\"\n\r\nand hearing songs like that you can tell that his life is very complicated with his family. But apart from that I also think the lyrics to this song is the best alongside \"mockingbird, cleaning out my close, lose yourself and toy soldiers.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nSorry about the \"But baby wasn't sweetin, how did you get this sweetin\" I couldn't understand what the hell he was saying, so just said what it sounded closest to. Whoever fixed that, thanks. About the \"Yeah word ke-keep it real\" I had vs. the \"kid keep it real\" that someone edited, I dunno. I still think it's ke-keep it real, but whatever\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nthis song shows the death of slim shady...i seen it on an interview with him\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI know many people before me have said the same thing that I am going to say, but I want to say it too.\n\r\nEmienm and Marshall Mathers are still going to rap. Slim Shady is not. If you have listened to Eminem for a while you know that he has different styles of rapping. Slim Shady is the rap about his mom and wife and killing them both. They didn't cause problems because of the lyrics, but because he was always bus writing and on tour he didn't see hte touble he was causing his daughter. He is now realizng that and he is taing a break. He is back with Kim and they are getting married really soon. He has adopted Kim's daughter from another marriage and Eminem is getting his life back on track before he raps. He has said many times efore he would give it up for his daughter and right now he is.\n\r\nThis song is my favorite ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nActually, he adopted Kim's niece\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\ni agree w/ LakersWiz; this song isn't about saying 'good bye' to eminem, it's about him saying 'good bye' to slim shady and taking a break from it all to spend time w/ his family.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nThis line makes it obvious:\r\nCock it, put it to my brain\r\nScream Die Shady!, and pop it\r\nSlim Shady is dead. And he's taking a break from music for a while to focus on the more important things, like his family. I'm almost certain he'll be make a comeback eventually. At least I hope he does. He's the only rapper worth listening to.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI think this is a great song.\r\nHe's trying to express his feelings about his whole carreer which took him away from his daughter....and stuff.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nI have Eminem's biggest fan since the get-go, but for christ sake, yet another song about Hailie and Kim. Change the record Marshall.\r\nI stood with him through Encore - even though he sold out his principles of making good music by being incredibly lax and lazy - but now Im bored.\n\r\nI agree with an earlier post - Eminem knows full well its getting tiresome, but he has know idea how to evolve into a different sort of artist.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nI have Eminem's biggest fan since the get-go, but for christ sake, yet another song about Hailie and Kim. Change the record Marshall.\r\nI stood with him through Encore - even though he sold out his principles of making good music by being incredibly lax and lazy - but now Im bored.\n\r\nI agree with an earlier post - Eminem knows full well its getting tiresome, but he has know idea how to evolve into a different sort of artist.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\neminem: sell out.\n\r\nselling his wedding photos to Hello magazine is the final straw.\n\r\nHe has officially fell off. The end. give us back your ghetto pass.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nhow amazing is this song?\r\ni agree with donnie darko he's really the best rapper in the whole world\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nhe's really the best rapper in the whole world\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nEminem always shows his hate for his mom and kim in his Shady style. I'm not convinced any of the stuff he raps about is real, I think he just was trying to make it in the business and it made for an intriguing story. Throughout his cds, Em basically raps about his whole life, which is really ingenius if you think about it, would people listen to a song about your 'life?'\r\nAs soon as the cd was released he announced that he got back with Kim. When I'm Gone is saying good bye to Slim Shady, and he's sorry to both Kim and Hailey for the trouble he caused. As many of you know that the rap industry has a lot of murders and the lyrics to the song \"And I didn't feel a thing so baby, don't feel no pain\" I think he wrote this in case he was ever murdered, his family would know that he was died peacefully and quickly. Now I'm not saying thats the reason, just if he ever was assassinated you could go back to this song.\n\r\nAnother thing was that he saw the hate he had for Kim in his songs, but noticed the essential love of his life (Hailey) was turning into a \"spitting image of her\" and I think he maybe thought it was time to made ammends with Kim.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nJust know that\r\nI'm lookin down on you smilin\r\nAnd I didn't feel a thing\r\nSo baby, don't feel no pain\r\nJust smile back\n\r\nthat part makes me think of my dad. \n\r\ni love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nthis song i would have to say is 1 of the best songs eminem has done accept for run rabbit run...but this song is really tuching it means alot to me and when im down i put it on becuase it takes all the wain away\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nfirst of all this is an A W E S O M E song i like the fact that he had hailie a part of this video that just shows how busy Em is with family & work tryin' to work things out for both he's not nearly close to retiring quite yet he's gonna drop a few more records before that happens i love this song much luv ur #1 tiff\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\ngreat. nothing but. great closing point - now everyone will remember him for the amazing rapper that he is.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nBy the way, if the only rapper you listen to is Eminem, you are definitely a white person who has no understanding of hip-hop/rap. Thank you for your patience. Now I'll cut to the chase. In my opinion, Eminem is probably one of the most overrated rappers of all time, seriously. But then again, so is everyone else who has even a small amount of talent in this gangsta rap wasteland. (Jay-Z, Tupac, and B.I.G) So naturally, since Em is more talented than most rappers, becomes big. (And it actually helps that he's white, because he's gained quite a following with cultureless caucasians, whether he likes it or not.) But this doesn't mean he can't have a few good songs. Well this is one of them. This is one of the few rap songs out there that really reflects the artist's soul, with its beats, lyrics, and energy. This, Slim Shady, and Lose Yourself are the only good Eminem songs out there. The others don't live up to those. \n\r\nOh, and by the way if you want to hear hip-hop/rap with ACTUAL meaning to it, you might want to listen to Gorillaz (Dirty Harry, Feel Good Inc., Clint Eastwood, etc.), Will Smith (First Rap Grammy, nuff said'[get Lost & Found]), or Kanye West (Diamonds From Sierra Leone Remix w/ Jay-Z, Jesus Walks, Hey Mama) who have stronger messages and lots of great songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nshut up you eminem haters...eminem talks about real things..i'm soo sorry that he doesn't sing/rap about ur posh lifstlye like other artists..i don't really care what you guys think but keep your little comments to yourself.. if you lived where i lived and you constanly said $hit bot eminem you would get beat..so shut up!!!!!  this song is like the best song in my opinion.. if you think differently then good for you...\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nThis is sort of about how Eminem can't seem to decide who he loves more, his family or his fans.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nWalterbennet this is 4 u. Its  not Ke-keep it real or kid-keep it real. its K-keep it real as rap basement states it Honestly it does say sweden can you honestly not read. I stuck this song on here and being a huge eminem fan myself i am damm sure i know what the words are and wouldnt put the wrong lyrics up. As 4 u i suggest u look up some sites that have lyrics on it and study them. But all tht aside i love this song i hope he doesnt retire 4 too long and i think it is a break well deserved thanks Em.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\neminem CAN rap. and EMINEM has a talent.\r\nfirst white-boy rapin'\r\ngo m&m!\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nAll Hail Eminem.....\r\n I really love this song,as it makes you feel like Eminem is in tears and giving his testimony.I really loved the way he could fit in a 2 person perspective.\r\n  Now that he has broken up with Kim AGAIN, i dont know what song hes gonna sing after this.This song was released few days proir to their patch up.And ya, i really fo believe that a child plays such an important role in binding relationships between couples. If hailey was this old when they first broke up,things wouldnt go ugly and they would have eventually patched up parmanently for sure.\r\n  And his plan for killin Marshal Mathers is the right thing for him to do.But on the other hand, it is Marshal  Mathers that earned him money to get Hailey on full custody.i guess he shoiuld just go Dr.Dre way, raise new stars and chillaxe@home with famileeeeee\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nI don't know, but I think this song is a bit fake. I used to be a big eminem fan, but then he started incorporating too much of his personal life into his songs. I'm not saying he should be lile everyone else and sing about bling and crap, but his whole conflict with his mother is getting a bit old. \r\nAnd now in this song he's trying to make us pity him. An annoying part is how he has these whole dialogs with his daughter. it just sounds weird when he is saying \"daddy i followed you to sweden\"\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\ngreat song\r\n+\r\nhot singer\r\n+\r\nawesome music video.\r\n=\r\neminem - when im gone :)\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\ni love eminem! this song actually made me cry the 1st time i heard it... :/\r\nthis is 1 of the songs with a deeper meaning, which is good.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nI love this song!!!!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nThis song is the end of Marshalls alter ego!\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nthis song makes me cry every time i hear it.\r\ni wish my father was like that.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nThis was the song played at my best friends funeral. What more can I say? It means alot to me and whenever I hear the line \r\n'How could it be that the curtian is closing on me'\r\nI think of when we where in the crematorium and the red curtain fell over his coffin. \r\nRIP Damen... \t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nthis song is very parallel to my life, not all ems songs i can realte 2 but i feel that this 1 is real life and i feel what he is feelin, Literally.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nTo me it means that he wants to 'kill' shady... his rapper half\n\r\n\"I turn around, find a gun on the ground\r\nCock it, put it to my brain\r\nScream Die Shady!, and pop it\"\n\r\nand that he wants to be there more for Hailie and Kim... though considering... anywho yeah my meanings is that he's saying good bye to his 'alter ego'\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\neminem is awsome... i listened to httis sont bout a hundered tiems in a row. i know it by heart and im always singing it\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nThat's what they want\r\nThey want you, Marshall\r\nThey keep screamin your name\r\nIt's no wonder you can't go to sleep\r\nJust take another pill\r\nYeah I bet you you will!\n\r\ni think right here he is showing that he cant sleep because he cant stand the people yelling for him to come out so he takes pills to get through it\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nOne of my really goodgood friends had cancer and sum1 had started a rumor that his cancer had came back but this was all false and there was this 1 girl that heard this song after she heard that rumor (she thought it had cum  bck) and she tought that the chorus was my friend \"talking\" to her because they all tought he was going 2 die\r\nso now when ever i her this song i think of him and when we work together  i always put this song on and say \"its Robbie's song\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nThis is one of the only songs that has actually made me cry. \r\nand that's saying a lot, media never really makes me cry. \r\nI love his serious songs more than his fun ones, just because the words get to you and make you start thinking.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nHey guys, i was reading a mag, and apparently eminem is due 2 bring out an album middle of nxt year, hopefully hes not retiring too soon\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nthis song is absolutely beautiful... i love it so much \t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nI think this song is a kind of goodbye from Marshall, because he's kind of leaving the rapping business now to focus on becoming a dad and producer. It's also a kind of autobiography, leading up to the point now where he's realised that this alter ego he's created, \"Slim Shady\" has ruined his life and he's changing it for good: \"Scream DIE SHADY and pop it\"\r\nThat's my opinion, goodbye to the old Mr Mathers.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nem' isn't going to retire, i positive he's just takin' a break and kimn 12-11-2005 is full of crap, the songs barely has a thing to do with the fans\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nthe start of the song \"Have you ever loved someone so much\r\nYou'd give an arm for\r\nNot the expression, no\r\nLiterally give an arm for\r\nWhen they know they're your heart\r\nAnd you know you are their armor\r\nAnd you will destroy anyone who would try to harm her\r\nBut what happens when karma\r\nTurns right around and bites you\r\nAnd everything you stand for turns on you to spite you\r\nWhat happens when you become the main source of her pain\" puts how i feel about my best mate. i love her shes awesome and i dunno what id do if i lost her. i know ive dont plenty of wrong to her and ive been so afraid of losing her that ive cried over and over again. but its blown over now we gud again. i love this song so much it can make me cry to me it has so much heart and emotion put into it and i really feel that comming cross to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nI think this song mean that Marshall is laying down his carrer as Slim Shady and is gonna try to focus on being a producer and father to Halie. Its a shame that hes stopping he is and forever will be the best rapper ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\ni think tnat eminem wrote this song because he wanted to show that he loves hayle and how fast  kids go from baby to teenager\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nhe wants to kill his old self \"slimshady.\" hes embarassed of the things he use to do and how he wasnt around when his family was growing up \t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\neminem is also preparing halie for his death, and telling her not to feel any pain when he is gone because he would probably do it with pills which is painless \t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nWhat harley101 said makes sense.\n\r\n\"And when I'm gone\r\nJust carry on\r\nDon't mourn, rejoice everytime you hear the sound of my voice\r\nJust know that\r\nI'm lookin down on you smilin\r\nAnd I didn't feel a thing\r\nSo baby, don't feel no pain\r\nJust smile back \"\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nIt's a song for his daughter to listen to when he's dead.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nAmazing song, but I sort of think he exploits hes daughter, but an amazing song none the less\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nI turn around, find a gun on the ground\r\nCock it, put it to my brain\r\nScream Die Shady!, and pop it\r\nThe sky darkens\r\nMy life flashes\r\nThis is Eminem killing his alter ego Slim Shady. Thats why he says Die Shady and not Die Marshal. He sees his life flashing before him and realizes that he would have died if it wasn't for him leaving and going home early. He finally realizes after all those years of missing out on Hailies life that, that is were he was suppose to be the whole time not on stage but with his family.\n\r\nThis whole song is for his daughter not his fans. He loves his daughter and this is like his message that will forever be known by everyone. Not just his daughter. He is telling the world that he is and will stay a changed man even if it means giving up on his career as a rapper.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nThroughout this song Eminem tells us how hard his life is as a parent and a singer. Eminem starts the song by directly describing the way his life is, and how he truly feels about it. The theme is about how the love of a dad hasnâ\u0080\u0099t truly been found, and is needed. Eminem doesnâ\u0080\u0099t enjoy leaving Hailie to go perform, but instead he wants her to understand his departures. Eminem isnâ\u0080\u0099t the best father, and isnâ\u0080\u0099t always there for Hailie but he truly does love her. In a many different lines he has stated how he would do anything for Hailie including give his life for her. \n\r\nIn verse 2 Eminem describes everything that is going on with his daughter. Hailie says:\r\n                  â\u0080\u009cYouâ\u0080\u0099re making Mommy cry, why? Why is Mommy crying?â\u0080\u009d\r\n\t\tBaby, Daddy ainâ\u0080\u0099t leaving no more, â\u0080\u009cDaddy youâ\u0080\u0099re lying\r\n\t\tYou always say that, you always say this is the last time \r\n\t\tBut you ainâ\u0080\u0099t leaving no more, Daddy your mineâ\u0080\u009d\r\n                  Sheâ\u0080\u0099s piling boxes in front of the door trying to block it\r\n                  â\u0080\u009cDaddy please, Daddy donâ\u0080\u0099t leave, Daddy no â\u0080\u0094 stop it!â\u0080\u009d\n\r\nThis scene describes how much Hailie hates when her dad leaves, and shows how desperately she was trying to convince him to stay with her. According to the line â\u0080\u009cYou always say that, you always say this is the last timeâ\u0080\u009d, this wasnâ\u0080\u0099t the first time that Eminem had left her. Eminem tried convincing Hailie that he was going to come back to make her feel better but she had already noticed his lies. All Hailie wanted was to spend time with her dad! Even though Eminem wanted to be both things, a singer and a good father for her. It was a hard decision for him. \n\n\n", "comment_99": "\nomg i can alwayus relate to this song and i lov eminem\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nthe way it should make everybody feel is to know that when you r gone your family should rejoice and know that you live whatever life you wanted to live so that's how this song makes me feel happy knowing i lived the best life i could peace\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nthis song allways makes me cry fave eminem song ever such a meaningfull song ever just love it and eminem such a wonderfull artist\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nIt means that his family doesn't want him to leave again, like when he goes on tour, and his daughter knew that he was lying when he said he wouldn't leave.  It also means that he loves his family, but he keeps leaving to perform and it hurts them.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nI remember the first time I actually really listened to this song. It was in the end of 2011, around school time and one weekend my parents and I decided to go out and buy some paint for my room; blue paint. We were in the car on a sunday, and I was listening to music on my phone, and this song came up. For some reason, I was feeling kind of down. The words, and the actual music; it's just like bliss. Even though I see my Dad every day, and I live with both of my parents, and I know that this song has a obvious meaning but to me, I see it like this. It could be about any person preparing their loved ones, or friends for when they leave. Either for a short moment, or forever. It's like Eminem been through every single feeling that I ever felt. When I just want to be alone, he always understands.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nI love the irony.  This song itself clearly took time to write, time Eminem could've spent with his kids.  But the point is that he chose to write the song instead.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nI think the setting the beginning of the song is a suicide prevention class where he's telling why he needs help and why he came to the classes. It's also supported when he says \"find a gun on the ground cock it put it to my brain scream die shady and pop it\" and \"the plane I'm supposed to be on crashs and burns to ashes\" showing his suicidal thoughts. I believe the reason he's thinking these thoughts is either Kim got a devorce and took the kids with her which is supported by hailie saying \"fine me and mommy are leaving\" or Kim killed herself as supported by hailie saying \"HELP MOMMYS WRISTS ARE BLEEDING\" and \"earlier in the song she says \"why why is mommy crying\" and \"your making mommy sad\". \t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nthis is a great song because everyone can relate to the first verse. everybody has someone who they love so much that they would take a bullet for and has hurt in the past.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nIt's a shame Em's career is fading.  He knows it, he has nothing else to say.  He needs to reinvent himself, and he has no idea how.  What a waste.\t\t\t\t\n\t\t\t\t\n\n"}