{"comment_0": "\nThe lyrics to this song seem so genuine and real, that's why I love Bruno. He sings with passion and feeling in all his songs, especially this...\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nA guy that fucked up and realizes afterwards that he didn't do the best he could.\n\r\n\"My pride, my ego, my needs, and my selfish ways\r\nCaused a good strong woman like you to walk out my life\r\nNow I never, never get to clean up the mess I made, oh\r\nAnd it haunts me every time I close my eyes\" \n\r\nOh and Bruno Mars' voice is perfect.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI dedicate this song to my ex.   He should have realized this before life was too late for him.   Have fun in lock up!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nWhen I was your Man is a song heartbreak, regret and confusion. Of many broken hearts and troubled songs from Indonesia and other, I always see if the song is teach to move on or not.\r\nAnd this song teach to move on and sincere, seen clearly in the last lyrics of this song. Great music and lyric, Bang Bruno :)\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nTotally connect with this song when looking back on relationships when I was younger.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nhe pretty much explains it all no hidden meanings. its so truthful, after my latest relationship this is how i was looking back now. the one relationship i regret ending and this just makes me want to curl up and die in a corner and go back in time and to change that moment. I know that is the one i was such a prick in but oh god i am not like that anymore thank God for that.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\n\"Now my baby's dancing\nBut she's dancing with another man\"\ngreat line ...\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nIt's interesting that, rather than wanting revenge, Bruno wants the best for the girl who left him.  Even though she's gone, he still loves her, enough to want her to be with somebody who will treat her well.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nBruno sings this brilliantly, it is a lovely song about a man realizing what an idiot he has been for losing an amazing girl.\nIt reminds me of 'You were always on my mind' by Willie Nelson bt made famous by Elvis.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nLovely song with very thoughtful words and sung brilliantly by Bruno Mars.\nAnyone who has lost someone because of not appreciating what they had would understand this song.\t\t\t\t\n\t\t\t\t\n\n"}