{"comment_0": "\nHe lusted after her from the first moment. She was pure, free and full of vitality. Her virginial state was as much of an allure as her beauty. But from the moment they lay together, that part of her was gone.\r\nOn the second day, he's already realised that the previous day, when they were together, is never going to be surpassed. Anything alse will seem cheap next to that. She'll get older, her innocence is fading, they will argue etc. So he invites her down to the river.\r\nThen, to preserve her integrity and his memories, he slays her on the third day.\r\nThat's why all beauty must die - if you've achieved perfection, what is left to live for?\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI think the chorus on this song is really interesting, it seems like she's too naive to realise that newspapers give murder victims sensationalist headline names (ie. \"the wild rose\") and genuinely can't understand why they don't use her real name.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ngreat song. just MAGNIFICENT. especially the third verses, when she starts off saying \"on the third day\", and he starts it with \"on the last day\". they both have thier sides of the story which makes this song perfect.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nVocal performances are great, and the last few stanzas are lovely and disconcerting. Which is the great thing about Nick Cave - he begins the song having the listener think it's a mushy ballad with lyrics straight from a romance novel (\"From the first day I saw her I knew she was the one,\" \"My trembling subsided in his sure embrace\") and it ends with him killing her. Genius!\n\r\nIf I had to be critical, I would say that the chorus could have been changed. I understand he's going for a \"Gaelic tale\" effect here, but it sounds so awkward and redundant.\n\r\nI love that \"wind light as a thief\" line. That is such an unexpected simile, I think.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI get a ominous feel about this song. The music and the way it's performed is just so beautiful but the lyrics are absolutely terrifying. Is there anyone who knows if there's a tale, myth or true story behind the lyrics. Also I think the \"the wind light as a thief \" is a reference to him beeing about to steel her life. I really like that the ending is kind of given away already in the second line: \"... was Elisa Day\"\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\noh this is a sad song, makes me feel sad.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ni'm not sure about necrophelia, it never actually mentions what happens after the murder. to me this song's about a man (a deeply disturbed one at that), who feels a desire to destroy something beautiful. he find's the most beautiful girl he can (\"more beautiful than any woman I'd seen\"), woo's her and akes her amid the wild roses to which he keeps comparing her where he kills her.\n\r\nalternately this song could be about a man who murders his girlfriend in order to preserve her beauty. however the line \"From the first day I saw her I knew she was the one\" along with \"On the last day I took her where the wild roses grow\" makes it sound as though he'd planned the whole thing from before he ever met her.\n\r\nwhatever it's about it's a brilliant song, it's so macabre and yet, so beautiful i love everything about this song\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThats a really interesting insight, xpixiex, I hadn't considered the possibility of 'The Wild Rose' being used by newspapers etc as a name for the murder victim. Anyway, I think the firstverse sheds light on the notion of the murderer killing in order to preserve beauty:\n\r\nFrom the first day I saw her I knew she was the one\n\r\n[As early as the first ambigous line of the verse, Nick Cave introduces the motive of killing in order to preserve the image of beauty for eternity. In particular, he subverts the notion of 'the one' i.e. the one person with whom you spend the rest of your life with, by tying it in with the killers' predeliction for murdering beautiful women and selection of a victim.]\n\r\nShe stared in my eyes and smiled \r\nFor her lips were the colour of the roses \r\nThat grew down the river, all bloody and wild \n\r\n[The comparison of her lips to bloody roses growing by the river bank is a premonition of what is to follow with the victim's murder.]\n\r\nAlso, in the third verse, the rose metaphor is tied into the notion of a flower representing female chastity:\n\r\nOn the second day he came with a single red rose \r\nSaid: \"Will you give me your loss and your sorrow\" \r\nI nodded my head, as I lay on the bed \r\nHe said, \"If I show you the roses, will you follow?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI love how it starts off with the chorus, and how it uses the past tense \"But my name was Eliza Day\". It made me think the first time around, why \"was\"? It became clear soon enough... =\\ I love thing song. I think it's absolutely hauntingly beautiful. It really paints a bewitchingly vivid scene.\n\r\nI also like how it seems like a run-of-the-mill love ballad, but every now and then, something makes you feel as if something's not quite right. Until the end comes and you find out why.\n\r\nHauntingly beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThe King of Goth with the Princess of 80's Tacky Pop: a recipe for disaster you'd assume.  And you would be...wrong!  This unorthodox duet works well, and the result is a haunting ballad about, erm, Nick killing Kylie.  Whatever works for ya, pal!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nit's really eerie and i absolutely LOVE IT!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\ni love this song... it's haunting and beatiful with disturbing lyrics.. The only song with Kylie in it i actually like...\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis song is so morbid, but the music and voice make it absolutely beautifu.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nyeah i agree this was around the time when i didnt mind kylie and this song made it for me love it its disturbingly beautiful\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nIn regard to the \"wind light as a thief\" bit, I also love this bit.  Nick always includes some sort of extraneous detail that other people would ignore, considering the situation.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThis song has the power to take me to another world,another time...it seems like a sort of \"bloody fable\", because even if the setting and the characters could be the one of a fairy tale,the threatening shadow of death makes it dark and scary...I love it when it says \"all the beauty must die\",obviously I don't agree with that but anyway I find it very poetic\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nCall me stupid, but I don't really see what he meens with \"the wind light as a thief\"\r\nCould someone explain this to me?\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\n\"the wind light as a thief\" I think it refers to the fact that a thief has to creep with light steps so he won't get caught, and that day the wind was like that; light...\n\r\nFurthermore I think this song is very beautiful and a bit sad.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI always thought the line was \"When light as a thief, I kissed her goodbye, and said\" etc. \"The wind\" fits much better. \r\nThis song does have a very gaelic ballad feel to it, and no matter how many times I listen to it I'm always sort of taken by surprise when it goes from romantic mush about kissing and she is the one to him being above her about to brain her with a rock. \r\nThis song is very beautiful, I think the darkness of it makes it far better, this song couldnt have been as emotive if it wasnt a murder ballad\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nwow, had this one on my itunes for like a year before i actually listented to it... awesome song\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nWhy did he kill her? o_O;\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nbecause he thinks \"All beauty must die\"\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nthis song is hauntingly beautiful.\r\nWhether you think it's kylie's only good song cos of him, or his only good song cos of her, it's just amazing.\r\nNick cave is amazing...\r\nAnd i love the way it's such an unusual pair....i mean, two australians from completely different music backgrounds.\r\nAaargh, this is just...aargh.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nthis song is gorgeous... only nick cave can make music that is this haunting and gothic and poetic. it reminds me a lot of the poem 'porphyria's lover'.\r\nit's hard to believe that this could be kylie minogue but the combination actually works awesomely and the song is perfect\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\n\"They call me The Wild Rose\r\nBut my name was Elisa Day\r\nWhy they call me it I do not know\"\n\r\nSounds like the locals or the papers nicknamed her \"The Wild Rose,\" because they found her where the roses grow, which is where Nick promised to take her. She must've been an unidentified body, and in the after life she is trying to reach out to them to tell them her name.\n\r\nDisgusting, but beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nfor me, her name sounds like \"a lie, a day\" (perhaps my french ears) so that may be the reason why he kills her : an unfaithful girl with such innocent voice...\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nExactly!  ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nahh, sociopaths always make for good song material. I'm very surprised that it's kylie singing! She sounds almost normal.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI go to school for music theory and writing and this is one of the songs that I actually did back in high school... It's a song about, as most of you stated, a murder, and the taboo subject of necrophilia. It's a great song. It's pretty wild; no pun intended.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nI didn't get the point that he kills her and say \"all beauty muts die\". Can someone explain? Why beauty must die? Is he a psycho?\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nIts a longshot to assume that there is an actual connection, but on the song 'Nymphetamine' by Cradle of Filth, the guest singer (Liv Kristine Espanaes Krull of Leaves Eyes) sounds a lot like Kylie Minogue does on here.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI actually heard it, and thought exacly the same.\r\nYou must hear Nymphetamine Fix too. (though the theme is a bit different and not so haunting.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nYes.  He's a psycho probably with the delusion that destroying beauty lets him \"own\" it.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nTo expand upon the last comment, is the act of murder little more than taking a photograph of the victim, freezing her beauty at that moment for all eternity? And wouldn't this contradict the notion that \"all beauty must die\" (not in a literal sense, of course) sinse the act of murder allows beauty to live forever?\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI always considered the chorus:\n\r\n\"They call me The Wild Rose \r\nBut my name was Elisa Day \r\nWhy they call me it I do not know \r\nFor my name was Elisa Day\"\n\r\nTo be representative of her confusion as to why she as a person is objectified by being compared to a pretty object. Perhaps being found physically attractive by most everyone has led to a confusion in identity between \"The Wild Rose\" and \"Elisa Day.\"  \n\r\nThe murderer is taking the idea of the \"Wild Rose\" to an extreme and killing her without thought for \"Elisa Day\"\n\r\nI dunno, classic song though.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\ndoes anyone know why people say this song is explicit? i've seen the video clip and the lyrics and they dont appear that explicit. or am i listening to a clean version? love the song tho it sounds amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\n\"All beauty must die\" is a truism.Yes, it must, because everything decays. Elisa Day won't stay beautiful forever, she'll fade like the wild roses, like everything. The only way to stop her growing old is to kill her. Like the young lady in 'The Curse of Millhaven' (who was told once too often that we all gotta die) the killer has taken this too much to heart & too literally. It's actually the sort of thing a parent might say in a forlorn attempt to persuade a son to marry for qualities other than physical beauty.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI thought exactly the same thing about the newspaper headline!!!\r\nI don't think she really understands that she's dead. Might be wrong, but that's just the way it came across to me...\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nelmidio,\r\nYes, it's pretty sad. In fact, on Saturday night, SBS are screening a series titled 'Great Australian Albums' and they're featuring Murder Ballads. I don't even want to watch it, but I know I will. Why couldn't they choose Tender Prey or Abattoir Blues or Your Funeral, or anything but Murder Ballads?\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nSuch an amazing song! It's like a mini opera. Nick Cave is an amazing writer...really a true genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nHas anyone watched or read Perfume- The Story of A Murderer?\r\nIt reminded me of this song in a way because he's targeting the most beautiful and innocent of victims, and preserving the very essence of them.\r\nI love the fact that they're 'wild' roses, it gives the song such a lush imagery, like the line 'bloody and wild' it sounds so lovely yet when you picture it it's actually really chilling.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nYeah I read das Parfum at school, for German. Yeah I understand how the song reminds you of it.. Except Grenouille is ugly and his victims aren't close to being in love with him. By the way, I read that Scentless Apprentice by Nirvana is inspired by that book. I just read the lyrics and itÃ\u0082Â´s pretty obvious if you read the book, and probably if you watched the movie too.\n\r\nAnyway, I love this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nThe \"wild rose\" bit isn't as complex as it seems; this is Cave's interpretation of the classic murder ballad \"Down in the Willow Garden\":\n\r\n   I drew my sabre through her\r\n   It was a bloody knife\r\n   I threw her in the river\r\n   It was a dreadful sight\r\n   My father often told me\r\n   That money would set me free\r\n   If I did murder that dear little girl\r\n   Whose name was Rose Connelly\n\n\n\n", "comment_43": "\nWhy are there more comments? Well, because i think this was their most high profile album, specifically because of this song, and to a different extent, this video, the only one i ever saw get any real air time. \n\r\nI'm tired of this album being sidelined because of the \"novelty\" of it. With songs like this \"Song of Joy,\" \"Curse of Millhaven,\" \"O'Mally's Bar,\" i think it's just as good as any other Bad Seeds albums, certainly better than anything that has followed the \"Best Of\" album. Abattoir Blues? Seriously? You wanna stack that up against this album? And what of \"Henry's Dream\"; a stronger album than both \"Tender Prey\" or \"Your Funeral..\" in my opinion.  I love the old shit too, but as albums, i don't think they were as strong as his post rehab work. I think \"Let Love In\" and \"The Good Son\" are both stronger than anything before the rehab, on the whole, as albums. Of course, for my money, their finest album is still \"Boatman's Call\" and people hate that album for some good forsaken reason, so i guess my opinion goes flying out the window at that point, right?\n\r\nOh yeah, love this song by the way. Uh, he kills her, she doesn't appear to realize she's dead. Yes, he's a psycho. No, i don't believe he raped her corpse (where the fuck did that come from people?) I particularly enjoy the fact that all she hears is \"a muttered word\" .... doesn't even hear what he says. Beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\naccording to me the message of the song is\n\r\nthe beauty must die.. physical beauty is not important.. its perishes..\r\neven if u have acheived presence of beautiful people in ur life, it pains when they are gone.\r\nso if u dont murder the beauty on the begining of ur life relationship.. some day when they go,\r\nu still have to murder their memories..\n\r\ni think it relates to every person out here and not any illness with character..\n\r\nall of us have to kill the memories of people who are gone..\n\n\n", "comment_45": "\nSensational song.What an artist Nick is!!\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nawesome song! the calm tone of the song reveals the beauty of Kylie's voice,\r\nfor me the song represents a state of obsession in nick being obsessed of not letting anybody share what he sees as beauty, he wants to possess her and not share her, by killing her she is kept in his memory, for himself only. she shows the naivety of love, she loved him so dearly and trusted him , even though she saw the rock in hist fist. the song begins backwards where nick washing off the blood, than starting the story from the top it's a classical story telling of a dramatic play, u have the result, the story, and than the cause. i couldn't take away from my mind how nick had his head in his hands being worried if what he has done was the right choice to do, u see regret, as well as getting along with the fact of the murder and calm state as well, this is how it is translated the psycho condition of his. great song, calm, deep, tragic.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI admit, that this is he only song made by Cave I've ever heard. And that's because it features Kylie in it. \r\nBut well, I love this song very much. As everyone has said previously, it's so misleading at first; you think that it's a clichÃ\u0083Â© romantic song and bang, she's dead. And their voices fit really well together. Especially the line 'all beauty must die' always starts to haunt me. I have always thought, that he says it because he is bitter and jealous for all those beautiful things in this world. He is rotten inside himself and wants to destroy all the beautiful things that remind him of his own faults.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nIn her 'afterlife', for lack of a better word, she knows people are calling her the wild rose but doesn't understand why. Perhaps she doesn't realize she is dead or what has truly happened. She sings about a man (her first) and is infatuated with him. She finds comfort in his company, trusts him and follows him to a place he has described as being romantic and special. She then ends with the last moment she can recall by describing the rock in the mans hand but is too naive to realise why. \n\r\nIts a sad song about an innocent girl seduced by a seemly trusting and attractive man but with a dark ulterior motive. Great to see Kylie exercise her talents in the non-pop arena!\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nIt's funny I'm not big on traditionals, but for some reason I'm familiar with \"Hang-ed I will be\" and this is clearly a reworking of that song, or a different version of that song. The reason I mention the connection is a few people are confused about the reason behind the murder, but in that other version, the murder is even more hilariously inexplicable. It happens in the same way, though, with her head being bashed in among the wild flowers and then her body being tossed into the river. \n\nmudcat.org/…\n\n\n", "comment_50": "\nThis song reminds me about the story of Black Dahlia. Even the real names are pretty similar: Black Dahlia's name was Elizabeth Short. Maybe this story was and inspiration to write lyrics. Who knows?\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nThis is just a sidenote, but I do feel that this song would have suited Anita Lane much better than Kylie. Her voice was perfect for this kind of singing whereas the song isn't really Kylie's style. However, at least according to a Wikipedia quote, the song was written especially for Kylie. But I'm still not quite convinced... Anita Lane pretty much rhymes with Eliza Day.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nFrom what I understand is there's only been a good handful of live performances together with Kylie Minogue. On occasions when Kylie couldn't come, Blixa took over her part of the lyrics.\nNot sure if the song has been done live after Blixa's departure though.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\n'Elisa Day' = 'He lies a day\".\n\nHe is just good for one day & one night, one sleep, and does not demand more. After the first touch, he will abandon you. Or make you abandon him.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nI always wondered why the booklet that comes with the cd actually says:\n\n\"As he stood smiling above me with a rock in his fist.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\noh this is a sad song, makes me feel sad.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nhow come songs from this record have more comments than of any other of Cave's records? this record is horrible!\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nthe socialpath sounds like a bit of an asshat\r\ni thot i shud post this comment jus coz the last commenter and i bothe have syd/floyd song titles fer our names\r\nisnt that sumfin?\r\nwonder did he rape her afterwards? is it rape if the victims dead? coz its not like she's refusion\t\t\t\t\n\t\t\t\t\n\n"}