{"comment_0": "\nIt's not about a nomadic life. It's about Metallica's touring.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nVery good song despite its meaning? The song is completely good...\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nlove the drums. this song is awesome times 90000\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nits about metalica going everywere they can to escape \"The Game\" see line 9 (to The Game you stay a slave) PS you just lost the game\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nA loser believes in himself, takes pride in his power to express himself. takes no crap from anyone. not enslaved by the need to be socially accepted\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis is one of my favorite Metallica songs, and also one of my favorite songs in the world. \r\nIt is just great.\r\nWhat is it about? Well, a nomadic life. You just know it after the first verse... \"and the road becomes my bride\"\r\nAnd of course, all the song is in this same theme. \r\nI especially like the \"where I laid my head is home\" part\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis is definitely one of my favorite metallica songs ever. It's huge. Just like the cover Turn The Page from Garage inc. this song is about a rock band on the road.\r\nmy favorite line is \"off the beaten path i reign\". Genius!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nActually I believe that it's about what happens after you die. The main line for this is \"my body lies but still I roam\" (not to mention on the tshirt it shows a gravestone/burial ground). But then I also do believe the Metallica touring part too. Lots of evidence of that, and their video gives that impression...so whos knows really?\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI agree with smasher/devourer. Except it'sa little bit more. Like maybe a Ghost \r\n\"my body lies but still I roam\" \r\n\"the earth becomes my throne\"\r\n\"And I'll redefine anywhere\" - as in appear anywhere\r\neven \"off the beaten path I reign\" - as in the idea thatghosts Mainly dwell in places where men do not.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI've always thought this song could be about Satan.  He's not omnipresent, he can only be in one place at a time.  Also, he \"craves the dust of the Earth\" or something to that effect.  He's always on the move, cause he's got a lot of people to get in what I'm sure to him is very little time.\r\nEven \"my body lies but still I roam\" could be interpreted that hell's angels are out working all the time where he isn't.\r\nAnyways, that's just my thoughts.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nOK OK OK METALLICA MASTER HERE AGAIN!!! YALL WANNA KNOW THE REAL!! MEANING?? HERE IT IS!\r\nThis song is about the band being on tour and leaving their girlfriends, friends, and loved ones behind. In the lyrics the band is compared with a roaming vagabond whose soul keeps on roaming even after his death. It could also be about having or maybe even missing the freedom.  SO IN A SENCE YER ALL ON THE RIGHT TRACK\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nSmasher you are going to deep.\r\nAl Bundy i love your name.The song is simplle about the life of a band (this case metallica) which are constently on tour and every stop is their home.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nAssuming its about touring is obvious and might very well be true, though, as so many Metallica songs, it can be used to symbolize other things as well, like a nomadic life, as a song about not letting yourself be tied / pinned down etc.\n\r\nThats the great part abuot Metallica. Their songs have wide appeal and you can often find a personal meaning\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis song is about about freedom and living on the road. Yet another great song by Metallica. \t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nAll I got to say is, last yr for my big english creative piece I wrote a piece about a girl who runs away from home to travel the country by hitchhiking and gets murdered, and I used the quote \r\n...And the earth becomes my throne \r\nI adapt to the unknown \r\nUnder wanderering stars I've grown \r\nBy myself but not alone \r\nI ask no one \n\r\n...the marker of my essay said the quote was \"extremely relevant to the theme of the story\"... now im sure she doesn't listen to Metallica, hell she hasn't even read the whole song(!) but I agreed with her.(which is why I used the quote?!) I think this song is about  just leaving everything behind and travelling the road and leaving your life in the hands of fate.... that's my personal opinion anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nMy favorite metallica line: Carved upon my stone; My body lies but still I roam. \n\r\nThere's many reasons Metallica is the greatest heavy metal band of all time, and this aong is one of them. 'Nuff said.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nHey ya'll, I just wanted to say that the lyrics: \r\n\"Carved upon my stone \r\nMy body lie, but still I roam yeah yeah!!\"\r\n*I'm not sure if Metallica meant it to be interpreted this way when they wrote those lines, or later realized it* but those lyrics relate to the death of Cliff Burton and even though his body lies still, his spirit still roams with Metallica, in a sense. Just wanted to add that :)\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThis here song speaks about Freedom . a utopic kind of freedom but that's what makes it so damn good! Possibly my favorite Rock song ever...\r\nPicture yourself drivin' a convertible on a lone smooth desert road listening to this song on your CD player... HEAVEN  \r\nThank you Metallica !! respect forever\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThis here song speaks about Freedom . a utopic kind of freedom but that's what makes it so damn good! Possibly my favorite Rock song ever...\r\nPicture yourself drivin' a convertible on a lone smooth desert road listening to this song on your CD player... HEAVEN  \r\nThank you Metallica !! respect forever\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nNow THIS is music!  I LOVE THIS SONG!  Metallica...well, old Metallica...is beyond amazing! I love these lyrics.  I'm sure that this song IS about the band touring on the road, but to me it is more about a nomadic lifestlye because, well, I can kinda relate to that on a personal level.  :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nHEY...you calm the fuck down\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI believe it IS about a wandering ghost - there's so much evidence in the lyrics, \"My Body Lies, But Still I Roam\" - his human body is dead, yet his ghost roams the earth. \"...And the earth becomes my throne\" -- His spirit is still bound to the Earth, \"By myself but not alone\" - He feels alone, but he believes there are other ghosts, wandering the planet, \"Carved upon my stone\" - STRONG evidence about his grave, with his name carved into it.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\ni would just loike to add: \"...And my ties are severed clean\" - his ties/bonds/links to his human body have been cut, more evidence that this song is about death + ghost.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\ni translated this song into Russian, man it rocks, this nomadic lifestyle thing!\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\ni think this song is partially about the band travelling on the road, but maybe they are saying like it feels like they've travelled ferever and even after they all die their ties to the human world travelling with their music, will still keep them roaming the earth while their music lives on in the human world.  I dunno... maybe i looked to deep into the lyrics... oh well, this is the song that got me started listening to metallica and its one of my favorites\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThis was one of the first Metallica songs I ever heard. The only reason I don't like this song as much as their others is that they just use the exact same guitar riff over and over and by the end, it gets kind of repetitive. The solo is awesome, though.\n\r\nAlso, does anyone know what kind of instrument is playing at the start of the song? It sounds like a sitar.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nsomeone please explain to me why this has 24 posts and enter sandman has over 600......i guess meaningful metallica songs just arent as cool and fun as enter sandman apparently is\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nThis is my favorite metallica song when i graduate my freinds and i are gonna take a road trip as soon as we take of im gonna blast this song!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nRe-discovered the Black Album the other day.  This is by far one of Metallica's greatest songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nBEST METALLICA SONG IN EXISTENCE!!! \r\nWell, actually...\r\nBack in the day when I was still discovering Metallica, I thought this song was gay cause of the egyptian thingy. But once i listened to the whole thing, i think its awesome how the lame \"egyptian thing\" turns into the greatest song ever! \r\nBesides Master of Puppets, this song has the best Metallica solo. My FAVORITE part is:\r\n\"..to the game you stay a slave\r\nRover wanderer\r\nNomad vagabond\r\nCall me what you will\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis Song is the best on Black Album. This song is my favorite song. What more do you need?\n\r\nP.S. This song is million times better than cheap 'Enter Sandman'-which apprently is the most popular Metallica song in here-. It never gets old Trust me\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nMy opinion of all Metallica albums released so far:\n\r\nKill Em All:A\r\nAside from the childish lyrics on Metal Militia, the experimenting on this album showed that they would go places. A bass solo on a 1st album is rare.\r\nHighlights: The Four Horsemen, Whiplash, No Remorse, Seek and Destroy\n\r\nRide The Lightning: A+\r\nThe band was accused of selling out because this album was not Kill Em All Mk2. WHO CARES! Great album. all songs have a feel that fits them\r\nHighlights: For Whom The Bell Tolls, Fade To Black, Creeping Death, The Call Of Ktulu\n\r\nMaster Of Puppets:A+\r\nMetallica's best album. Unfortunately their last with Cliff Burton. Although he died 20 years ago, his music will always be remembered\r\nHighlights: Battery, Master Of Puppets, Sanitarium, Orion\n\r\n...And Justice For All:A\r\nTheir only political album so far. Has a few faults-some of the songs are a bit too long, the drums make a 'click' rather than a 'thud', and the bass is barely audible. But this is nitpicking really. Its a very good album\r\nHighlights:Blackened, Eye Of The Beholder, One, The Shortest Straw\n\r\nMetallica:A+\r\nPeople will debate about my rating, but there's more to this album than Enter Sandman. This song (the one i'm commenting on) is the best on the album. There's a mix of fast songs and some deep ballads, but unfortunately, some people only think Enter Sandman when this album is mentioned\r\nHighlights: Holier Than Thou, Wherever I May Roam, Nothing Else Matters, Of Wolf and Man, The God That Failed\n\r\nLoad: A\r\nNew sound, new image. The sellout accusations come thick and fast (seen somewhere before?). But the accusers could never see past the ends of their noses. Sure it's not as good as any of their previous albums, but its still good!\r\nHighlights: King Nothing, Wasting My Hate, Mama Said, The Thorn Within\n\r\nReload: B\r\nMore of a hard rock album. Also the first lyrically focused.\r\nHighlights: Fuel, Devil's Dance, Where The Wild Things Are, Attitude\n\r\nS & M: A+\r\nAlthough a couple of songs did not fit in (Sandman, Fuel) when played with an orchestra, the idea was a big success. The orchestra added more feeling to the ballad type songs, and made the heavier songs even more awesome.\r\nHighlights: The Thing That Should Not Be, Nothing Else Matters, Wherever I May Roam, One, Battery\n\r\nSt. Anger: B\r\nTheir most aggressive album since Justice. They wanted a raw sound, which they've achieved. Not a bad album, but it has several faults-the song are too long, Ulrich's snareless snare drum makes the album sound a bit too raw, and the songs lack of solos leave it feeling not 100% complete.\r\nHighlights: Frantic, Dirty Window, Shoot Me Again\n\r\nThe next album is showing plenty of promise-new producer, a return to solos, and a mix of the old recording way (start with demo tapes from all) and the new (everyone has a say in what becomes the final song). Lets see what that brings...\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nits human race, its about us the humans exploring spaces on earth for fun.\r\nourmind wants to kepp working, doing new stuff shitty stuff.\"my body lies but still i roam\"\r\nit means the human mind is destined to be restless.\n\r\nWell the best thing is the melody.\r\nthis song is the best song to define rock music,\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\n...And my ties are severed clean\n\r\ncan someone pls expalin this line to me.thanx in advance\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nties-bonds like knots and ropes or connections like family and friends\r\nsevered clean- cut through in one motion or without leaving ragged edges or merely cut all the way through\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nits about being free without someone telling you not to do so.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI think the author listened to \"Gypsies, Tramps, and\r\nThieves\" when he was a kid, and he's saying now, \"Look I can sing as well as Cher to a cool song about the gypsy life.\" All good artists copy material in some way from previous artists they heard or viewed when they were growing up.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nBest song off of the Black album but still nothing spectacular\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\n\"Ties are severed clean\" refers to his connection with his old life being left behind.\n\r\nAlso, Metallica is a very deep band, so these lyrics could refer to any of the interpretations discussed here, or even more.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\n\"rover, wanderer,  nomad, vagabond call me what you will..\" fukin awsome dude!\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nBut I'll take my time anywhere\r\nFree to speak my mind anywhere\n\r\nLove this entire song but this is one of my fav parts, its about how if you are somewhere miles away from anybody you dont really care what people think about you because you know you will just be gone in a short time.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nThis song I think is about wanderlust, a man who loves to travel so much he has no real home nor needs one, and once he dies his spirit travels the world forever.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nif its about metallica touring then y are the following lines there??\r\n1. i have stripped of all but pride\r\n2. but i'll take my time anywhere\r\n3. where i lay my head is home\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\ni think this song is about the author of the \r\n'necronomicon\".. after all he roamed the former sumerian area (which is now basically iraq) alone his whole life with no partner (the line about the road being his bride can kind of play into this), the intro and riff kind of sounds arabic .. and the song \"call of ktulu\" kind of hints that they are into some parts of the necronomicon.. chtulu plays a big part of the necronomicon and was kind of brought into the modern culture by h.p. lovecraft, who was greatly admired by cliff burton.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nGreat guitar riff, but after ...And Justice For All, Metallica was not very good lyrically.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nHoward Phillips Lovecraft is the author of the Necronomicon. He created Chtulhu. He used the penname \"The mad arab Abdul Alzaharad\" when he wrote the Necronomicon.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\ni think this song is about the journey and \"path\" to finding oneself.\r\nat the begining he is still on the path but at the end he finds his truth carved in stone \r\n\"Carved upon my stone\r\nMy body lie,\"\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nbut now thinking about it the song could be about cliff dying ontour which would tie in the roaming thing and the stone being a tomb stone which isnt cliff's but his which brings him back to sanity as they continue the tour.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nBEAUTIFUL SONG MAN. I THINK JAMES' MATURITY AS A LYRICIST IS AMAZING...AND TO THINK THAT HE EVEN COMPOSES THE ENTIRE MUSIC...THAT'S JUST BRILLIANT.\r\nTO ME PERSONALLY THIS SONG SHOWCASES EMOTIONS THAT JAMES GETS WHILE ON ROAD DURING THE TOUR.\r\nHE COMPARES HIMSELF TO A FORLORN SPIRIT WANDERING THE LANDSCAPE THROUGH TIME.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nI had always thought it had something to do with James' father. I remember reading somewhere that he was a truck driver and wasn't home much. But then again, I could see being on tour and away from their homelives as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nI think its about a hobo's life :]\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nThis song is about 2 things only...A life of touring, and immortality. Touring obviously in the body of the song comparing himself to a nomad, and immortality with: \n\r\nCarved upon my stone\r\nMy body lie, but still I roam\r\nLinked to James dying and what his grave stone will say, and yet his music will live on forever upon the earth. \n\n\n", "comment_52": "\nEvery time I hear this song I think of touring, and roadies. It probably has nothing to do at all with roadies, but that's what I think of when I hear it. Very good song despite its meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\n\r\nCarved upon my stone\r\nMy body lie, but still I roam yeah yeah!!\n\r\nI think this means - no matter what he is always touring with the band - and hense the foundation of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nthis song is about ME...backbacking and touring the world, always on the move and never settled in one area :)\n\r\n\"and the earth becomes my throne\"\n\r\nmy anthem\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nreminded Pulp Fiction:\n\r\n    Jules: Well, that's what I've been sitting here contemplating. First, I'm going to deliver this case to Marcellus, then, basically, I'm just going to walk the Earth.\r\n    Vincent: What'cha mean, \"walk the earth\"?\r\n    Jules: You know, like Caine in Kung Fu, walk from place to place, meet people, get into adventures.\r\n    Vincent: And how long do you intend to walk the earth?\r\n    Jules: Until God puts me where he wants me to be.\r\n    Vincent: And what if he don't do that?\r\n    Jules: If it takes forever, then I'll walk forever.\r\n    Vincent: So you decided to be a bum?\r\n    Jules: I'll just be Jules, Vincent â\u0080\u0094 no more, no less.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nThe song seems to show a classic example of a Byronic Hero (whether thy meant for that is up for debate). The song seems to show several Byronic characteristics: Ability to adapt; Suffering from an unnamed crime; Intelligent and Perceptive (\"Only knowledge will I save\"); Being an exile, outcast, or outlaw (here it seems to be just an outcast); And a distaste for social institutions and norms (\"To the game you stay a slave\"). The end with \"Carved upon my stone, My body lie, but still I roam yeah yeah!!\" implies that he has died and come back as a ghost to wander the earth. But since this is Metallica we are talking about here, I think it could also mean that even after all the band members are dead, their music will live on and continue to be listened to across the world. I hope so, because this song kicks @$$ and Metallica kicks @$$. On an unrelated note, if Chuck Norris got in a fight with Metallica, no one would win because Metallica's awesomeness would cause Chuck to implode and create a black hole that would destroy everything.\n\n\n", "comment_57": "\ni think the real meaning of this is meditation. how else can your body lie and you still roam? how else do you adapt to the unknown? how else can you be by yourself but not alone? and in doing that you could say that the earth is your throne. only knowledge will i save.\r\nto the game you stay a slave,(as our minds are in prison). and later on he mentions that \" my ties are severed clean\" hmmmm. CLEARLY THIS SONG IS ABOUT MEDITATION!!!!\n\n\n", "comment_58": "\nI would say it was about touring \"my body lies but still i roam\" may well be a reference to death but it may also be a reference to the fact that they sleep on a tour bus and hence their body is still lying but they're still roaming.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\ni just love to interpret metallica songs. to me this one is about a rebellious soul, that even in death will roam and haunt earth. in this song death is a metamorphosis and part of that road.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nI've always thought, this is about both being on tour and being dead, and a ghost. I guess you could say I think they're using the state as a ghost as a metaphor for being on tour.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nCould... It mabe be... Possible to be like the book of eli? Reminds me of the movie\nJust an option, its not what i believe\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nThose are infernal names (demons)\r\n~Rover wanderer\r\nNomad vagabond ~\r\nhe is calling on them to guide him where he wants to go .\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nTo me, this song is about a person that is leaving mundane society's standards behind. This person doesn't feel like he belongs to what is currently offered; and despite the meaning of life that he feels imposed to him, he feels like he still has much to discover and goes on a quest to find himself and the real meaning of life.\n\nHe feels that people are so engrained to think what they are told to believe, that he would rather be by himself so as not to betray himself \n\"And the road becomes my bride. (...) I have stripped of all but pride... (...) so in her I do confide and she keeps me satisfied...\"\n\nHe is on a philosophical quest, and for him, life has a greater meaning than what media/society tells us. \"Only knowledge will I save\nTo the game you stay a slave\"\n\n=> but he knows that society sees him as a reclude, a good for nothing: \n\"Rover wanderer\nNomad vagabond\nCall me what you will\"\n\nHe will only stop in places where he feels his questionning is welcome. somewhere where he can feel free to express/be himself. He feels that his opinion is no lesser than others' and he will be looking for the place where he feels at home, but not just anywhere: somewhere he can feel at peace:\n\"But I'll take my time anywhere\nFree to speak my mind anywhere\nAnd I'll redefine anywhere\nAnywhere I roam\nWhere I lay my head is homeâ\u0080¦\"\n\nHe repeats again that he doesn't believe in cliches or standards. That his worldview is that of a free spirit and he will reign on his toughts, only guided by the stars. He is not scared of what he will discover because there is a greater truth than what we're told (Philosophical standpoint): Life if not what you own, but what you believe in, and if you cannot believe in what you think is right, then you are better off walking off the beaten path and leaving things behind even though people see you as a mindless rebel, a vagabond...\n\"...And the earth becomes my throne\nI adapt to the unknown\nUnder wanderering stars I've grown\nBy myself but not alone\nI ask no one\n\n...And my ties are severed clean\nThe less I have the more I gain\nOff the beaten path I reign\nRover wanderer\nNomad vagabond\nCall me what you will.\"\n\nThis song is somehow a continuation to \"The Unforgiven\". A way to say that sometime to elevate yourself you need to move away and leave the wrong behind... otherwise you end up a bitter old man, full of regrets:\nfrom The Unforgiven:\n\"A tired man they see no longer cares \nThe old man then prepares \nTo die regretfully \nThat old man here is me \n\nWhat I've felt \nWhat I've known \nNever shined through in what I've shown \n(...)\nSo I dub thee Unforgiven\"\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nis the devil talking to us\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nIts about being called a nomad or vagabond nomad wanders vagabond roams\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nI CAN DRUM TO DIS SONG M-E-T-A-L-L-IC-A\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nThis Song is a Description of the the scriber, probably james. \nIts about the present and the hope for the future.\nIn the present on his way he is happy on the road like you are happy\nOn the wedding day with the choosen wife, so he uses bride for road.\nHe wants to give a Statement to his life on tour, for all the\nfamily People with house and garden, that his home there is where lays his Head down.\nIf man are working to built a street on a fucking hot day, they are proud in the \nSame way james is, but they have Not to give a Statement because its not art,\nart is for a lot of People Not necessary and has to be explained.\n\nAnd in the End he hopes to been remebered in the heads of People like in stones \nOn a grave. We all can say that this will Happen.....\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nThis is one of my favorite Metallica songs, and also one of my favorite songs in the world. \r\nIt is just great.\r\nWhat is it about? Well, a nomadic life. You just know it after the first verse... \"and the road becomes my bride\"\r\nAnd of course, all the song is in this same theme. \r\nI especially like the \"where I lay my head is home\" part\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nThe hero of this song is neither thief, nor any other criminal. He's a person that leads a missionary life. He has few possesions, loves all people equally and is proud of it. It has to do with christian teaching that says one must love God or 'goodness' more than any relative. This way of having little possesions and treating every person like a father or mother is normally hard to understand. Therefore this tramp-like way of life is called 'off the beaten path'.  'My body lies but still i roam' says human spirit is imortal. It also says that human imagination is a very powerful possession that can take you across time and space even when you lie in your bed.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nI believe the song is about cliff and how he died on tour.  The road becomes my bride is how it started and carve my stone my bodie lies but still I roam is how it is now.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\ni love this song. my dad put metallica on all the time when i was a baby. and when my dad and step-mom's dog mobi died, i was listening to the song, and my dad sayed he was going to put the verse,\"my body lies, but still i roam\" on his grave.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nI would like to know why enter sandman was such a popular song.it was alright but wasn't one of there more serious songs.but every body seems to like it when it was far from being one of there best songs.but most of the people i know that like this song are like hip hop,rap and r&b fans so i guess they dont have very good taste in metal.poor kids.metal is clearly the best genre of music out there.  \t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nI beg to differ. When the song states that the road becomes my bride and later the earth becomes my throne, this is really a direct quotation of Satan claiming his dominion over the earth.\n\r\nIn fact, if you read the song by yelling them in your mind like you are making an argument it really sounds like someone or something is defending his (its) claim on something.\t\t\t\t\n\t\t\t\t\n\n"}