{"comment_0": "\nOh, oh, oh\n\r\nWhere are you now,\r\nwhen I need you the most?\r\nWhy don't you take my hand? \r\nI want to be close\r\nHelp me when I am down\r\nLift me up off the ground\r\nTeach me right from wrong\r\nHelp me to stay strong\n\r\nSo, take me my hand and walk with me\r\nShow me what to be\r\nI need you to set me free, yeah\n\r\nWhere are you now?\n\r\nWhere are you now,\r\nnow that I'm half grown?\r\nWhy are we far apart?\r\nI feel so alone\r\nWhere are you now,\r\nwhen nothing's going right?\r\nWhere are you now?\r\nI can't see the light\n\r\nSo, take my hand and walk with me\r\nShow me what to be\r\nI need you to set me free, yeah\n\r\nI need you to need me\r\nCan't you see me?\r\nHow could you leave me?\r\nHy hearts is half empty\r\nI'm not whole when you're not with me\r\nI want you here with me to guide me,\r\nHold me and love me now\r\nWhere are you now?\n\r\nOh, where are you now? Oh\n\r\nSo, take my hand and walk with me\r\nShow me what to be\r\nI need you to set me free\r\nWhere are you?\n\r\nOh, where are you now? Oh\n\r\nYeah, yeah\r\nOh, yeah\n\n\r\n(: Such a beautiful song, <3\n\n\n", "comment_1": "\nIdk Justin where is your brain\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song tugs at my heart strings and gives me mega goosebumps. I can relate to it so much in every single line. Like Justin, my father is also no longer around... and there are so many times I wish he was. Ive always wanted to be able to write a song to sum up how I feel deep down, but Justin has done it effortlessly and simply. I cannot get over how talented this lil guy is.\n\r\nnot having a father does things to you deep down, it changes you.. makes you strive to be strong for your mother, dear to your families, it makes you protective, sometimes moody and emotional in private. It gives us a need to be the best we can be at everything in life, to kinda prove we can take care of ourselves without having our father around, even tho at the back of our minds there is always that something missing.\r\nI see this in justin too, he strives to protect his mum, to be the best he can be, never give up. His cocky confident persona is a blanket over the wounds that lie underneath. In a way, perhaps Justin even has his father to thank for making him the determined person he is today! even still, I wish I could meet this lil dude and give him a huge hug. I think this is the underlying reason for everything he has achieved, and definately a big part of what makes him tick.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nvery powerful song!!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think this song is about someone he lost.\t\t\t\t\n\t\t\t\t\n\n"}