{"comment_0": "\nThis song makes me cry all the time :( partly cause i read a sad imagine thing that i connected lyrics of this song to... but i think it's about a boy who is missing someone he loves. but anyways its a beautiful song <3\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI think this song is about a couple, and they break up because she has to move far away. Time passes(?), and the guy is still in love with her. They don't really stay in contact, mainly because the guy is too scared to find out if she still has feelings for him. They may have mentioned that they could get back together later in life, but he denies it because \"nothing lasts forever\"\nso yeah its about a guy still in love with a girl\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ni love all 5SOS songs, the songs do have  meanings which always amaze you\n love u guys!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nTo me, this song is about ending a relationship due to the distance. 5 Seconds of Summer wrote this song by themselves so it's most likely about one of their relationships when they left for tour in the first place. \n\nFor a while we pretended \nThat we never had to end it\nBut we knew we'd have to say goodbye \n\nThey both knew that the boy had to leave for tour sooner or later so he could fulfill his dream. They tried not to think about this but in the back of their mind they always knew it was going to happen and that they had to end their relationship.\n\nYou were crying at the airport\nWhen they finally closed the plane door\nI could barely hold it all inside\n\nObviously, both of them are effected equally by the break up and it's heartbreaking for them. \n\nTorn in two \nAnd I know I shouldn't tell you\nBut I just can't stop thinking of you\nWherever you are\nYou\nWherever you are\nEvery night I almost call you\nJust to say it always will be you\nWherever you ar\n\nThe boy is torn in two because on the one hand, it's his chance to finally live his dream and do what he always dreamt of, but on the other hand he has to leave his girlfriend behind and breaks not just her heart, but his own. \nHe now is away seeing the world and fulfilling his dream, but nevertheless he cannot stop thinking about his former girlfriend. He misses her and still loves her because for him, there will be no other girl than her, she will always be the one. \n\nI could fly a thousand oceans\nBut there's nothing that compares to\nWhat we had and so I walk alone\n\nNo matter where he is in this world, he compares every girl he meets to his ex-girlfriend, but no one is as good as she was. She still is the best thing that has ever happened to him and he thinks he will never feel the way he did with her again. This is the reason why he doesn't have a new girlfriend yet but is still single. \n\nI wish I didn't have to be gone\nMaybe you've already moved on\nBut the truth is I don't want to know \n\nHe still wishes that he didn't have to leave so he could be with her as he is still thinking about her. He isn't sure whether she still feels the same way for him or whether she moved one, but he doesn't even want to know because if she moved on, his heart would break even further knowing that she is happy without him while he still suffers from the break up. \n\nYou can say we'll be together someday\nBut nothing lasts forever\nNothing stays the same\nSo why can't I stop feeling this way? \n\nI'm not entirely sure about this part, but in the essentials he wonders why he still loves his ex-girlfriend when they say that nothing lasts forever. But if nothing lasts forever, why does his love for her still lasts to this day? \n\nSo this song kinda tells the story of a young couple breaking up because he has to leave. While he is happy to leave because he get's to do everything he ever dreamt of he is heartbroken because he had to break up with his girlfriend and leave her behind. He never stops thinking about her or loving her, no matter where they are in this world, and he doesn't want another girlfriend because she will always be the one for him.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think it's about either them or a girl and they have to break up and leave each other?? Idk, I love 5SOS though! ^_^\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI think the song is about one of them in a serious relationship, but they have to end it because they are touring all the time, so they can't spend time with that one person and don't want them to just wait for them all the time.\n\nBut the guy can't get over her because he loves her too much, but he knows it won't work.\n\nI love this song and band so much, they make me a proud aussie <3\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI think its about when they had a long distance relationship and they knew it had to end but they didn't want it to and when it comes to like them knowing the girl has moved on he is still in love with her.\nBut the video for this song is for the fans with loads of videos of them while being on tour and stuff\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song to me is about a couple who have loved each other since they were kids..... they've always had insane feelings for each other but of course life gets in the way and circumstance fucks things up for them... and they have to break up but the feelings won't go away, and they still want each other.\t\t\t\t\n\t\t\t\t\n\n"}