{"comment_0": "\nI hadn't actually paid any attention to this song until santana's cover with yo-yo ma and india arie. It is beautiful, you all should check it out.\n\r\nOk firstly, I do not agree with any of the comments above. I do not think George meant for this to be a love song, at all. This is an elegy, a lament, for the decadence of the world and society in general. George was the one Beatle that brought the spirituality (not RELIGION, but spirituality) to the group, being a Hare Krishna devotee (and bhakti- bhakti meaning devotion- yogi) for a great part of his life. The Hare Krishna movement as well as some other Hindu elements were a big influence for George's writing.\n\r\nThis is the song how I interpret it, and interpreting it from a spiritual point of view:\n\n\r\n\"I look at you all see the love there that's sleeping \r\nWhile my guitar gently weeps \r\nI look at the floor and I see it need sweeping \r\nStill my guitar gently weeps \"\n\r\nthe first line is my favorite line. he senses a lot of potential in people, a lot of hope, a lot of capacity to love in every human on Earth; but nevertheless it is sleeping, it isn't yet awakened. It is there, we all have it, but it is not yet awoken. We can all be extraordinary, great human beings, he still haven't reached or full potential yet because it is sleeping within us. These same lines are repeated at the end of the song, i don't think it is a coincidence. He is reminding ourselves of all the potential we have. I look at the floor and I see it needs sweeping, he is encouraging us to observe where is it that we are standing on; if where we are at in our lives is beneficial for us, if we need to get rid of bad habits in order to live a prosperous life.\n\r\n\"I don't know why nobody told you \r\nhow to unfold you love \r\nI don't know how someone controlled you \r\nthey bought and sold you\"\n\r\nYet again, he senses the potential, the capacity of us human beings to love and do great things, but we just don't know yet how to reach our full potential to do good. It is there alright, but folded; unused, untouched. We have forgotten how to love because of all of the distractions and banalities society has put upon us; we have lost touch with our soul, our soul and spirit is controlled by everyone but us; we are all machines, incapable of loving. \n\r\n\"I look at the world and I notice it's turning \r\nWhile my guitar gently weeps \r\nWith every mistake we must surely be learning \r\nStill my guitar gently weeps \"\n\r\nHe sees the world and everyone being indifferent and untroubled by all the chaos going on. The world keeps spinning, and yet he just sits back and lets all his agony and helplessness flow through the notes of his guitar. Yet, he still has hope that we all can learn from our mistakes before it is too late to save ourselves, to save our soul and spirit.\n\r\n\"I don't know how you were diverted \r\nyou were perverted too \r\nI don't know how you were inverted \r\nno one alerted you\"\n\r\nHe can't understand why people don't see hoe distracted they are from their true nature, from their inner selves. He are all corrupted and perverted, and yet we think that there is nothing wrong with us, that we are all 'normal', when the truth is that we are living in a lie.\n\r\nI hope that after reading it you can see it from my point of view, which I hope is somewhat accurate on what George truly meant by writing it. I am sorry if it is a bit unclear, English is not my first language. I understand what every word in the song means, but when I try to traduce what I think to English it kinda gets lost in translation ^_^\n\n\n\n\n", "comment_1": "\nsong4julia is right, on The White Album Eric Clapton became the first non-beatle to play on a beatle track (other than orchestra stuff) Towards the end the \"fifth Beatle\" Billy Preston played on a lot of their songs, but Eric was the first.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nNow, basically everyone's problem is that they are not treating this song like a poem, which means that its interpretation is being altered. One must understand that the bealtes were as much poets as shakespeare was, and so their songs must be treated like poems. According to this new rule, one thing people must be aware of is that the poet is not necessarily the one speaking in the poem, this is the persona. Knowing this, it is wrong to assume that George is the one singing this song. Another reason why george is not singing this song is due to the intentional fallacy. Anyways, since george is not singing the song, it can only be assumed that instead a mythical dragon is singing as this is the persona of the poem. Now, it must be understood that dragons are a very power race with incredible powers. And of course, with great powers comes great responsibily, and the dragons were not responsible enough to handle their powers and so great wars were fought. Eventually some wise and noble dragons realized they were destroying the earth, and so conspired a plan to despose of the terrible dragons and retreat into space were they would not become violent and harm the beautiful earth god. As they left, they surrended the earth to man, who they assumed would be able to take better care of the earth. Over time of course, man has become violent and has slowly to become more powerful with nuclear weapons and such, and so, the dragon, there is only one know and he is old and has a long white beard like a wizard, because of course he is a wizard like gandalf, anyways, this dragon is looking down on man, who the dragons gave the earth to, and is worried becuase man is becoming to powerful and may not be able to handle that responsibility. While my guitar gently weeps is basically the wise wizard dragons means of telling us to be careful with our power and not to be greedy or violent. If you look at specific lyrics you can see this, \"from all our mistakes we must surely be learning,\" he wants humans to learn and not be like the dragons, he uses the pronoun we like the way a young kindergarten teacher would use the pronoun we to connect her to her class, as in \"we shall go outside today.\" other lines equally reflect the dragons tone, worried brows and dissappointed stares, if people want more evidence, i would be glad to explain every line by the dragons emotions, just let me know.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI don't really know the history behind this song, but if I were to guess, I think this song is about George getting overshadowed by John and Paul.  \n\n\"I look at you all see the love there that's sleeping, while my guitar gently weeps\"\n\nI think that George is saying that there is no love for him from Beatles fans because he never really got a chance to get people to like and appreciate him as much as Beatles fans do John and Paul.  Every time he says while my guitar gently weeps, he is describing himself.  George was really just, \"that Beatle that played guitar and didn't write a lot of songs.\"  George is gently weeping because he is forced to help and support people that overshadow him.\n\n\"I look at the floor and I see it needs sweeping, still my guitar gently weeps,\"\n\nThis means that George is describing himself almost like a servant for John and Paul because he is helping them make success even though there is none of his creative input, and still he feels sad for helping them.\n\n\"I don't know why nobody told you, how to unfold your love,\n\n\"I don't know how someone controlled you, they bought and sold you,\"\n\nI know this sounds a little weird, but again, this is what I got out of it.  George is the guitar, so he and the guitar are like one person.  He's reassuring himself by talking to the guitar, he's trying to keep it from weeping.  It's like he's talking to himself in a mirror.  George is sad and confused about how John and Paul didn't let him have more creative input, but still controlled him into helping them.  They also, \"bought and sold him,\" by letting him join the band, but basically selling him by excluding him from their songwriting.\n\n\"I look at the world and I notice it's turning, while my guitar gently weeps,\"\n\nGeorge sees that John and Paul making progress and being successful, but he is still sad because he is not in on their songwriting.\n\n\"With every mistake we must surely be learning, still my guitar gently weeps,\"\n\nI feel like here George is trying to be optimistic, but realizes quitting is his only option, and if he does, he will be:\n\nA)  Not be successful because of his original lack of popularity from the Beatles\n\nB)  Feeling bad because he feels like he's betraying the people that got him where he is and then Beatles fans will hate him rather than paying no attention to him at all, which almost completely lowers the chances of him being successful as a solo artist.\n\n\"I don't know how you were diverted, you were perverted too,\"\n\n\"I don't know how you were inverted, no one alerted you,\"\n\nIt's pretty much the same as what he was talking about in the other part where he is sad and confused.  Again, George is, \"talking to the guitar,\" by saying that he is sad and confused about how he had such high hopes about himself the Beatles, but he was just tricked into thinking he would be noticed, and instead he was, \"abused,\" by John and Paul.  He also doesn't know how he was, \"put aside,\" by John and Paul.\n\nI hope you enjoyed my analysis!  Please feel free share yours with me if you feel like I was way off!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nWhat are you talking about? Clapton played lead guitar on the original version on the album.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\ninteresting trivia... the strage guitar sound on the album is a guitar being played backwards.  They recorded a guitar seperately from the rest of the song, and reversed the track to create the music for the song.  Just shows how the beatles became a complete studio band... it's impossible to recreate the effect live.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nNo...he's not saying \"Paul, Paul, Paul...\" it's \"Oh, Oh, Oh...\" and Paul DIDN'T actually DIE...It's just a Rumor. (that's a line from \"Help!\" George says it...)\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nTHIS THING SUX-IT SKIPS A LINE-\"...THE PLAY YOU ARE STAGING....\"C'MON YOU GUYS KNOW WHAT IN TALKING ABOUT.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nyeah, i know what you mean metallicaman123, it misses that 'play you are staging' bit, i just noticed that, how annoying\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis song is about everthing going in the world and the only thing george is doing is playin his guitar in a band (god bless him)\r\n'i look at the world and i notice its turnin while my guitar gently weeps'\r\nbetter than his other songs 'piggies' and savory truffle\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\njust an FYI - i read george harrisons biography and it had stories about how he wrote alot of his songs (and original lyrical manuscripts covered in scribbles and changes) and it said that since he believed in eastern philosophy he wanted to try writing a song \"in the moment\" so he decided he would open a book and write a song about the first thing he saw...he opened a book and saw the words \"gently weeps\"\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nBy far my favorite Beatles song. If they created the song today and made it sound like something that would be played in this time, it would still be one of the best songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nYes, quiffporn is right......hehehe. Nice name, man.\r\nNot many people have alot to say about the song meaning. We all know the song is good, so stop going on about how good it is.\r\nWell, in this song he talking to alot of people. He is basically saying, what is wrong with you all? what happened to love? who \"bought and sold\" you?\r\nHe is telling everyone to open they're fookin' eyes. He almost downgrades himself as well. He talking about very deep things then simply says \"while my guitar gently weepes\", as saying.....\"I'm just sitting here watching all you shit heads, but I'm just a musician, and can only tell you with a guitar and song\". So hopefully you all know what I mean. If I made my interpretation of the song meaning clear enough.\r\nSo start writting, and give me something to argue with....hehee.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nSTRAIGHT FROM A GEORGE HARRISON INTERVIEW:\n\r\n\"I had a copy of the I Ching - The Book Of Changes, which seemed to me to be based on the Eastern concept that everything is relative to everything else, as opposed to the Western view that things are merely coincidental.\n\r\nThe idea was in my head when I visited my parents' house in the north of England.  I decided to write a song based on the first thing I saw upon opening any book -- as it would be relative to that moment at that time.  I picked up the book at random, opened it -- saw \"gently weeps\" -- then laid the book down again and started the song.  Some of the words were changed before I recorded it.\"\n\r\nHe went on to say that John & Paul dismissed the song early thinking it was nothing special.  (From things I've read, there was definitely a friction of John & Paul thinking they were better than George & Ringo...but I think we've all gotten this vibe from the Beatles.)  He said Ringo was a sport about it.  He was driving with Eric Clapton to the studio for the second day of recording, when he asked Eric to play on the song.  Eric was reluctant because he didn't think John & Paul would be too thrilled.  George said to forget about what they thought!\n\r\nIncidently, there is a sect of Hinduism called the Janes.  Janes believe in an extreme form of non-violence.  Hence, the walk around with a broom, sweeping the ground in front of them...so as not to step on any living creature.  I wonder if this played a part in the song at all...I mean George would've known about the Janes from his study of East Religions.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThis song is very special to me for one particular reason which I have not seen anyone write about before. I'm not sure what the 'actual' meaning of this song is, if there is an actual meaning at all, but when I hear this song I am brought to my knees with some primitive child-like emotion of love. When George sings into the \"I don't know why...\" falsetto-ish chorus I feel as though I am just floating out of my body and back into my mothers womb.\r\nI think thing song is about that basic, fundamental, primitive and innocent love one can feel when one finds oneself suspended in the womb of mother nature and life itself; an unspoilt and complete nirvana. \r\nThis is the most delicately emotional song in humankind, and I wish that everyone could hear it the way I do.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nMy favorite Beatle song ever.  George is awesome. Clapton a legend. This song is a testament to that.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nWe've all seen (for ourselves or on youtube) George's Concert for Bangladesh. When he sings While My Guitar Gently Weeps up on the stage, you can still hear the Beatle voice. So what does this song mean? Well, when the singer looks around, he sees love sleeping, chores that need to be done, his guitar cries in pain, and he just doesn't do anything about it but wonder- who's controlling you?, why can't you unfold your love?. It seems that the hidden message is that the Beatles \"All You Need Is Love\" single did not come across to the singer. \t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI hear this and want to listen to Peter Frampton's... even though this version is awesome... his makes me cry.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nJust saw Peter Frampton in concert on 10/15/11 and this was the last song he played.  OMG, it brings me to tears everytime I hear it and Peter does a great cover of this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThis is the song where I think George Harrison surpasses John Lennon and Paul McCartney as the most talented Beatle.  The Lennon-McCartney song writing duo is more well known (and was hardly a duo post '64), but George Harrison's 68-70 work beats anything they wrote and they wrote good music.  Too bad he was limited to just a couple of songs per album because the best parts of Abbey Road are \"Something\" and \"Here Comes the Sun.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nwow, i didn't know that. i learn something new about the beatles everyday. thanks song4julia and thisboy! \n\r\nwhat a great george song...\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nWas this song before or after Clapton and Harrison's wife had their affair that spawned Layla?\n\r\n-The Prynce\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nHasn't anyone heard it's supposed to sound like George is saying, \"Paul, Paul...\" at the end (because Paul died.)\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nlol, I read up on all the 'signs' about a year or so ago.  It was funny.  Like at the end of Strawberry Fields Forever, it sounds like someone's saying \"I buried Paul\" and they claimed he was saying \"Rasberry jelly\" or something, lol.\r\nHas anyone heard Revolution 9?  What about in reverse?  It's creepy!\n\r\n-The Prynce\ntheprynce.com\n\n\n", "comment_24": "\nyou've spoken to eric clapton? *swoon*\n\r\nanyhow. whether he was on this or not ... it is a fabulous song. I just watched him and paul mccartney tonight on the queen's jubilee thing. it was terrific!\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nFirst of all, in Strawberry Fields Forever John is saying cranberry sauce, not raspberry.  Second of all the \"fifth Beatle\" was not Billy Preston.  The fifth Beatle was John's close friend Stuart Sutcliffe.  In the band's early days, there was at one point five Beatles.  Paul, John, George, Pete Best, and Stuart Sutcliffe.  Stu died.  Third of all, there are no \"Paul Is Dead\" \"clues\" in this song at all.  And last of all, the song is a love song.  George got the title \"gently weeping\" when he became very enthralled with I Ching.  He liked that concept of chance so he picked up a novel and the first two words that he saw were \"gently weeps\".\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nActually, little nitpick, Eric Clapton WASN'T the first Non-Beatle to play on a beatles track. One of the first singles, Love Me Do, has studio musician Andy White on drums, instead of Ringo (George Martin opted to use a studio drummer instead of Ringo because he wasn't pleased with Ringo's performance). But anyways, I like George's songs..they have a very ethereal quality to them :)\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nActually the lyrics presented here are the original version and only the outtake contains the verse:\r\n\"I look from the wings at the play you are staging,\r\n While my guitar gently weeps\r\n As i'm sitting here doing nothing but aging,\r\n Still my guitar gently weeps...\"\n\r\nOne of my favorites Bealtes songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nAnd the first \"celebrity\" to play in a beatles song was Keith Richards on Baby You're a Rich Man (oboe).\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\na great song from the great george harrison. the song is about paul, john, and ringo ignoring him in the studio while he's trying to play his guitar. he was coming up with some ideas and no one wanted to him play. bad times for the fab four. a great song anyway !!!\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nall my fav. beatle songs where written by george hes is fucking amazing. i read the same book mryswanson is right great book. i also went to liverpool on the \"magical mystery tour\" and got to see his house.lol.  RIP<3\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nlets all stop nitpicking!  i could say that in 1964, American DJ Murray the K was dubbed the 'fifth Beatles', or i could mention that Pete Best was the original drummer.  it doesnt matter.  the point is that yes, clapton played guitar on this song, and yes, it was a shining point in george's career.  phenominal song\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nHis guitar is sad because Pete Best left and Stu Sutcliffe died of brain damage.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nLet's not forget Billy Preston adding keyboards to many Beatles tunes.  I believe George mentions in the Anthology book/DVDs that he brought Billy in to lighten the mood during \"Let It Be\" sessions...\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nBilly Preston went to jail for drugs. I bet he was lighting doobies and not the mood.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nOne of Clapton's best songs...\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nawesome song. Clapton did a great job on lead.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nIn Help, they used an additional musician to play the flute...but he is not credited on the album. It's on You've Got to Hide Your Love Away.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nIt seems funny to me, that while there are 31 posts (32 with my pointless addition), not one of you guys has touched upon the meaning of this song...\n\r\nI have always viewed this as George Harrison looking at some chick, asleep in his bed, as he is playing guitar, and realising how insignificant he feels.\n\r\nAnyway, I love the \"I then look at you all\" line, it just sounds so awesome as it just trails into the intrumental.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\ni luv this song.  i knwo the whole thing by heart.  they've got some awesome instrumental stuff.  btw, ever heard the early synthesizer music they use at the beginning of Dr. Who?  Back to this song, it rocks.  its got the makings of one of the best songs ever.  one of...\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nQuiff, it's awsome you mention bout the instrumental bit there. That's one of my favorite moments in music, when you expect George to sing \"see the love, there that's sleeping\" but  the guitars drown that away, sort of in resentment. One of my first favorite Beatles' tunes.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nQuiff, it's awsome you mention bout the instrumental bit there. That's one of my favorite moments in music, when you expect George to sing \"see the love, there that's sleeping\" but  the guitars drown that away, sort of in resentment. One of my first favorite Beatles' tunes.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nlove the beatles, love george, love clapton. nicky hopkins was on something on the white album, and of course some random people on random instruments on all their albums. i think it was them who for some reason couldn't credit them at first. ahh getting my bands mixed up...\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nDamn, George... he was such a sympathiser. And yes, he was underrated. Anyway the meaning of this song is quite simple. He sees at the world, and notices that the love is dying. he can\\'t believe how some people are not open and don\\'t love each other anymore. So he ends up getting depressed and feeling sorry for everyone *awwwwwww*\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nthats definitely clapton. know why? cause it sucks. if it was george, it would have been so fuggin sweet.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\ni am listening to the song as i rite this:) such a beautiful song..George is understimated which is very unfair!he has written some of the best songs..even tho john is my fave..\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nMy favorite Beatles song, bar none. I remember when George died the radio kept playing that song, then my mother sang along kind of sadly because he was her favorite Beatle, too.\n\r\nIt's so smooth, and the melody's just haunting; I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nId recommend Peter Framptons version-very hard and blusey. However, no other versions can beat Harrisons.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nThis is a great song.  I am not keen on many of the covers although I do particualrly like the Eric and Paul version from the George tribute concert.  From Paul's beginning just with ukele in vaudeville style to the transfomed full belt version with eric on guitar at the end. a great idea, and a fitting tribute to the song by two talented musicians who loved George.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nThis might well be George's greatest writing effort. There's also no doubt in my mind that that's EC on the solo (tone, phrasing etc., George could spread out stylistically but that woman tone is definitive EC to me [not that I had any real doubts anyway lol])\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nI'm just curious if anyone knows who played the piano, especially during the intro? (not a trivia question lol I don't know)\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\n..firstly to amendmy ealier comment - it was Something that Paul did with the Ukele.  They follow on from each other hence the error.\n\r\nref Piano - I had assumed it was Paul\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nlol haha did ppl actually think paul died? hello he and ringo are the only two beatles still alive... that was just the beatles being crazy in their songs when they say i buried paul\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nGeorge Martin, The Beatles producer classified this song (along with Something) as the finest love song ever. And I totally agree. The lyrics are funny and all.\n\r\nBut really, I'd like it more if George was the one who played the solo. But then again, at that time, The Beatles are not on their best terms with each other. So when George brought Eric along George said (in the Beatles Anthology) that everybody suddenly got on their best behavior! Lol!\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nYeah, there are some people who think that some impostor has been masquerading as Paul for the past 40 years.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI don't think George and Paul ever sang in harmony in a song. Obviously George's voice is louder but it's still good to hear them sing together.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\napparently, originally there was another verse in the song were he says that john and paul should have there heads banged together!\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nI only recently started listening to the Beatles and they are now all i listen to. Cant believe ive gone so long without them.  but anyways as i have only just found them there is still a whole lot i dont know about them and im keen to learn. I keep reading in various places about pauls 'death' what is that all about? please can sumone explain!thanks\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nsuch a good song but then the beatles had so many good songs...\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nI honostly think this is the best Beatles song.  Mot people would probably say Let it Be or Hey Jude, byut this is just great.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nto rhink:\r\ni know that the sound of the song can b recreated live beacause i can play song on huitar\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\ni can play it on guitar sry :p\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nAll I can say, this is a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nwhat a fucking fantastic song. by far one of my favourite Beatles songs, George is a little legend for writing it. I love the acoustiv version of it better than the album version. LOVE THIS SONG!\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI only first heard this song when paul mccartney and eric clapton performed it during the queen's golden jubilee concert and i remember crying through it! So emotional, love the lyrics, great song!\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nThe end of George Harrison's track \"While My Guitar Gently Weeps\" has Harrison seem to be calling \"Paul, Paul, Paul...\" \n\r\nHaving to do with Pauls \"death\" of course.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nfirst time i heard this song was during the Cirque du Soleil show they got for the beatles in vegas Love (amazing show by the way, i strongly recommend it). it immediatly became, along with \"because\", one of my fav beatle songs. \r\ni actually think it has to do w/ george's fustration with paul and john. there he was creating one of the beatle's most beautiful songs and he was still underappreciated musically. i sadly think paul and john might have deprived the world of great songs george could've written.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nomg its so great. it has left me speechless.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nIm a fan of harcore and metal, but this is one of my favorite songs, top 10... Great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nI love this song, definately my favorite, the other songs don't stand a chance.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\ni love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nI look at you all see the love there thatâ\u0080\u0099s sleeping\r\nWhile my guitar gently weeps.\r\nI look at the floor and I see it needs sweeping\r\nStill my guitar gently weeps.\n\r\nEnough said.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nI've tried to repress my mind from flowing\r\nWhile my guitar gently weeps.\r\nHe died in the car and I know you're unknowing\r\nStill my guitar gently weeps.\n\r\nThese are the original last verse. The rest of the Beatles didn't want George to sing it, since it gave away to much about Paul's death, so they took it out.\r\nNaaah, I'm just messing with you, Paul is alive and George was great.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nbest song from the beatles\r\nin my opinion\n\n\r\ni got stoned to it hahaha\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nyeah finally a fellow believer!! paul is dead and no one believes me\n\r\nif you are a believer e mail me Soccer10tc@aol.com and tell me the clues you know (i know them all but tell me anyway)\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nSpineshank covered this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\ni took guitar lessons just to learn to play this. \r\n\"what a fantastic fucking song\" plain and simple. \r\nthe acoustic version is the best.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nthis is one of the best beatle song. It talks about how people don't know how to love because they were never shown love.  you probably can gain love by experience but it difficult. just like the kids that grew up abuse they can't give love.  it's also a smack at patty saying that she left george because she don't know what love is.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nGeorge wrote this song before Pattie officially left him. In reference to Pattie maybe he was thinking about the affairs she had with all his friends!\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nthis song is about a guy who loved a girl but she turned him down (I donâ\u0080\u0099t know why nobody told you\r\nHow to unfold your love). afterwards, he's so depressed, all he can write are sad songs (my guitar gently weeps). the rest of the song is about him observing that life is going on around him (I look at the world and I notice itâ\u0080\u0099s turning), as he is stuck in his sadness and can't move on. what about the part of the song: \r\n\"I look from the wings, see the play you are staging, \r\nWhile my guitar gently weeps\r\nAs I'm sitting here, doing nothing but aging\r\nStill my guitar gently weeps\"?\r\nI have the Beatles Anthology and on While My Guitar Gently Weeps this verse is sung after \"No one alerted you\". Maybe they didn't keep it in the final cut. I don't know why though, because it's really good\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nI still, except for the Anthology III demo version, prefer the little-heard version by the Jeff Healey Band (off the record Hell To Pay)... George played guitar on it, but as was typical of him, he was content to just sit back and just be part of things.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nI've always felt like the title is how some people get their emotions out. They don't cry or make a fuss but their music (guitar) weeps for them.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nI always thought the song was self-explanatory...it was his sadness and inability to understand how people can be so cruel to one another. And--as a serious musician, like George, should--he's letting his guitar do the talking, but all the guitar can do is weep at all the despair in the world...\n\r\nI think the outtake to this song is SO much better than the album version. So beautiful and raw...\n\r\nI also think they did an amazing job on this song in Across The Universe...Martin Luther McCoy has such a great voice...and such a talented guitarist! The guitar solo sent chills down my spine!\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nthere are always so many storys around about the beatles im never sure which ones to believe lol. but im a beatles gurue! John lennon is a hero. George impressed me with his efforts he didnt ahve as much talent as john or paul but def jsut as much heart. thats what i love about this song! its so amazing! def. in my top 3 fave. beatles songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nI also love the across the universe soundtrack version of this song it is more modern but still amazing and i cry whenever i hear it\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nSo, who says what at the very beginning of the song? Or is it at the end of Bungalow Bil? \"Hey all\"?\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nI really don;t know exactly what this song is about, but It seems to me that it's a very emotional song, but that it's sorta like no matter what you do, the world is still spinning even if you make mistakes. Even if you aren't paying attention life happens.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nas George Harrison was interested in Eastern concept and he wrote this by I Ching in head (everything is relative to everything else), I think he blames himself through the song, somethings not good is happening (\"love there that's sleeping\" and \"you were diverted\" and ... ) while he and his guitar JUST gently weeps !\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nHere's one for you Paul is Dead enthusiasts...\n\nas you can see you cannot point to a stanza where he is talking about a women. if you think in a sense of paul being dead it will open your eyes.\n\nfirst line: I look at you all see the love there that's sleeping\n-This is George talking about paul sleeping aka dead\nStill my guitar gently weeps\n-it is still bothering him and he is still affected by the death\nI don't know why nobody told you\n-He is talking to us fans saying he doesnt know why they never came forth with this news \nI don't know how someone controlled you\n-this is a direct shot to the new imposter paul, which George continusously called him \"Faul\" in his later life aka Fake Paul (look it up i had a good laugh)\nThey bought and sold you.\n-the government and record company continued the business and stole and sold his life.\nI look at the world and I notice it's turning\nthe world goes on without the knoweldge of pauls death \nWhile my guitar gently weeps\n-but it is still hurting George\nWith every mistake we must surely be learning\n-he obviously understands the mistake\nI don't know how you were diverted\n-he doesnt know how pauls course of life changed\nYou were perverted too\n-in old english perverted meant to be distorted and corrupted just as his legacy was after death.\nI don't know how you were inverted\n-Pauls legacy was changed\nNo one alerted you\n-Obviously without pauls approval, no one could let him know...\n\nJust a thought to you all. if your looking for fun, look up some paul is dead videos. its quite interesting. also the videos of George in several interviews calling Paul.. \"Faul\"\nRegardless if Paul is dead or not, Paul and the imposter are great musicians, it makes me wonder what pauls legacy would really be like if he actually lived..\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nIt means open your eyes, look at the floor you're standing on, look at the world that is turning all the time, look at the love we all have inside of us if only we were willing to let it show. It isn't his guitar weeping, it's him, crying for everybody because we're all rotten, bought and sold, deserted, you know, all the bad things. And at the end he's not crying for 'Paul' or 'Faul' he's just CRYING.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nThat's John sayin, \"eh, up\" at the intro.\r\nOne of the best George Harrison songs EVER! Sometimes I like the acoustic version on Anthology better. Makes it a much simpler song.\r\nIf you play guitar, then you know how fucking awesome this song is, with George & Eric playing together! It's a very underrated song. Way better than a lot of McCartney shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nWHOLLY CRAP! WE FOUND The Fool On The Hill! Who see the sun going down and the world spinning round! \n\nGeorge Harrison was the deepest thinker of all the Beatles and that`s what the 2 songs are about. About what he saw, see`s.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nI love this song. It's incredible. Melancholy absorbs me every time I listen to it, but its beautiful. I've always interpreted this song as George venting his frustration/incomprehension at the world around him, metaphorically weeping through his guitar.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nGeorge harrison reached out to his spiritual beliefs for guidance in his tumultuous life. \r\nHe wasnt receiving the recognition for his amazing talents as a writer,  amazing guitarist and ear for music that only comes along once a decade (if even that often.)\r\nHe was the one John and Paul depended on to find the chords for pretty much all of their songs even after the Beatles disbanded. \r\nWe all know what it feels like to not be appreciated or to not get the proper recognition. \r\nGeorge reached out to his audiance as well as his spirituality, like most artists he shared his pain with those who share it.\r\nThe lyrics are directed to the people that dont feel or are caught up in themselves and dont have empathy, but I feel he was speaking to those that gently weep like him \"his guitar\".\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nOkay believe it or not I've met and spoken to Eric Clapton about this song, and he claims he didn't play on the studio recording at all...According to him George was just overwhelmed by the response to the guitar solo, and chose to shy away from the recognition.  Go figure!\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nOkay, I lied... I've never met Clapton and he actually did play on the studio recording.  I just wanted to see if anyone would actually respond... Sorry.\r\nPS. I did see Clapton in concert, pretty cool!\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nAT THE END OF STRAWBERRY FIELDS FOREVER HES SAYING \"RASPBERRY SAUCE\" GET IT B/C IT STRAWBERRY FIELDS...YEAH..THAT COOKEY JOHN,THATS HIS HUMOR...BUT ANY WAYS THIS IS A GEORGE SONG I LOVE HIM..THE MAN IS HORRIBLY UNDERRATED-HE'S A GENIUS!\r\nAND HE ROX-YOU KNOW WHAT I MEET PAUL SIMON OR DID I?I SAW THE SATURDAY NIGHT LIVE W/ PAUL SIMON WHEN GEORGE WAS GOING TO SEE ABOUT THE MONEY FOR ALL THE BEATLES TO BE ON(I KNOW IT WAS JOKE)]\r\nAND THEY SANG HER COMES THE SUN AND PAUL SIMONS HIT-HOMEWOURD BOUND AND THEY SANG SOME OTHER GREAT SONGS-BUT ANY WAYS IT WAS GREAT-HE TRADED IN ONE PAUL FOR ANOTHER!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nI don't know if anybody mention that prince did this song with tom petty, George's son and a couple other people and Prince killed the solo. The video is on youtube. George was so underrated.  \t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nGod i hate you all just tell what you think the song means stupid faggots\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nThere is only ONE version of this song. The live version featuring Clapton.\t\t\t\t\n\t\t\t\t\n\n"}