{"comment_0": "\nI know this may sound a little dumb, but I always liked to think of this song being sung in the perspective of the man in prison telling the others he shares a cell with why he's in there in the first place, with the Whiskey being an actual bottle of Whiskey that is being passed around by the prisoners.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nJust as a point of interest, these are the original lyrics as my grandmother used to sing them....\n\r\nAs I was going over the far famed Kerry mountains\r\nI met with captain Farrell and his money he was counting. \r\nI first produced my pistol, and then produced my rapier.\r\nSaid stand and deliver, for I am a bold deceiver,\n\r\nmusha ring dumma do damma da \r\nwhack for the daddy 'ol\r\nwhack for the daddy 'ol\r\nthere's whiskey in the jar\n\r\nI counted out his money, and it made a pretty penny.\r\nI put it in my pocket and I took it home to Jenny.\r\nShe said and she swore, that she never would deceive me,\r\nbut the devil take the women, for they never can be easy\n\r\nI went into my chamber, all for to take a slumber,\r\nI dreamt of gold and jewels and for sure it was no wonder.\r\nBut Jenny took my charges and she filled them up with water,\r\nThen sent for captain Farrel to be ready for the slaughter.\n\r\nmusha ring dumma do damma da \r\nwhack for the daddy 'ol\r\nwhack for the daddy 'ol\r\nthere's whiskey in the jar\n\n\r\nIt was early in the morning, as I rose up for travel,\r\nThe guards were all around me and likewise captain Farrel.\r\nI first produced my pistol, for she stole away my rapier,\r\nBut I couldn't shoot the water so a prisoner I was taken.\n\r\nIf anyone can aid me, it's my brother in the army,\r\nIf I can find his station down in Cork or in Killarney.\r\nAnd if he'll come and save me, we'll go roving near Kilkenny,\r\nAnd I swear he'll treat me better than me darling sportling Jenny\n\r\nNow some men take delight in the drinking and the roving,\r\nBut others take delight in the gambling and the smoking.\r\nBut I take delight in the juice of the barley,\r\nAnd courting pretty fair maids in the morning bright and early\n\r\nmusha ring dumma do damma da \r\nwhack for the daddy 'ol\r\nwhack for the daddy 'ol\r\nthere's whiskey in the jar\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nOne of my all-time fave partyin' songs...Metallica improved SO much on the original with this cover...\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nalright, this song was written A LONG TIME AGO. Thin Lizzy first recorded it though. It's a folktale about a highwayman that robs a man and brings it back to his wife and ends up in prison \t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nAbout a theif who stole things from others to make his girl happy, but then was betrayed by her.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThe problem is that the betrayal isn't in the Metallica lyrics. Perhaps in the Metallica version, he gets away from Captain Ferrel, and marries Molly (the ball n' chain).\n\r\nIn the Dubliner's version, the hero is betrayed, and must escape prison.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ni just like the song it rocks\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\ngreat song, metallica rocks!!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nActually, betrayal is also in this version.  \"For the devil take that women, for you know she tricked me easy.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis song is a GREEAT new intrepretation of the original song. Always worth of listening.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nWat a gr8 song thats all I can say I love metallica and they rule.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\n\r\n NO FUCKIN WAY. This song is a metaphor for how a woman leaving you is just like being an alcohlic. \n\r\n\"Now some men like the fishin' and some men like the fowlin' \r\nAnd some men like ta hear, ta hear cannon ball a roarin' \r\nMe I like sleepin' specially in my Molly's chamber \r\nBut here I am in prison, here I am with a ball and chain yeah \" = losng all passion in life for \"her\" the drink.\n\r\n\"She swore that she'd love me, never would she leave me \r\nBut the devil take that woman for you know she treat me easy \" is like when yu think youll feel that good forever and it ends when you sober up.\n\n\n\n\n", "comment_12": "\nyou guys are stupid, metallica themselvse said this was an old irish drinking song. in fact its on a folk album from ireland.Thin Lizzy used the basic lyrics and sound of it to make a horribly shitty song, metallica covered it again and came out with an awesome song. phhh betrayal they are singing about long ago when there was bartering and pirates...idiots!\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nMetallica did a great cover of this song. I luv it! I agree with CrimsonGhost666...\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nDeffinetly an inspirational video.......if u've seen it u know what i mean\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nok, im irish myself so ill clear it up. I hav the original dubliners song, so i know. A man holds another man up for money, captain farrell. He brings it back to hi wife. One night, he comes home drunk, \"hence whiskey in the jar\" and finds his wife in bed with captain farrell, so he shoots him. He then goes to jail for it \"ball and chain yeh\"  In the orignal version, the wife filled his charges up with water, and he cudnt shoot it when he went to kill farrell. Instead of lizzys ball and chain verse, there is a verse which includes \"if anyone can help me, its my brother in the army.\" the song is NOT a metaphor.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nthis film clip rox (with an x). the song reminds me of my mates house where we used to piss up each weekend and this was our theme song. hehe! kinda like in the clip.. hey.. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThe guitar in the song KICKS ASS!!! i just recently became obsessed with guitar and damn can metallica play some hard ass guitar! this song is defintly one of my fav. Metallica songs!! :-D\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\ni LOVE this song, i think it is the greatest song metallica ever did. i agree with sweetdepression23, the guitar in it kicks ass!!\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nall I know is that this is a Thin Lizzy song, and the Mush-a-ran-duma-duma-ma-da thing is part of a irish drinking thing,form what I've heard,so don't quote me on that part,but it is a Thin Lizzy song,the only people who know what the song is about it them....but DAMN,do I love this song!!\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nif u like the song i REALLY sugest u chack out this site stickdeath.com/… this animation by stickdeath is AWESOME!!!!! it really does a great job of showing what the song means... and yes this song does rock :-P it takes awile to DL form stick death but once u see it you will wana see it again. later\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nJust Got This Song Today... I Like Classics of Metallica like Enter Sandman, Master of the puppets and such so I listened to this 1 and its surely 1 of my favs... Rock on\n\r\n-Stix-\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nThin Lizzy took and old Irish drinking song and disgraced Irish people everywhere with their version. For many years, the Irish suffered with the knowledge of this burden. Then, one day, a band of gods took the song and transformed it into one of the best drinking songs and hard rocking songs heard on the radio. The Irish where now happy, as they where blessed with the one force that change a shitty song into a headbanging classic: Metallica. And the Irish continue to drink happily to the old tradtional version, but never forget once a party really gets going that it' time to take it up a noch. The end.\r\nP.S. If the Irish didn't drink, they would rule the world!\r\n(In case you didn't take the hint, I am Irish hehe)\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nstickdeath.com made a \"music video\" for this song by Metallica...go check it out at: stickdeath.com/…\n\n\n", "comment_24": "\nhands down, this's the best metallica song ever.  this is the only metallica song I enjoy, except for Tuesday's gone\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThankyou to the actual Irish members for getting this right. I'm of Irish descent, with a Farrell or two in my family, so its nice to have someone get this right. Its a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nthis song was originally by metallica and shows what a great songwriter cliff(rip) has become.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nActually at first I didn't realize this was a cover of a folk tune either - I actually ran across it a little later while browsing through folk tunes on mp3.com - and thought \"holy crap\" to myself hehe. \r\nMetallica needs to cover more folk tunes - this one came out awesome :)\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nwho carse what its about i a scot and we drink an rock as hard if not hardeer than any1 else adn i dont no any one who doesn't like the original and this version but i've yet 2 find sum1 who likes thin lizzys version heck even my anti-rock 58 year old grandad likes this version and cranks it up in the car\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nThin Lizzy's version is good, just different. i like them both. \"The Whiskey In The Jar\" part is an allusion to women. at the time this song was originally written, 'jar' was a common metaphor for the female genitalia, as well as being a container in which whiskey was kept. so in a allegorical way, he is saying that being in love is like being drunk. whiskey jars and the female genitalia both have in them things that will fuck you up, basically. so basically the song is about the evils of women and drink and how you`ll end up fucked by both of them.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nalso, one of the many different versions of this song is done by The Pogues, i think it is the closest to the original version i have seen. Thin Lizzy changed the lyrics alot, and most versions of it since then have covered their version, but The Pogues do a version more true to the original.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nThere really is no original lyrics to this song. It was created by drunk irish men in a pub, the drunk men plug in what ever names they want to and sing whatever verses they can remember while in their drunken state. So, the lyrics always change. But this song is an unbelievable cover! James' voice kicks ass and the guitars are killer. Best song on the first disc by far!\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nthe song paints a very different picture than the video does....metallica's video of this song was nothing but people dinking singing and women making out.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nyet again metallica prove there the only band to make a cover song better\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nCaptain Ferrell was an irish constable from about 150 years ago. thats all i got. and i love metallica, as all of you others do\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nguitarist 10, its not even their own song but a great cover. but thats not the point, metallica has much better songs that are theirs. go listen to more of it man\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nthis song is fucking amazing. No other way to put it. There aren't even words to describe how well metallica did this song, how great their version is. It proves how legendary metallica has stayed over the years, and how legendary they will remain. fuck anyone who said 'tallica went downhill after Black. This song proves those sons of bitches wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nAmazing cover, God I love this song.  \n\r\nBut does anyone know what, \"Musha ring dum a doo dum a da Whack for my daddy-o\" is supposed to mean.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\n<3 Metallica. One of my all-timers. Classic.  This is one of the greatest, i thik... I agree with whoever said that it's about a thief with a girlfriend. But what do i care? Love is stupid.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nThe song was just fine originally.  Why did Metallica of all bands cover this.  I could see, maybe, U2 but not Metallica.  God, someone needs to off them.  This just pisses me off.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nMETALLICA RULES!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nI'm starting to learn that people on this site are either ignorant, illiterate, or just rude. Read the post before yours. Of course it's an Irish drinking song, of COURSE we can't assign it an author... That's the spectacular thing about drinking songs. You sing them when you're drunk.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nBazal I've heard that version, every produced version of the song is a cover (or quite possibly a recording so that they could remember some semblance of the lyrics maybe?)\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nthis is an awsome song. i love metallica!!!! they fukin rock.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\no yea and i love to play metallica on bass guitar.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\no yea and i love to play metallica on bass guitar.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nThis song has changed over time.  It originated as a folk song and then Thin Lizzy recorded it.  Metallica was influenced by Lizzy and they did this as a cover.\n\r\nIt's the story of a thief who steals stuff for his girl and fights lots but then gets sent to jail.\n\r\nGreat song, better band.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nThis song is one of the best covers I've ever heard and it's even better live >_\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\tFlywireon November 14, 2004   Link ", "comment_48": "\nFUCK U irish deftone6!!!! I am sure every single metallica fan that reads ur fukin rude comment prays that u will die in a horrifice accident. so fuck u and i am sure that the only reason that u are sayin this is cuz u are jealous of metallica and how they are GODS TO ROCK!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nThe animation on stickdeath.com really puts the song in perspective and really helped me understand its real meaning. I highly recommend fans of this song see the clip.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nhonestly, this is an old irish folk song, and though metallica does a good version, the flogging molly version is better :). \n\r\np.s. to tell you the truth, metallica USED to be gods of metal, and ask any true fan these days, they'll tell you that they've sold out. Even Phil Anselmo thinks so...\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nwow dude why would you listen to old IRISH folf music.you half to have absolutly no life to do that.and all of metallica is good...so eat it!\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nmr.graves if you ask any true metallica fan they will tell you metallica didnt sell out metallica didnt go mainstream mainstream went metallica\n\r\nanywho this is a really cool song\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nmy favourite song in the universe! yummmm!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nMaybe this will help everyone, I love metal, but being Irish I love Irish Folk songs too, Here I will list all the differences between the Metallica and Folk versions\n\r\nMetallica: \"...Cork and Kerry Mountains...\r\nFolk: \"...Far Famed Kerry Mountains\n\r\nMetallica: \"...or the devil he may take ya...\"\r\nFolk: \"...For ye were a bold deciever...\"\n\r\nMetallica: \r\n\"I took all of his money and it was a pretty penny\"\r\nFolk: \r\n\"I counted out his money and it made a pretty penny\"\n\r\nMetallica:\r\n\"I took all of his money yeah I took it home to Molly\"\r\nFolk: I put it in me pocket and I took it home to Jenny\"\n\r\nMetallica: \r\n\"She swore that she'd love me, never would she leave me\"\r\nFolk: \"She sidled and she swore that she never would decieve me\"\n\r\nMetallica: \r\n\"But the devil take that woman for you know she treat me easy\"\r\nFolk: \r\n\"But the devil take the women for they never can be easy\"\n\r\nMetallica: \"Whack for the daddy-o\"\r\nFolk: \"Whack Fol-de-dol-de-o\"\n\r\nMetallica:\r\n\"Being drunk and weary I went to Molly's chamber \r\nTakin' my money with me and I never knew the danger \r\nFor about six or maybe seven in walked Captain Farrell \r\nI jumped up, fired off my pistols and I shot him with both barrels\"\r\nFolk: \r\n\"I went into my chamber all for to take a slumber\r\nI dreamt of gold and jewels and for sure it was no wonder\r\nThat Jenny drew me charges and she filled 'em up with water\r\nThen sent for Captain Farrell to be ready for the slaughter\"\n\r\nMetallica:-Nothing-\r\nFolk:\r\n\" 'Twas early in the morning just before I rose to travel\r\nUp comes a band of thug men and likewise Captain Farrell\r\nI first produced me pistol for she'd stolen away me rapier \r\nbut I couldn't shoot the water so a prisoner I was taken\"\n\r\nMetallica:\r\n\"Now some men like the fishin' and some men like the fowlin' \r\nAnd some men like ta hear, ta hear cannon ball a roarin' \r\nMe I like sleepin' specially in my Molly's chamber \r\nBut here I am in prison, here I am with a ball and chain yeah\" \r\nFolk: \"Now there's some take delight in the carriages a rollin'\r\nand others take delight in the harley and the bowling\r\nbut I take delight in the juice of the barley\r\nand courting pretty fair maids in the morning bright and early\"\n\r\nMetallica: -Nothing-\r\nFolk: \"If anyone can aid me, tis me brother in the army\r\nIf I can find his station in Cork or in Killarney\r\nand if he'll go with we'll go rovin' in Killkenney\r\nand I'm sure he'll treat me better than me only sporting Jenny\"\n\r\nMaybe these difference will help you decipher the true meaning of this song. Hope I helped.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nis captain farrel the devil?\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\ncaptain farrel isnt the devil even though it said \"but the devil take that woman\". all that means is that molly betrayed him for captain farrel and farrel is just an innocent guy who deserved her more than he did. see the stickdeath filmclip at stickdeath.com/… (not sure if the url is right) and maybe you'll understand more\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nBack In the Day!!!!!!!!!!!!!!!!!1\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nwhen I listen to this song, I get so into it it's embarressing. :D\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nAs I was going over the far famed Kerry mountains\r\nI met with captain Farrell and his money he was counting.\r\nI first produced my pistol, and then produced my rapier.\r\nSaid stand and deliver, for I am a bold deceiver,\n\r\nmusha ring dumma do damma da\r\nwhack for the daddy 'ol\r\nwhack for the daddy 'ol\r\nthere's whiskey in the jar\n\r\nI counted out his money, and it made a pretty penny.\r\nI put it in my pocket and I took it home to Jenny.\r\nShe said and she swore, that she never would deceive me,\r\nbut the devil take the women, for they never can be easy\n\r\nI went into my chamber, all for to take a slumber,\r\nI dreamt of gold and jewels and for sure it was no wonder.\r\nBut Jenny took my charges and she filled them up with water,\r\nThen sent for captain Farrel to be ready for the slaughter.\n\r\nmusha ring dumma do damma da\r\nwhack for the daddy 'ol\r\nwhack for the daddy 'ol\r\nthere's whiskey in the jar\n\n\r\nIt was early in the morning, as I rose up for travel,\r\nThe guards were all around me and likewise captain Farrel.\r\nI first produced my pistol, for she stole away my rapier,\r\nBut I couldn't shoot the water so a prisoner I was taken.\n\r\nIf anyone can aid me, it's my brother in the army,\r\nIf I can find his station down in Cork or in Killarney.\r\nAnd if he'll come and save me, we'll go roving near Kilkenny,\r\nAnd I swear he'll treat me better than me darling sportling Jenny\n\r\nNow some men take delight in the drinking and the roving,\r\nBut others take delight in the gambling and the smoking.\r\nBut I take delight in the juice of the barley,\r\nAnd courting pretty fair maids in the morning bright and early\n\r\nmusha ring dumma do damma da\r\nwhack for the daddy 'ol\r\nwhack for the daddy 'ol\r\nthere's whiskey in the jar\n\r\nYes, I like the original version much more. Never heard the Thin Lizzy version. I don't like how Metallica changed the words, however. Sorry, just doesn't sound right.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nI say this song fuckin rox and anyone who says otherwise can \"suck an old man's cock\"\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\ni second to that\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\none of the best covers along with the man who sold the world by nirvana\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nK \"I Like beans\" you are really pissing me off youre just trashing the forums on every metallica song. ITS OFF GARAGE INC NOT GARAGE DAYS!!! Know your stuff before you dis it.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI'm pretty sure it's \"for you know she tricked me easy\"\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nThe fact that Metallica cut out the 20 second opening and the first chorus Thin Lizzy's version had was a disappointment, almost to the consideration of a failure, but Metallica made up for it by enhancing the main riff and the percussion.  James and Lars are seriously slammin it.  Thin Lizzy's version is awesome, but my reccomendation goes out to Metallica on this one.  What a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nomigod love this song. love metallica. rock on\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nomigod love this song. love metallica. rock on\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nomgsh, can you Greatest. Cover. Ever.?  Thin Lizzy wrote the song, but the original sounds like shit and has no energy.  This is the ultimate makeover for a song.  Metallica coudn't be any better.  There's whiskey in the jaro.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nhow do u no enjoy metallica guitarist 10 there guitar solos n shit are unreal and i enjoy them for more than just there all together music but there guitaring too\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nBest drinking song ever. I got sooo drunk on this one!:P\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nit's wierd, my Dad, who is from Ireland, used to sing this song a lot, then when I heard Metallica sing it, I thought it would be cool, but it SUCKS!!! it's a HORRIBLE rendition of a classic song. James' \"new\" voice is just DISGUSTING!!! he NEEDS to start screaming again, like he did in the glory days!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nThis cover isn't bad, but why do so many people think the Metallica version is better than the Thin Lizzy one? Sure, they made it heavier and everything, but of course its going to be heavier - Thin Lizzy recorded theirs in the early 70's FFS. Also, Metallica's lacks the emotion that Thin Lizzy had in theirs, in my opinion.\n\r\nAlso, why have people been saying Metallica did the original? How fucked up is that? It's on a covers album! Thin Lizzy didn't even do the original either.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nagree with the part that you said of differences between our decades, but metallica's version is full of emotion.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nhey guys..\r\ni think this song has got emotiion, but not as strong as \"Turn the page\" or \"Astronomy\", but its there...\r\nanyway, i think some of the lyrics are wrong..\r\n\"She swore that she'd love me, *no*never would she leave me\"\r\nand i also think james sez \"shot off my pistol\" not \"fired off\"..but great cover anywayz...\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nGreat cover. One of the few covers that better the original.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nBest video EVER!!\n\r\nGreat song too!\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nThis song was also done by The Irish Rovers.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\ni like this song cuz it talks about drinking lol is that lame? i dont know but this song sound really cool i listen to it and the unforgiven part 2 every night b4 i got to bed\r\nI LOVE U KYLE:0\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nyou're all morons.\r\nthe thin lizzy version is better.\r\nmetallica even liked it.\r\nthat's why they did a cover.\r\nyou idiots.\r\nshutup.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nIt amazes me how rude & intolerant of other peoples opinions young people can be....who the fuck are METTALICA anyway!...they're not worthy of wiping Phil Lynott's arse!\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nguy this is a really old folk song that no one knows where it came from\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nOk out of 4 pages of post the meaning of the lyrics are maybe mentioned a handfull of times. Now as far as the video goes , it has nothing to do with the meaning of the song, therefore blows. Farrantionion says; \"this song was originally by metallica and shows what a great songwriter cliff(rip) has become. \" proof positive that some people shovld never  breed. The song to me is about being betrayed by someone you trust/love even though what you are doing { in your mind } is for them. she is not cheating on him with the cpt. just turning him in . the water in the gun is so he doesn't kill anyone or get hurt as she still loves him. Oh by the way Metallica does kick some serious ass , but they need to remove the stick lodged in lars' ass. music didn't change to follow them ,they changed to follow the money.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nman everyones so opinionated about this song lol anway i think it's a good song if u wanna sing about being a badass irish folk song or not(i mean come on it's metallica!)\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nAnother POOR, POOR cover by Metallica. I mean they really went off the boil with Load and Re-Load then they try to sell us cover songs. If you want to hear the original and for the love of god please listen to the original then get Vagabonds Of The Western World by Thin Lizzy or as they say in Potatoe Land \"Tin Lizzoy\".\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nThis song along with man in a box changed my life.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nHey..this is a great cover by Hetfeild..i like the shit that he'z come up with..he'z always bringin out new ways to get the fans out of there crack pots..the vedio's a bit crumy..but the lyric explains it all...how money conquered love..this is a perfect xample of kick ass thrash metal....\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nlol i loved the original (a great drinking song) and i love this cover. this is the only bit of decent material they've released since \"and justice for all\". they've sold out, and have been sell outs and will continue to be sell outs. fuck em. MEGADEEEEEEEETTTTTTTTHHHHHHHHH\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nthe stickdeath things gay u fuckin need to grow up lmao\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nBut dont get me wrong metallica kicks ass and this songs great. I do agree about it having to do with the irish things and whatever\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nSorry nothing to do with meaning of lyrics... Metallica basicaly did Thin Lizzys version, as far as I can tell they (Thin Lizzy) changed the more traditional lyrics to the ones Hetfield used, but theres loads of slightly different ones anyway. The chorus is a lot quicker in all the records and proformances of the traditional version that I've ever heard, usualy with a lot of foot stamping between the lines. Great fun when your drunk. Hammett plays the guitar solo from TLs version as well, changes a few notes here and there, it was either Eric Bell or Scott Goram on 'Lizzys record I can't remember. As for the music, Metallicas is a bit faster, much heavier and just sounds so much better.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nthis song is aweome as\r\nif it wasnt for that riff at the start i wouuldnt have started listening to it as much as i did\r\nmetallica are f%%king awesome as and i listen to them all day on my MP3\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nwell i just like metallica, but i wud prefer it if he went back to his old voice, wen i first heard it' i thought it was about the highwayman, what with the \"stand and deliver\" bit. but now i know about the metallica version. stay as drunk, arguin babies that don't care about other peoples opinions and that think that anyone who thinks different to you must be stupid or somethin. cos that's what makes you who you are, assholes. bye fuckers! :P\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nJames voice recordings early on were shit.  The voice recordings from songs like this were good.  If the recordings were better back in the 80s, then Metallica would be better than they already are; if anything, only slightly.  Hetfield's a good singer, though, the early productions didn't bring it out.\n\r\nYa, Thin Lizzy cover.  They covered an Irish folk tune because they're, well, Irish >>  I find this better, possibly due to the heavier riffs and I like Metallica better than Lizzy.  Mind, Lizzy are the masters of acoustic/electric combination, but I like the power chords better >>  They're different styles; they made this song Heavy Metal where Thin Lizzy were Hard Rock.\n\r\nI do agree, Hetfield's voice lacked the emotion Phil Lynnot's had.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nThis song is not originally by Metallica!!!!!!\r\nor Lizzy or anything.\r\nIt is an old Irish drink song about 200 something years old. The original artist is not known ,but it was some Irish band. If you don't believe me type it in on wikipedia.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nThis song just rocks I dont really care what its about\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nThis song just rocks I dont really care what its about\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nActually the line is \"She's still more whore than she loves me, but never would she leave me\"\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nthe lyrics are just a story, no deep meaning any more than a story your told, and thin lizzy's version was better.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nWhile i agree with PearlJamRules that theres no deep meanings in the song, i think that Metallicas version is better.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nA lot of you are overthinking this. It's about a guy who steals all a guy's money, then uses to buy alcohol! Then, he goes to jail for it.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nThis is one of my favorite songs. Heard Metallica's first but I like all versions... also, I have an x named Molly who crushed me pretty good and so I wanted to know if â\u0080\u009cMollyâ\u0080\u0099s chambersâ\u0080\u009d meant anything, especially when I heard it in a kings of leon song.  â\u0080\u009cMollyâ\u0080\u0099s chambers gonna change your mindâ\u0080¦â\u0080\u009d  Anyway, I looked into what these lyrics might be all about and hereâ\u0080\u0099s what I found take it or leave it...  Itâ\u0080\u0099s a long one, I know but some of this fits together pretty wellâ\u0080¦\n\r\nas has been mentioned already by many, this is originally an old irish drinking song about a man who robs captain farrell, brings the money home to his girl, then gets betrayed by her and taken to jail. (he then breaks out and the last verse is about wanting to find his brother who will treat him more honestly than his girl did)... in that song though, its Jenny, not Molly. I admit that the name may have been interchangeable since lyrics of drinking songs are often changed by drunks like myself but at least in every version Iâ\u0080\u0099ve seen of the original so far itâ\u0080\u0099s â\u0080\u009cJennyâ\u0080\u009d. Obviously, thatâ\u0080\u0099s interesting to me since I was curious about the mollyâ\u0080\u0099s chamber part of the lyrics. It made me ask myself, why would Thin Lizzy who I think did the first rock cover have changed the name to Molly and the verse to Mollyâ\u0080\u0099s chambers (instead of my chambers or jennyâ\u0080\u0099s chambers)?  I started thinking that it might have something to do with the title being about alcohol or just being Fed up. An important point, I donâ\u0080\u0099t think you can rule the fact that this song has something to do with booze out completely even if it is an old story song. If you know anything about drinking a lot, loving a girl and feeling betrayed, youâ\u0080\u0099ll know thereâ\u0080\u0099s a pretty strong connection there, especially if youre a bit of a scoundrel yourself. So even in the original, I think the song is so good because its about all that stuffâ\u0080¦ anyway, I found the phrase in one other place - the book, â\u0080\u009cSilas Marnerâ\u0080\u009d by George Eliot (actually a woman) and hereâ\u0080\u0099s the excerpt: \n\r\nâ\u0080\u009cJust and self-reproving thoughts do not come to us too thickly, even in the purest air, and with the best lessons of heaven and earth; how should those white-winged delicate messengers make their way to Molly's poisoned chamber, inhabited by no higher memories than those of a barmaid's paradise of pink ribbons and gentlemen's jokes?â\u0080\u009d \n\r\nFits pretty well. One message I see is: â\u0080\u009cWhen youâ\u0080\u0099ve done wrong yourself and then wrong happens to you, itâ\u0080\u0099s tough to see that you brought it on yourself.â\u0080\u009d And thereâ\u0080\u0099s also the fact that the character in this book is hooked on opium and has a had filled with â\u0080\u009cno higher memories than those of a barmaidâ\u0080\u0099sâ\u0080\u009d Iâ\u0080\u0099m wondering if â\u0080\u009cMollyâ\u0080\u0099s Chamberâ\u0080\u009d came to mean anything after this phrase and if it was a term â\u0080\u009cthin lizzyâ\u0080\u009d  had in mind when rewriting the song. \n\r\nOr maybe George Eliot was making a reference to this old songâ\u0080¦ or maybe itâ\u0080\u0099s a total coincidenceâ\u0080¦ but even if either of those is true and the use of the word molly is just random or a result of there being an alternate original version that uses molly instead of jenny â\u0080\u0093 this song is definitely about cheating, loving, drinking, being cheated yourself by a woman and being sad, which I think its safe to assume leads to more drinkingâ\u0080¦ just because itâ\u0080\u0099s a folk song doesnâ\u0080\u0099t mean thereâ\u0080\u0099s no deeper meaning to it. \n\r\nOne more note: The Kings of Leon song (if you donâ\u0080\u0099t know the band, you may remember the car commercial with the song in it) sticks to the original version of the story where the girl takes the guys gun powder out of his pistol and fills the charges with water. The lyric in that song is â\u0080\u009cSheâ\u0080\u0099s gotâ\u0080¦ your pistol.â\u0080\u009d Check out the song and the band for that matter, their first two albums are damn good.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\ni havent heard metallica's version but i have thin lizzy's. it was ok. it would defentently make more sense if metallica was actualy from ireland\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nOk this is NOT the correct interpretation of the song, but when I first heard it, it meant this to me:\n\r\nSome (poor) guy is kicked out of the army (possibly for drunkeness), his \"boss\" or captain, was of course, \"Captain Farrell\". As he is heading back home to the only good thing in his life (his girlfriend Jenny/Molly) he sees \"Captain Farrell\", and knowing that his girlfriend will be pissed off when he comes home drunk, sacked and penniless, robs the fucker. When he brings the money home, she tells him she love him and she' never leave him. They have sex and he finds \"Whiskey in the jar\", if you know what i mean (basically, Jenny/Molly has been cheating on him with none other than Captain Farrel), when Captain Farrel shows up at Molly's chamber, he kills him, and is put in jail.\n\r\nIt just shows that no matter how much you love someone, no matter how hard you try to look after them or make them happy, if you don't have money there will always be some rich fucker trying to take what little you have away from you. The narrator of this song is an example to self-made men everywhere, don't let anyone fuck you about, stand up for yourself, look after you family and your friends and especially your girls, and if anyone tries to interfere, fuck them up.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nThis is one of my grandfathers favorite songs and metallica basically destroyed it. thanks metallica keep up the good work....tools\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nThis isnt the best cover I've heard. Personally Thin Lizzys is better and the Metallica version is just the same song with a cheesier drum beat with a handful of good fills. It would have been better if they tried to make it their own song. Check out No Quarter by Tool for an idea of what a cover should really be.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nhaven't heard thin lizz version, not my favorite metallica(bleeding me, of post black album stuff) system does best cover i've ever heard, they take black sabbaths snowblind and make it their own, no cover should be a note for note replay, what's the point.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nthey truly mastered this song with their rock version.  video is kinda gross with the chick taking a dump tho.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nI heard this song the other day, but couldn't for the life of me tell if it was a cover of the original Irish drinkin' song or not. (Considering the last time I heard the original drinkin' song, I was pretty drunk myself!) But I guess it is, and that makes me happy. Can't say I'm the hugest fan of Metallica, but this song's not too bad.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nHes a pirate.  \"first produced my pistol and then produced my rapier\"\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nI actually love this cover. \n\r\nThe video kinda sucks though, but most of Metallica's videos do, because the Unforgiven ones. \n\r\nI had this song playing on my phone yesterday, and my mother started singing it, i was like wtf?!\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\ni meant 'besides' not 'because'\n\r\nsoemtimes i type too fast and differnt words come up instead:S im lame i know\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nya this is some much better than thin lizzys.. thin lizzys was such a bore fest.... thank god for metallica!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nremake of a classic irish drinking song.  thin lizzy had a crap version which metallica covered and made awesome.  however the lyrics are not the same as one of the originals.  there are many versions of this song by the way.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nJames has sung this one so so so well!!\n\r\nespecially:\n\r\nNow some men like the fishin' and some men like the fowlin'\r\nAnd some men like ta hear, ta hear cannon ball a roarin'\r\nMe I like sleepin' specially in my Molly's chamber\r\nBut here I am in prison, here I am with a ball and chain yeah\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nApperantly a lot of you dont know that this song dates back to the civil war. Its also a lot longer in that version and i prefer its ending. But this is still a awesome song. \t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nits about a highway man who steals from cpt ferral  brings it to his lover she betrayshim he gets drunks goes to her place kills cpt ferral and is arrested\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nin the original song, Captain Ferrell is somewhat a bit of a seedy character.  That doesn't come out in this version unfortunately.  Molly was originally Jenny too.  And in the original, the main character believes that his brother will come bail him out of prison.  This version is alright, but certainly not the best, there's a great one by The Oddsods.  This song wasn't meant to be a downer, it actually was quite a fast paced song to teach a lesson about drinking and stealing (but people usually drank along while listening to it).  The Grateful Dead created a version of this that Thin Lizzy reworked.  If you look on Project Playlist you can find a whole bunch of Whiskey in the Jar versions.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nThis song rocks, you don't even have to know the lyrics. I think it's like this dude saying, well, I shouldn't have drunk and stolen, now look where I am, instead of with Molly.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nWatch the music video, then you'll really understand this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nThe first Metallica song I ever heard when I was like 7 or 8 years old.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nhey there its about a thief or highwayman that was betrayed by his lover etc its a famous irish song that comes from strong anti british sentiment by the irish  towards the british ascendancy: landlords captains etc though im fuzzy on my irish history the word boycotting comes from one of those captains \r\nthis song probably comes from around 1870-96 era when a co-ordinated anti landlord campaign was undertaken by the irish tenants towards the landlord \n\r\nwell thats my two cents\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nIt is one of my favorite cover songs Metallica did, and I love to listen to it when I'm saddened. \r\nAnd it's about, I think, a girl betraying a guy after he robs stuff. Mmmhmm. ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nOk, for your consideration, Thin Lizzy changed the lyrics in a perfect way to tell their version. This is what I believe they were thinking (Not necessarily the old Irish Meaning).\n\r\nHero (for lack of a better description) is a Pirate. Captain Farrell is a Pirate Captain. They make land after a Successful Pirate Raid and Hero seeks out finds Captain Farrell and \"produces his (1) Pistol and then his Rapier (Sword)\" (important point later). He takes the loot to his Molly and wants her to run off with him (he can't stick around, Captain Farrell will catch him if he does).\n\r\n\"Mush a Ring Dam a do dam a da\" is Molly stammering trying to think of how to deal with the situation, because, although she loves it when he comes off his raids with a dollar or two, she's not going anywhere with him. She gets the idea to stall the Hero until Captain Farrell can get there, by saying she doesn't want to leave without first saying goodbye to her Father:\n\r\nMolly says:\n\r\n\"Wait for my Daddy. Oh, there's whisky in the jar.\" \r\nHe grabs the jar of whiskey and Molly and starts for Molly's chamber and Molly says \"Oh\". \r\n\"Wait for my Daddy, Oh, There's Whiskey in the Jar, Oh\"\n\r\nWhen Captain Farrell enters Mollyâ\u0080\u0099s Chamber the song goes \"I jumped OFF, fired off my pistols and I shot him with BOTH barrels\". Remember eariler he produced his Pistol and then his Rapier. He only had one Pistol. The second pistol was his Cock, which Molly had been holding onto to prevent him from finishing the deed before Captain Farrell can get there. In support of this interpretation, the last trailing/fading out lines are â\u0080\u009cI loved, I loved, I loved my Molly and she was holding my barrel. That dirty child that dirty, dirty, dirty childâ\u0080\u009d.\n\r\nI believe his prison is not a real prison but a reference to Molly leaving with him, now that Farrell is dead and stained.\n\r\nI love this song by Thin Lizzy. Metalica is a little hard for my tastes, but am very glad that the next generation put their Stamp on it!\n\r\nIâ\u0080\u0099m just saying!\n\n\n", "comment_124": "\nThis is not just a simple tune nor is it merely a \"bunch a rhymin' words\".\r\nIrish songs are Irish stories.\r\nIrishmen are proud story tellers..,they are the\"Bards\" of whom Shakespeare wrote in his plays.\r\nFrom town to town the news of the land was spread by the tales told by these 'Bards'and then ...,\r\nthen it found itself being repeated again and again,until it took on a rythm and melody of its' own.\r\nThus a song was born that would keep alive the tale.\r\n\"Whiskey in the Jar\" may seem a whimsical title at first glance.\r\nHear the words and recognize them for the time from whence they came and you instead will find a dark novel playing out before you.\r\n   The highwaymen were Irishmen who fought against the tyranny being imposed by the occupying British Empire.\r\n   They were the \"Robin-hoods of Eire\" .\r\n { Picture this--there are some who could say that we[the Irish] were the last gasp at the British attempt of maintaining some sort of slave/servant cast.}\r\n  Ireland needed Heroes.\r\n  When these songs are played now---I WILL TELL YOU THIS--IT IS RIDICULOUS AND DEMEANING TO THE SONG TO HEAR ANYONE SAY IT IS NOT BEING PLAYED CORRECTLY.\r\n   THE MOST IMPORTANT THING IS THAT THE SONG IS PLAYED,THE SONG IS SUNG,AND THE GETS TOLD AND IS NEVER FORGOTTEN.\r\n   Seems simple to me ehh?\r\n     \"9/11 Gone but not forgotten\"\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nFirstly: \"Whack\" was a British sailor term (and later, for sailors everywhere) for the \"daily ration,\" that was specified by law. It was a very specific minimum standard for both food and water, even salt. It became slang for all folks of that time, and everyone knew what it meant. So \"Whack for my daddio,\" means something like \"this is all I need,\" the \"whiskey in the jar.\"\n\r\nNo luck deciphering the \"musha ring ...,\" so far.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nFuck that big daddy guy if they have no talent then why are they one of the worlds biggest thrash metal bands some people are quick to judge some one else's talents when they can't even do what they do any where near as good \t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nI kind of have the feeling that Molly, or Jenny is in fact guy's drunk state of mind, thus the title. Makes some sense when you read the rest of the lyrics that way.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nWTF ARE U ALL TALKING ABOUT NO BETRAYAL!?! it doesnt matter if betrayel isnt in Metallicas songs cuz this ISNT METTALICA SONG!!!!!!! it is a cover as is the entire Garage Days album u boners!\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\npersonaly to me i think that this is metallicas crapest song to date. i love and admire metallica but honestly this song sucks, theres too much of a punk vibe going on.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nAm I the only one who thinks Metallica raped an amazing song? The only good version of these besides the classic folk version is The Pogues. Now, I love hard rock or punk versions of traditional folk music. Hell, I love Dropkick Murphys and all that sorta thing. But, Metallica fucked this one up and the lyrics they use are total shite.\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nOh, and if anyone cares to argue...feel free to drop me a line.\r\nAIM- OUTPATIENT44\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nSomebody please kill Metallica.  They have a handfull of \"good\" songs.  I pray everynight that they will die in some horrific accident.  The gods of all that suck:  Metallica.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nthis is by far the worst fucking cover of this song ever!! Lynott n thin lizzys version is way better than this shit version...metallica should be lined up n shot....and irish folk fucking rocks man ...christy moore rock on!\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nthis is by far the worst fucking cover of this song ever!! Lynott n thin lizzys version is way better than this shit version...metallica should be lined up n shot....and irish folk fucking rocks man ...christy moore rock on!\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nthis song about f*** drunk party ..haha\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nThis is the crappiest cover ever. I'm sorry but the original song is so much better. or even the cover from the starlite singers isn't bad. But this is crap. I really think people should not go and ruin great songs like this. No offense to metallica because I like a few of their older songs but this honestly sucks. \t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nThin Lizzy's version will always be THE BEST. Metalica's failed attempt is aweful. Thin Lizzy was a better band then Metallica and even Metallica admits to have been heavily influenced by Lizzy. Thin Lizzy's live album, 'Live and Dangerous' was voted the #1 greatest live album of all time. Chew on THAT one my little, headbanging friends. \n\r\nps, Lynyrd Skynyrd is way better then Metallica too.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\n\"Whiskay in the Jar-o\"....yeah great re-make you talentless ass clowns\n\r\nLars Ulrich is a COMPLETE DOUCHE!\n\r\nSad that ALL the talent in this band died on an icy road in 1986.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nNo. Just...no. This song cannot be remade. Especially not by Metallica. It is not that kind of a song.\t\t\t\t\n\t\t\t\t\n\n"}