{"comment_0": "\nThis song is tough as hell because it's so damn true.  All the soccer mom's out there are gonna flip when they hear this.  I'm glad Eminem is using his influence and anger to attack something for a purpose, the increasing limits on freedom of speech in this country.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis is the best song on CD and possibly best of Eminem's career. Anyone who doesn't like it is just afraid of life and whats real.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song is to true ''  kids Flipped When they knew I was produced by Dre '' if this didnt happen nothing would have for him '' If i was black i woulda sold half  ''   LOL too true    \n\r\n''Actin like im the 1st rapper to smack a bitch or say faggot ''actually he might be but i dont know \n\r\n''I go to TRL Look how many hugs i get '' That is true \n\r\nThats all i got good song . if u have a problem with what i said tell me\n\n\n\n\n\n", "comment_3": "\nI think he's realizing something here.\n\r\nHe's against the government thinking for everyone and the big companies doing the same thing but then as soon as he goes out there and moves these people, he's the big company.  He's the one thinking for everyone.\n\r\nSo the problem, is the American people who have to follow someone and can't lead themselves but also the government/big companies for taking advantage of that.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nhahahaha i love this song it always makes me laugh\r\ni grew up in a super white rich neighborhood and none of my friends liked rap till eminem its so true all the girls thought he was really cute and all of are parents thought it was fine cause he is white and then they heard hi lyrics \n\r\nso thats why i love this song because its so fuckin true\n\n\n", "comment_5": "\n8.  fuck you with the freedom *of* speech this divides states of embarassment....\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nBest song on his album, I think so.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nawesome song. puts things in perspective\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis is a sick song, he should make more songs like this.  I think this whole album is bit harder or more metalish compared to his last album. \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nthe best part of this song is that eminem hits the nail on the head so well that parents are gonna freak. especially the trl part. the whole album is great\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nthe best song i ever heard..im living in america..but seein everything how he is\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nat the end of the song it goes\r\n *hahaha! im just playin america, you know i love you *\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\ndamn this song just rock, Em sure knows why hes popular\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthis song is sick! i love it! it really makes you think. the last line of the song is so funny\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\ni think this song talks about his old shit and this explains that it wasnt his fault 9/11 happened just because all of america knows he's angry. and it isnt his fault. he's an artist.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThis is gonna be Em's 2nd single. I wonder what the video will be like!? \t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nya ya the song kicks ass but god dammit it aint \"look at myself\" its \"look at my sales\" GEEEEEZ stupid kid\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI never would've dreamed in a million years I'd see it, \r\nSo many motherfucking people, who still like me\n\r\nSHOULD BE\r\nI never woulda dreamed in a million years I'd see\r\nSo many motherfuckin people who feel like me\n\n\n", "comment_18": "\nIt doesnt say i shoveled shit on my life and dumped it on em it just says i shoveled shit on my life and dumped it on     WHITE AMERICA\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nCORRECTION!!!\n\r\nIts NOT\r\n\"to burn the casket and replace it with a...\"\n\r\nIf you reverse it, the word that is supposedly \"casket\" is flag... Eminem just said \"flag\", and reversed it!\n\r\nThe same thing happens on Hailie's Song..\n\r\n\"i'm so glad that her mom didn't.... \"\r\nIts \"want her\" if you play it in reverse.. \t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nSashmo69 messed up big time.\r\nCheck out my version out in the Eminem lyrics home. I have it down pat everyone. Thank-you.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nmy sales goddammit...not \"look at myself\" ,  look at my sales...SALES\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\neminem rocks and i believe this is one of his best songs ever... im not sure why.. i hated it at first.. but pay attention to the words.. they make sence...\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nwhat a relevant song.  eminem is one of the most clever emcees ever, he definetly has the pop appeal to say what needs to be said and get the message across.  i just worry that most of the kids who listen to his music just to get laughs or hear vulgarity, i suppose he's good for that...but his music is smart.  and it's too bad most people can't get that past their thick little skulls.  this shit is important.  so pay attention, you might learn something.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis is a great song. I just saw the video for it at RollingStone.com. You guys should check it out it's good. After watchin it, I'm not sure MTV is gonna air it. They can be pretty sensitive... But, then again, it's an Eminem video. They'll want the ratings he'll bring in.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nCORRECTION\n\r\nIf they were brown\r\nShady LOSE Shady sits on the shelf \t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI was watching the MTV Music awards and when Eminem came out he sang a small part of this song and in the background it had all these senetor like people throwing stuff at em.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nEDIT: Removed.Edited by matty on February 14 2005, at 11:05PM\n\n\n", "comment_28": "\nI HATE EMINEM !!!!\n\r\nHAHAH\n\r\nIM JUST PLAYING EMINEM , U KNO I LUV U\n\r\nWHITE AMERICA!!!\n\r\neveryone go to this web ... cannibal's  web sux  , this is better ... it has a sense of humor and isnt so tight ass ;)\r\nand no im not sayin white people are trash , im white .. i just wanna even out the score since cannibal is such a DICK!!\n\r\n**Removed**Edited by matty on February 14 2005, at 11:07PM\n\n\n", "comment_29": "\nhmmm nevermind my angry words... cannibal is only 16 ... next time im checking the age before responding ... ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\neminem sucks you wanker\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nwanker ?  whats a wanker ?? :)\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nwow..how many people can get away with saying \"fuck you tipper gore\"..that is why i love eminem..he doesn't give a fuck! YAY! go em go go!\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\n*Âº* LYRIC CORRECTION *Âº*\r\nThe very last line of the 2nd verse is: \n\r\n\"I'm Like 'My skin, is it startin' to work to my benefit now?'\"\r\n                                 And not:\r\nIm like \"Is my startin' to work to my benefit now?\" Whoever typed these lyrics up REALLY messed them up!\n\n\n", "comment_34": "\nHere is an awesome song with strong meaning...atacking the censorship in america...But then he turns around and says he is sorry for what he just said...i guess thats why they call him a radio poster boy. It was a waist of good lyrics.  Freedom is a state of mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nThis is an awesome song....i luv when he says he's just kidding b/c it pisses ppl off more!...I luv EM!!\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI love this song. Someone said it earlier, that this album has more of a metal sound to it than his others and I agree. I loved Eminem before this album, but as soon as I found out he was anti-bush, he just became so much cooler, lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nLoL, my favorite part is when he says FUCK YOU MS CHENEY, FUCK YOU TIPPER GORE. I really like this song. \n\r\nI think \"I'm just playin' America, you know I love you\" is also mocking the end of \"Kill You\" from Marshall Mathers LP when he says, \"I'm just playin' ladies, you know I love you\".\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nAt the start, you can hear planes taking off and news coverage in the background. This song is basically about the tighting of freedom of speech under laws like the Patriot Act.  He's basically saying how white middle-class liberal Americans (the same ones who would have tiraded against Eminem) now feel the same anger against censorship as rap artists have felt for a long time now.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nHaha, cannibal cowcrap seems like one of those bitter, inbred, trailer-park wite boys who's grown up in poverty becuase his parents have more fingers than brain cells (more brain cells than teeth) and so naturally, it's the Blacks and Jews (and probably Koreans, Irish, Homosexuals, Mexicans and any other minority that's more successful than him) who are at fault, not him for  being a fuckwit. He must really shit himself every time he climbs off his sister, walks down the street to buy some booze (accompanied by his 3 legged mongrel Geech, of course) and sees a black guy with a job. Hahahahahaha!\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nNikkie -- A wanker is someone who wanks. (ask a British friend) It's used the same as, say, \"jerkoff\". Glad to have been helpful.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nI envy the United States for all they're coolness and California's there dudes. But I love these songs against the shitty part of it. This is the first Rap album I bought, it's good :P\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nThe second one you buy should be Latyrx's \"The Album\". I Know i've already mentioned this a bunch of times, but i'm gonna be a stubborn bitch and not stop till someone listens.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nWell I am Eminem's number 1 fan lolz jkz.I love eminem and i am all the way with him.I think the sonf white amreica is great..he says whats on his mind and plus it tottaly whats happening u know luvs u babez(eminem)\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nlove this song. probly his best on that cd. along with squaredance, goodbye hollywood and til i collapse\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nOUTRO: \"I am the damager aimed at little Erica \"\n\r\n It's Derringer, a small pistol.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nhe knows what he is chattin bout. half the world hates the american government nd he has de balls 2 challenge de whole fuckin system.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nwho is erica and eric in this song\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nwho is erica and eric in this song\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\ni love shadowwiththeeyes comment about cannibal cowcrap...so true...eminem's \"a race traitor and a faggot\"...and who cares how old you are...yur a faggot...i hope you do get the shit kicked outta you!!\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\noops i made a mistake...eminem;s NOT a a race traitor and a faggot\"\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nmake corections of the song in an email and report tdont take up space correcting shit makin an ass of urself\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nthis guy is talking shit about whites that includes all of u dumass's and quit dick riding eminem bitches and he rides the black mans dick and he aint the best rapper there was plenty of rappers b4 him talking politics and serious shit ever heard of 2pac hes a way better song writer than em em even admits that he's the best song writer ever\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nYep 2 pac's good, but he doesn't deliver much these days, does he. Political rap can't cease to exist when the _then_ leading rapper gets killed.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\ndis song rokz lv yazxxx\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\ni love this song because of it's another great rap eminem made though on political terms i don't so much agree wholefully. But it's something he defines himself to america.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nEminem at hiz best.  Thiz song iz BAD.  Great lyrciz wid meaning.  Eminem in this song is bascially sayin' if he weren't white he might not of had the success he haz had.  \"Lets do the math if i was balck i would of solf half\".  Mayb true we cant say.  Thiz lyric iz 2 much \"But i can rap so fuck school, Im too cool to go back.  Great tune from a great album (The Eminem Show).\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nthis song ios dreadful. so many unnecessary swears. absolutely dreadful. i hope that i never hear this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nOpinionhead, I strongly disagree when you said Eminem is an attention whore.\n\r\nOf course the song isn't going to bring about some great revolution, but I doubt that was the purpose of the song in the first place. Eminem is simply educating his listeners. Listen to the song right now. He is just telling his story.\n\r\nEminem is smart he knows he can't free us from the corrupt government unless we leave the country. Personally, I think he is just trying to pursuade people to vote for another leader, not to revolt against the government.\n\r\nHave you ever seen the ending of the music video Mosh?\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nYes, and I have ranted on that. Point is, my point of view is at the bottom of the battery. Depressed to say it simply, and if Eminem moshed on Washington, the government would brutally repress it. It doesn't matter if they were unarmed, because andrenaline and bare hands can make a potent cocktail, Molotov without the literal flame. \n\r\nYou may be right, urbanplaya, but I disagree with you. Anybody who makes music and is successful at it is successful at bringing attention to themselves, hence the attention whore idea. Disagree with me if you must, but at least you are honest and intelligent in your opinion.\n\r\nThank you for your candor.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nI feeling this\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nShady_rocks I think Eric and Erica might represent the \"guys and gals\" of a certain country brought up? amERIC(A)\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nROFLLLLLLLLLLLLLL... What fucking RETARD posted these lyrics? Besides basically EVERYTHING being wrong, here's at least one thing; \"Fuck you with the free-este of space this divided state of embarrasment will allow me to have \"... How does that make sense, idiot... It's \"fuck you with the freest of speech this\r\ndivided states of embarassment will allow me to have\"\n\r\nI listen to punk and rock, and I know the lyrics better than you.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nThis song is extremely good, specifically the lyrics. The points he brings up and things he says in this song are amazing. Ive heard all the eminem songs and this is in my opinion his best work. I just wish he wouldnt have stopped.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nThis song is so true. Eminem is one of the only rappers to take heat for saying he will\r\n\"Smack a bitch and say Faggot\"\r\nThat is a good line.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nthis song rocks, hands down. and all the people who dont think this song is the shit, you need to check yourself. if you read the lyrics, the song says exactly what was going on in the world when this song came out. this whole CD is pretty great! \t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nworst lyrics EVER\r\n1. How many >peopel< are proud \r\n2. of speech >that< the United States government (word not in song)\r\n3. people, who >still< like me (should be feel)\r\n4. shoveled shit all >of< my life, and now I'm jumpin' in on it. (no \"of\" in song)\r\n5. me, >I< almost gave up (never said \"I\")\r\n6. Searchin' >for the< fine toothed comb. (should be \"with a\")\r\n7. working 'round the clock to (try to) stop my concerts early. \r\n8. Fuck you with the (something but not what he said), this divide states of embarassment will allow me to have.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\ndude, who ever wrote this cannot here they must of herd da song 1 time\r\nwho ever wrote this=gay\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nI have talked about this before. I think Eminem is a great artist, but he is nothing more than an attention whore like every other mouthpiece out there. Eminem isn't the next Thomas Paine and this song isn't the next Common Sense, if anybody catches my drift. I think the interpretation of liberals finally understanding the hypocrisy of government and the brutal suppresion of the Patriot Act is justified. I don't think it's going to bring about any great revolution. Commentators speculated that 1968 through 1972 was a \"great revolution\". It wasn't because the establishment remained in tact after it was over. When Jefferson penned the Declaration of Independence, he basically said that if the government was doing it's job, the logical end of it all was total overthrow. That won't happen because the government will call up the military and everybody will be gunned as soon as the mob reached the beltway. Eminem, Zack de la Rocha, and Bill Hicks all dream of sort of unique revolution that free us from the tyranny and corporate power but I don't think that will ever happen. Nature abhors a vacuum, especially one where power is involved. Somebody will always be corrupt and in charge because that's the nature of humanity, and we can't overcome it no matter how hard we try.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\neminem rocks, u queers suk\t\t\t\t\n\t\t\t\t\n\n"}