{"comment_0": "\nI don't know, I think this song talks about someone who's being looked up to... they hears talks about people who are jealous and all that. They know they aren't liked or welcome but they are only used. The song I think talks about how no matter what the said person does to please the other people, they think their crazy. The said person then realizes its 'who they are' like the song and they know that they aren't welcome or liked but its not their problem since its their own unique personality.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis is from the \"Catching Fire\" soundtrack. I think this is about either President Snow or the Peacekeepers. \"doesn't matter if we've gone too far\", \"they we're crazy\" my book of jealousy\". It's for someone with power and it's just \"who they are\", power is everything for them.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nObviously this is from the Catching Fire soundtrack, so I'll use that. To be honest, I don't think this has to do with peacekeepers or anyone in authority (but who knows, maybe it does). To me, it's talking about the victors of the Hunger Games. Particularly the popular ones, like Katniss, Peeta, and Finnick. I think it's talking about them and the images they have become, whether a sign of rebellion like Katniss, or the Capitol's Darling, like Finnick. President Snow has shaped the victor's images based on what he wants them to be.\n\n\"We were never welcome here, \nwe were never welcome here at all.\"\n\nTo me, this is when the victor returns to their district. There is no room for victors in the districts. They are hated by the people. Victors were never welcome in the districts. Especially when President Snow makes them look like something they aren't and the victor is forced to play along.\n\n\"Save us,\nwhat we are\ndon't look clear\nIt's all uphill from here.\"\n\nThis to me is the victor reaching out to someone to help them. They want to be saved from this image Snow has created for them but they can't. It looks easy once they win the Games, but it is really all uphill once the Games are over.\n\n\"It's who we are.\nDoesn't matter if we've gone too far.\nDoesn't matter if it's all okay.\nDoesn't matter if it's not our day.\"\n\nThey've been this person for so long now that they are believing it themselves now. They have become the victor Snow wants them to be.\n\n\"They say we're crazy\nThey say we're crazy...\"\n\nAt this part of the song, it sounds like a realization to me. Just like a breaking point. Maybe not necessarily crazy, but they are just tired of all these labels forced on them and they are done with it. When they sing \"It's who we are\" next, that's them breaking away from all of the labels and going back to who they really are. But the last \"It's all uphill from here\" shows that they know it isn't going to be easy. Incredible song!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nMajority of their songs are about Jesus, the King. This song is about having similar powers to Jesus and people actually have the holy spirit living in them. Medically this is described as a mental disorder like PTSD. But it's just the spirit of God that lives in us. Eminem explains it too in his song, Till I Collapse. Anyway, I am one too and seen the power/force. It's who we are, they say we are aliens, crazy, insane....but whatever, they are jealous and that's their book of jealousy. Listen to Believer after you read this.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI know this song is for Catching Fire but I'm not going to try and compare it to that even though I LOVED the movie. I think this song is about how people judge you. Like 'labeling' people. That means that sometimes people will judge for things THEY see you do. They may not know whether your life is ok or not, but they still judge you from what they see you do.  That's who you are to THEM. \nIf you want to tie it into Catching Fire I guess you could say that so much is expected out of Katniss and different people in the story judge her for different things. She also doesn't want to be in the situation she's in, but people still judge her for her actions while she's in this situation. \nI don't know if that makes sense it's really hard to explain, but I hope it helped :)\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI absoulutely love this song, I interpret it as you know like children or young adults that are looked down upon in society and are making a stand that they really dont care because they are themselves and that is what makes them happy.\npeace\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nImagine Dragons is a cool band, they've made good music. I hope their new album is more rock!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song is about people who've been supressed and feel jealous of the ones who have it all easy. The song then preaches about how they feel undesired in the world and eventually become rebellious and fight for just something more and are called crazy for that.\n\nAlternatively, the song may refer to someone who leads a rebellion, who believes the enemy views them as jealous.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nA lot of people have been talking about how this is from the Catching Fire soundtrack but I think that just because it is doesn't mean that it doesn't hold other meaning. Personally, I think this is a song about oppression of certain groups (probably about slavery and the groups that were affected by that but it could also be about other groups like that).\n\nFirst of all, the title automatically suggests a group that can't change themselves and doesn't want to, and applying that to a racial standpoint, most POC are proud of themselves and would like to be themselves without persecution.\n\nThen, the lines:\n\nUp on the mountain,\nDown in the king's lair,\nPushing these boxes in the heat of the afternoon.\nOh, afternoon.\n\nsuggest that this group is being forced to do something they don't want to do. And while LGBTQ+ groups certainly are, slavery is literally only being forced to do something that you don't want to do.\n\nAlso, the lines:\n\nSave us,\nWhat we are,\nDon't look clear,\nIt's all uphill from here.\nOoh.\n\nsuggest that no matter what happens to this group, good or bad, it is still going to be a struggle for them. And this definitely applies to any group that's ever been persecuted, but any racial group is still experiencing racism to this day.\n\nThere are definitely lines that I can't relate to this, but then again, I suck at picking up metaphorical meanings and can't experience this firsthand (I'm white).\t\t\t\t\n\t\t\t\t\n\n"}