{"comment_0": "\nI think it's fairly clear what this song is about. The narrator has lost a child.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nFirst single from, 'The Road and the Radio', just hit the airwaves in Pittsburgh, Enjoy.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nVery, Very good. \r\nI guess this is for the friend he refers to in \"I go Back\".\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nthis is a great song. i'm so excited to finally be getting it on cd today!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis is one of Kenny's best songs by far. Well, best recent songs. \n\r\nIt's pretty self-explanatory, someone he knew from his youngerdays died...and so on and so forth.\n\r\nThewhitepele18 - that's a good idea.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nBack in october my brother and his friend got into a really bad car accident and his friend died. his friend was like my big bro and it hurts me to think hes gone. the driver(my actual bro) is getting prison time for it and it is not fair. I\\'ve lost 2 brothers in the past 8 months and it sucks bad. so this song to me means that they lost someone close to them and dont know how to coupe with the fact they are gone. Also that they wonder what the person would be doing with their life if they were alive today.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nIn the area that I live, quite a while back, 25ish years I'm guessin', a very popular kid at my school died in a car wreck. Made a lot of people sad, his good friend wrote this song about him and eventualy sold it to Kenny Chesney. True story swear to god. The press box at our school is named after him.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI heard somewhere that Kenny wrote this song for his niece...but I don't know if that's true or not. \n\r\nTo me, this song is for my uncle. He died suddenly at age 36, and never got to do a lot of things with his life. He tried and tried, and I guess one day he just stopped trying. Anyway, when I hear this song, I think of all that he could have accomplished, who he could have loved. That's what this song means to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nMy junior year of high school a friend of mine/ classmate was died of injuries sustained from a car accident and a year later this song was played  at the unvailing of his headstone  the lines \"sunny days seem to hurt the most\" and \"I wonder what you would name your babies\" hit me the hardest\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nthis is such a pretty song...i was sittin by my grandaddys grave and this song popped in my head but this part stuck out most...\"It ain't fair you died too young\r\nLike a story that had just begun\r\nBut death tore the pages all away\r\nGod knows how I miss you\r\nAll the hell that I've been through\r\nJust knowing no one could take your place\r\nSometimes I wonder who you'd be today\"\n\r\nhow come the best songs are sad slow songs?kenny's hott and so is his music!!!!lol\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nso one of my best friends, Kevin, his older brother Sean, who graduated last year with my brother, died on monday while riding is street bike. it was so horrible, and today at his funeral, they played a slideshow of pictures of him growing up, and they played this song during it. it was so sad and amazing at the same time. i bawled my eyes out. this song will forever remind me of Sean Forrest. rest in peace buddy. we all love you.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\ni actually just heard this song recently. to me this song reminds me of a friend who just died of cancer and he was only 16. i knew he liked this song so i listened to it and i would say i cry everytime, but i think i've cried all that i can.. it's a beautiful song and goes so well with these types of situations, listening to it really helps me cope especially when he says \"the only thing that gives me hope is i know i'll see you again someday\"\n\r\ni think the meanings is pretty obvious, but i dont know who he wrote it for or anything. the video is really good too.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI've always wondered who this song was written for...it could be for a friend, a young girl that is related (i.e. niece), a daughter, or (my first reaction) a wife who died before having any children.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nmy cousin, was 8 years old and about 2 years ago drowed. and everytime i here this song, everything it says reminds me of her\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI'm not into country music that much, but I love this song.\r\nMy best friend was killed last year in a car accident. He was only 17 years old. This song always will remind me of him.\n\r\nRest in peace, Zac.\r\nWe love you and miss you very much.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nIve heard this song over and over, i even own the cd - yet never really listened to it until my friends funeral yesterday. amazing song with a very deep meaning \n\r\nRIP brent..\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis song really grabs one's soul.  For all of the Kennys -this one's for you.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nOh I love this song.\r\nMy Friend died when he was 16, and this song always reminds me of him.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI lost my stepmom unexpectedly back in 2003.  Quite a few years later when I first heard this song she popped into my head.  She died young; only 32 years old.  Every time I hear it I start to tear up and think of her.  I miss you and love you...RIP Jen\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nOne of Kenny's best songs. Unfortunately, too easy for so many to relate to :( Everyone had atleast a tear in their eye when this song was played at the concert.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nVery very sad. This song is so beautiful. And very impacting.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nKenny Chesney didn't write it in case anyone is wondering. but I don't think that's too important.  He sings it so sadly.  \n\r\nI always thought it was about a guy who lost his son when he was still a young child or a baby.  I don't know why exactly, it's just that I got that impression when I first heard it, and to me it sounds like he's singing about a little kid.\n\r\nI think he's talking about a child because of the way it's written.  He talks about what the person he's talking to would name his kid's.  He talks about the hell he has been through, and that no one could take the person's place in his heart.  The blue skies make me think about the song that way, the most.\n\r\nIn reality, I know it could describe anyone who died too young, girl, boy, friend, sibling, nephew, neice, etc., but to me it's about a little toddler boy.\n\r\nThe song makes my heart hurt.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nMy son took his life at the age of 16 in 2006. I miss him so very much. There are a lot of songs out there that almost described the pain of losing a child, but when I heard this song on the radio it described it 100%. I thank the songwriters for putting this kind of pain to music and putting what I feel in my heart and mind to music. I have the lyrics printed and framed next to his picture.  \t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nthis song reminds me of two of my friends who died the summer of 6th grade.They really were too young school just hasnt been the same without them.\r\nR.I.P johnny gwin\r\njustin diekma:(\n\r\nyoull always be in our hearts.<3\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis song reminds me of one of my best friends who died two weeks ago after a motorcycle accident. He was just 18 years old. We have been close friends for 5 years. We were voted Best All Around together this past year and we recently graduated with honors sitting side-by-side. There were over 2500 people that came to his visitation and over 500 that came to the funeral. He was THE kindest person I know, and I love him with all my heart.\n\r\nThe line, \"Would you see the world? Would you chase your dreams? Settle down with a family? I wonder, what would you name your babies?\" always makes my heart hurt.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\ni actually think this song was written for his friend from childhood that died when he was 16.\n\r\nthis song came out, i believe, after (if not, around) my 17th birthday which was the day that my 21 year old cousin was killed by a drunk driver.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThis Song means alot to be because my junior year in high school a boy from my school killed himself a few months after school started and then 4 boys from my school died in a car accident and it was really hard and then four months later at the beginning of my senior year 2 of my best friends got in a car accident and one is still in a coma. \r\n everything in this song reminds me of them and everytime i hear it i wonder what their lives would have been like. \t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nThis song reminds me of my little cousin Zayana who was only 6 years old when she died in a terrible car wreck. She was so sweet and meant the world to her family. She had no idea what was coming, and only if she was here today who would she be? \n\r\nI love you Zayana Brayel Johnson and may you Rest In Peace:(\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nim not sure why he wrote this song but right before this song came out i had a baby boy that passed away from sids and this song has helped me out so muchso i love it rip Deandre demarcus foster jr.2005 \t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nReminds me of my girlfriend, she was killed in a car crash when she was 16. And it also remind me of to many friends gone. Its also somehow tied to Kennys other song in my head \"Better as a Memory\" which is also a great but very sad song. This song is to me the saddest song i know.\t\t\t\t\n\t\t\t\t\n\n"}