{"comment_0": "\nhmm...this song is about how the production team Stargate sucks at producing. guess what other songs they produced:\n\r\nirreplaceable (shocking, right? sike) and go on girl by ne-yo.\n\r\nthis and irreplaceable almost have the same beat. stargate needs to move from the acoustic guitar, or at least change it up and be original, jeez.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nWhen he says \"I know I can't be the only one, I bet his hearts all over the world tonight, with the loveof their life who feel what I feel when I'm with you\", it means that he's not the only one tonight who feels like that lovey feeling with his girl. \"His heart\" is standing for all guys in a relationship with a great girl like he is.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nthis song is so cute (=\r\ni listen to it a million times in a row..\r\neven though i can't exactly relate, because i don't have a \"boo\" still it's really cuttte !\r\nit's just about how much this girl means to him and he knows he's not the only person that has strong feelings for somebody .\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nhow are there no posts?\r\nthis is suchhhaaa cute song\r\ni love chris brown :)\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nhehe this song is cuuute(:\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nacouistic guitar + r&b= perfect music.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis song is about how columbus discovered america and all the hardships the indians went through due to the white man\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song is about how columbus discovered america and all the hardships the indians went through due to the white man\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\n\"Baby, you're the best part of my day\"\r\nyeah as if you could miss that!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ni actually like this song veryyyyyy much, and i usually hate chris brown's music.\r\nbut this song is very cute and sweet.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nWhy does he say \"his hearts all over the world tonight\"???\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI LOVE THIS SONG! its uber cute and it fits me really good.. but yeah ii love it. and really how could you miss best part of my dayy \t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nGreat song for young lovebirds,but i'm not in love,and never been,so this song ain't for me.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nwith every kiss && every hug you make me fall in love...\n\r\ncutest song ever.\n\r\nbut isn't it ...I bet *there's hearts all over the world tonight with the love of *their life...\n\r\nhmm idk nvm...\r\nI love this song though\r\nugh x[\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI love this song! me and my friend cried the first time we heard it. its so sweet. my favorite part is when he says:\r\ni dont want no body else\r\nwithout you theres no one left\n\r\nI love it!\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nthis is pure shit....\r\nStargate sucks, all of her songs sound exactly the same..\r\nIn this one, trying to rip off \"irrepleaceble\"\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nthis is pure shit....\r\nStargate sucks, all of her songs sound exactly the same..\r\nIn this one, trying to rip off \"irrepleaceble\"\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nAwh its so corny.\n\n\r\nI lub it\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nlooooove.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI like this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nAnd I agree with PutThePastAway\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nyeah,i'm pretty sure it's \"there's hearts all over the world\" rather than \"his\".\r\neither way,this song's too cuteee.\r\ni'm liking the acoustic r&b trend:]\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nmmmmm chris brown. he's amazing and I hate R&B\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nthis song makes me want a boyfriend.\r\nit's just too cute.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\ni loveeee this song, but what does it mean when he says \"your like jordans on saturday i gotta have you and i cannot wait\" ??\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\ni heard the song playing while i was in the car on my home one night. reminds me of my boyf. hes studying in another country now. i miss him! ): baby, i'll always love you. i love this part especially \n\r\n...Cuz with every kiss and every hug,\r\nYou make me fall in love...\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThis song is soo cute. I can't help but to smile when I here it.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nwhat a sweet song! puts a smile on my face every time too.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nnot a big fan of r&b but i really like this song it cute however it makes me sad because i dont have anybody and that line \"i bet there's hearts all over the world tonight who feel what i do\" really makes me sad because what about all  the hearts that dont have anybody.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nwhen he said Jordans on Saturday it means the basketball game :D\r\nand i luv luv luv this song.. even though I agree with myonly1, i hate listening to it cuz the one i love doesnt love me the way chris brown loves the girl in the song haha \r\nbut I do understand how this exactly describe someone's feeling when they're so in love with someone else :)\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis song reminds me of my friend :)\n\r\nYou mean to me\r\nWhat i mean to you and..\r\nTogether baby,\r\nThere is nothing we won't do\n\r\nThis bit makes me think of my friend because he is always there for me and i fel when we are together the really isnt anything we couldnt do :)\n\r\nCuz with every kiss and every hug,\r\nYou make me fall in love\n\r\nWith every hug i fall that much more in love with him, how perfect is that bit of the song!\n\r\nI Love this!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\naww this song is so sweet\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI dont usually like chris brown, or this style of music for that matter. \r\nbut this song is incredible.♥\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI don't usually listen to this kinda music, I'm more into hardcore/rock.\n\r\nBut this song is just amazing!\r\nI can't over how amazing it is! :']\r\n♥\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nOpps I meant * I can't get over how amazing it is\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nomg i love this song! \r\nits soo sweet!\r\nmy favorite part:\r\n\"Cuz with every kiss and every hug,\r\nYou make me fall in love\"\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\ni normally don't like chris browns music, but this is fair cute XD\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\n\"This song is about how columbus discovered america and all the hardships the indians went through due to the white man \"\r\nha um ....ok?\r\nnot real sure how you came up with that ?\r\nlol\r\nbut i really like this song :]\r\nughh but i HATE irreplaceable with  a passion\r\ntht song is so stupid and they wore it out\r\nbut this is cute♥\r\ni love where he says \"with every kiss and every hug you make me fall in love \"\r\n:) :) tht gives me chills everytime i sing tht part cause im in love and its so true :]\r\ngood song\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI need you boo, I've gotta see you boo\r\nAnd the hearts all over the world tonight\r\nSaid the hearts all over the world tonight\r\n(The girl is not where he is and he misses her. The \"hearts all over the world tonight\" means that wherever she is, he will still love her. She can never be away from him in his heart.)\n\r\nHey, little mama, oh, you're a stunner\r\nHot little figure, yes you're a winner\r\nAnd I'm so glad to be yours\r\nYou're a class all your own\r\nAnd oh, little cutie, when you talk to me\r\nI swear the whole world stops, you're my sweetheart\r\nAnd I'm so glad that you're mine\r\nYou are one of a kind, and\r\n(She is the most beautiful girl he has ever seen. There will never be another girl as perfect as she is.)\n\r\nYou mean to me what I mean to you\r\nAnd together baby, there is nothing we won't do\r\n'Cause if I've got you, I don't need money\r\nI don't need cars, girl you're my all, and\r\n(The other things in his life are nothing compared to her. They have been through so much together that nothing could ever tear them apart.)\n\r\nOh, I'm into you\r\nAnd girl, no one else would do\r\n'Cause with every kiss and every hug\r\nYou make me fall in love\r\nAnd now I know I can't be the only one\r\nI bet there's hearts all over the world tonight\r\nWith the love of their life who feel what I feel when I'm\r\nWith you\r\n(He keeps falling in love with her all over again every time he sees her or hugs her or kisses her. She is the special one for him, just like everyone else in the world has their special one.)\n\r\nOh girl, I don't want nobody else\r\nWithout you, there's no one left and\r\nYou're like Jordan's on Saturday\r\nI've got to have you and I cannot wait now\r\nHey, little shorty, say you care for me\r\nYou know I care for you, you know that I'll be true\r\nYou know that I won't lie, you know that I will try\r\nTo be your everything\r\n(He will try his hardest to be whatever she needs. \"Without you, there's no one left\" means that if he ever lost her, he could never love again.)\n\r\n'Cause if I've got you, I don't need money\r\nI don't need cars, girl you're my all, and\n\r\nOh, I'm into you\r\nAnd girl, no one else would do\r\n'Cause with every kiss and every hug\r\nYou make me fall in love\r\nAnd now I know I can't be the only one\r\nI bet there's hearts all over the world tonight\r\nWith the love of their life who feel what I feel when I'm\r\nWith you\n\r\nAnd I will never try to deny\r\nThat you are my whole life\r\n'Cause if you ever let me go, I would die\r\nSo I won't front, I don't need another woman\r\nI just need your all or nothing\r\n'Cause if I've got that, then I'll be straight\r\nBaby, you're the best part of my day\r\n(He doesn't want to tease at all. He just wants her all to himself and could not go on living if she wasn't his whole world. She brings the best out of him and without her, there would not be any of him.)\n\r\nI need you boo, I've gotta see you boo\r\nAnd the hearts all over the world tonight\r\nSaid the hearts all over the world tonight\r\nThey need their boo, they gotta see their boo\r\nAnd the hearts all over the world tonight\r\nSaid the hearts all over the world tonight\r\n(There are people all over the world that need their love just like he needs her.)\n\r\nOh, I'm into you\r\nAnd girl, no one else would do\r\n'Cause with every kiss and every hug\r\nYou make me fall in love\r\nAnd now I know I can't be the only one\r\nI bet there's hearts all over the world tonight\r\nWith the love of their life who feel what I feel when I'm\r\nWith you\n\r\n(This is one of my favorite love songs. I'm not normally a Chris Brown fan, but this song reminds me of the girl that I am in love with. It is the ringtone when she calls. I swear this song is magical. When I am down and don't have the strength to go on with the day, this song randomly comes on the radio and I immediately think of her. Even though this song is not played infinitely like it once did, this still works. This song will always have a place with me.)\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nthe part where he says your like jordans on a saturday, i really dont htink hes talkin bout basketball, hes most likely talking about Extacy, there is a kinda popular X pill called Air Jordans\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\noh and sorry i forgot to mention to the people who dont really do drugs, but X makes u feel really really happy and good, so hes sayin that she makes him feel like hes on X or someshit idk\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nLove this song so much... XD\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nAlmost every couple of hours on the radio it work I can hear 'With you, with you, with you, with you, with you...' repeated over and over. \n\r\nIt's like a nightmare I cant wake up from!\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nAw this is so, so, so cheesy but I love it.\n\r\nHehe.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\ni remember listening 2 this song non stop wenn it 1st cme out , makes me reli wnt a girlfriend and have tht speical bond with some1 and feel what chris brown feels wen ees with tht person and 4 them to feel the sme bck\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\n;\r\nfirst chord.... nickelback - photgraph!!!\r\nreally liking this song though :]\r\nx\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nwhen he says \"i gotta see you boo\"\r\nit totally sounds like he's saying \"i gotta see your boob\"\r\nthis song is god awful. boring and repetitive.\r\nbut then half the stuff in the charts is at the moment is like that anyway.\r\njust my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI hate this sort of music, I only ever listen to rock, but I love this song, I can relate to it so well. Chris Brown says things in these lyrics that I want to say to someone very special to me but couldn't find the right way to phrase them. Amazing song!\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nthis song means alot to me personally, like his lyric,\r\n'Cause with every kiss and every hug\r\nYou make me fall in love'\r\ndescribes for me exactly wat happenes when my girlfriend hugs me and shows me that she loves me\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nand the jordan's on saturday / gotta have you and i cannot wait line is referring to how he buys all the new jordan's as soon as they come out, and they only release new jordan's on saturdays.\n\r\nget it?\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nthis is my song w/ my bf xD\r\nhe likes to sing it to me, for some reason xD\r\nhe..um...yeah SINGS it xD\r\nhahahaha WOW\r\nbut, yeah I LOVE THIS SONG!!!!!!!!\n\r\nlove ya, baby!\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nAw. Too stinking cute. I love it. Almost as much as I love my boyfriend!\n\n\r\nBut I don't love this song more than him ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\njust heard this on the way back from prom,  which my girl couldn't go to cuz of her mom...anyway it still made me think about her and ive been listenin to it ever since. i mean i'd heard it before but it just sounded awesome now that i had a girl that i really cared about\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nMakes me cry :(\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nBooooo, cute x\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nIdk why i love this song but i do\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nthis song is a perfect rnb love song. it describes a long distance relationship and feeling love from his perspective, as a successful artist he has to cope with not seeing her, \"i need to see you boo\" and always making sure that they are both faithful to each other. he sings this song to reinforce his love for her, and to make sure that she knows that she is wanted. it touches the hearts of many of his fans, as his fans feel these romantic lyrics and adapt them to suit their current relationship situation, or to fall in more love with chris brown :) \r\nhe favours her to a great extent, prefers her over many superficial values such as money and cars, so only love is present between them, not money, so their love is deep. he imagines that other people around the world are feeling the same way as he is, he sees himself no different to everyone else. even though he is famous, he would rather be treated as normal to prove that their love is true.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nThis song is about how columbus discovered america and all the hardships the indians went through due to the white man\t\t\t\t\n\t\t\t\t\n\n"}