{"comment_0": "\nOmg, this version does so not suck! It's amazing. I frickin love thins song' it's brilliant, one of the best iv'e heard, its beautifull!! Her voice is so powerfull and she sings this so well. I think this is Mariah at her best, she sings shit now! 'RnB' not really my think but her old songs are great especially this and hero, great!!\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nthis song relates to my long distance boyfriend over in england , i miss him terribly and i literally cannot live without him, he brings so much light into my life whenever i see him or talk to him on the phone or on instant messenger. i miss you ben and i love you so much!\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nwow.  that is so sweet\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis is a cover of a Badfinger song. This version most likely sucks.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI'm so silly.. I wrote a comment for this song under the title \"I can't live\" lol!!! This song is AWESOME!!! I really don't understand \"PinKkFloyDd's comment!! This is like, one of the best covers that i have ever heard in my life!!! she sings it with such intense emotion. This song is just so powerful, its heart-breaking, its beautiful - everything!!! I'm so in love with it. There should be way more comments here!!! Anyway, its one of mariahs best songs, ever!! gives me shivers up and down my spine, its truly unforgettable. A masterpiece from mariah - no one could ever sing it like she does!!! she is the best!! the QUEEN of music!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI love the control and power in her voice in this song...\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\n\" Well I can't forget this evening \r\n Or your face as you were leaving \r\n But I guess that's just the way \r\n The story goes \r\n You always smile but in your eyes \r\n Your sorrow shows \r\n Yes it shows\"\n\r\nOne of the most poetic lines in pop music.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI dedicated this song to my long distance boyfriend of 2 years my meaning is...\n\r\nBasically i love him so much and i cant live a day without him..and i havent seen his face yet but i know that when i do ..its going to kill me inside so much because im not going to want to let him go at all. And It kills me inside right at this moment being away from him and i know that when i see him its going to be so hard to let go. But i know im going to have to and its going to kill me..\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThat is cool you are a tough one.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nKen LEEEEEE!!!\n\nTu libu dibu dowchoo!\n\nKen LEEEEEE!!!\n\nKen lee meju mo!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI don't get how women's songs sound so weak? Where are the tough songs women? We need to have more female drill sergeants!\t\t\t\t\n\t\t\t\t\n\n"}