{"comment_0": "\nI love the Beatles!!\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nOK kids. This is a song simply about living on a tour bus. We in the biz refer to long bus rides as a \"submarine ride.\" The first tour busses were the old school busses. The phrase \"many more of them live next door.\"is a referal to the crew bus. Taken in this pretext it's simply a song about life on the road. Most songs like this are taken from real life situations and are written from the perspective of everyday occurances. Most musicians live in the moment and are not as introspective as one would assume. Look for the simplistic and you will find most of the meanings to songs are just that, simple.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI hate how everyone says its so simple, childish, and a bad song. it seems that way but it does have meanings,but no im not talking abnout how its about LCD and that its in the lyrics. that is totally wrong, (probably, you never know with the beatles.) because they did that in Lucy in the Sky with Diamonds. so why would they do that in thius song too? that would be pretty wierd. but thats just my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nOkay, I apparently understand a very different meaning for this song than everyone else, so I'm going to point it out:\n\nIn the town where I was born\nLived a man who sailed to sea\nAnd he told us of his life\nIn the land of submarines\nSo we sailed up to the sun\nTill we found a sea of green\nAnd we lived beneath the waves\nIn our yellow submarine\n-\"Where I lived there was a man who sold drugs and he told us about it, so we tried them until we were really high.\"\n\nWe all live in a yellow submarine\nYellow submarine, yellow submarine\nWe all live in a yellow submarine\nYellow submarine, yellow submarine\n-\"We are all really high.\"\n\nAnd our friends are all aboard\nMany more of them live next door\nAnd the band begins to play\n-\"So, because we liked it we told our friends and they joined us and now we are all happy and addicted.\"\n\nAs we live a life of ease\nEvery one of us has all we need\nSky of blue and sea of green\nIn our yellow submarine\n-\"And we are high, and everyone else is high too on the drug.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nA lot of people are saying this song doesn't have a meaning... Well I think it does, actually. Its just you need some background information to understand it. But hey, I might be wrong. \n\r\nI heard somewhere that the military used to use yellow submarines for target practice, they painted it yellow because it was easier to see against the blue or green water. So the yellow submarines were just target practice that ended up getting hit and ruined all the time. \n\r\nIf they DID base the song off that bit of information, then the song makes a lot more sense, to me... Its kinda a sad song, if its true... But it doesn't sound sad, so maybe the yellow submarine thing is just a coincidence.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\n''We all are really really high we are all really really high''\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nWRONG!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!WRONG!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nthis song is as hard as it is easy to understand. \n\r\nit is simply about life. were all riding it, and theres nothng more to do than to live it and enjoy it:)\n\r\nfew people can mwrite a song so simple, but in the same time genious!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nholy shit. what has become of the people that once favored true artistic brilliance. which by all practical means is applying the simplest of notions and disguising them as absurdities. Look deep into this song, only a fool would aloof from this interpetation ;)\n\r\nIn the town where I was born\n\r\nLived a man who sailed the sea/ the chances we take that offer risk and fulfillment, yet the reprecussions are still unknown to that moment\n\r\nAnd he told us of his life/ the glits, the glam, all those luxuries you once promised yourself would still be attainable after straying from the ranch\n\r\nIn the land of submarines/ land of the unknown, all you know is the \"submarine\" your in\n\r\nSo we sailed on to the sun/ taking the high road, which ever fancies your utopian primrose path\n\r\nUntil we found the sea of green/ the promised land? the moment where it all makes sense\r\nAnd we lived beneath the waves/ accepting that reality and enjoying it\r\nIn our yellow submarine\n\r\n...idk what do you guys think\n\n\n\n", "comment_9": "\nI cant believe almost you all think this is a childish song you ignorant douches. this song has so many meanings, besides the acid trip theory. when the beatles wrote this the social revolution was starting and all their songs had to do with capitalism and freedom. \"sea of green\" means money, \"beneath the waves\" means that they were sheltered from the rest of the world. the yellow submarine is a metaphor for the subarban life style many people were trying to get away from or trying to change.\r\n\"As we live a life of ease\r\nEveryone of us has all we need\r\nSky of blue and sea of green\r\nIn our yellow submarine\"\n\r\nthe first line just says that everyone was content living that sheltered life where \"everyone of us has all we need\" , between the clean clear blue skies and lots of money, we life in our yellow submarines.\r\nEven teh line \"and all our friends are all aboard, many more of them live next door.\" is explaining the same ideas of peaople that are just trapped in their lives... no beatles song was just to have fun.. because the only way they had fun was buy writting these fucking masterpeieces\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis song and Octopus's garden are about living in a world where you can be yourself and free and safe from the judgements of the real world. Liverpool is a Maritime city. The boys knew all about the way's of the sailor's and merchant seamen. Not brain surgery folks on what these songs are about, but the real world (everyone in these comments) will never figure it out in their self imposed bigotry and ignorance.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nYellow submarine is an excellent movie.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nYou guys really don't get it at all.  They knew they could make a song as bizzare as this and it'd still be a hit b/c they were The Beatles!  A huge band like that making such a childish song is totally original and in present day it'd kill even the most popular band's career but The Beatles could get away w/ it so they did.  Listen to The Continuing Story of Bungaoow Bill.\n\r\n-The Prynce\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\ncbennet, are you an idiot? this is exactly what theprynce said about the song. It is a childish song but they were the Beatles. You need to do more research on them to know what they are about. You read way too deeply into this song. A common mistake among amateurs....fool\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nOh dear, No I was satirising people who read too deeply into songs, but never mind. I would've have thought it was pretty odvious I wasn't serious, I mean 'Land Submarine Door'!!\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nIf the song didn't have any hidden meaning the Beatles wouldn't have released it, they would have known how bad it would sound in years to come. It is only a simple meaningless to simple meaningless people, have a good hard listen to it!\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI used to jump rope to this song in grade school...\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nive often wondered if this song would have sounded better if ringo hadnt sung it and if paul or john did.what do u guys think?\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nIs it just me, or does anyone else think that whichever one of them that wrote this was on something?  I mean the song gets pretty trippy near the end.  I always thought that the song was written about a trip.  But that's just me.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nWhat?  One of the Beatles?  On drugs?  Really?\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nY'all don't know what you're talking about. I think this is a great song and so do a lot of other teens who are just getting into the Beatles.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\ncbennett... the word is \"obvious.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\npkjun - he does it every time he types the word \"obvious.\"  or rather, \"odvious\".  read back, you'll see... \t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nPaul wrote (with the intention of being a children's song) 'Yellow Submarine' in bed, late one night.  It's been suggested that the idea came from Bob Dylan's 'Rainy Day Women Women Nos. 12 & 35'.\n\r\nAnt\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nthis is a nice song....sometimes we need to feel....like li' kids...\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nif you think the song is trippy, watch the movie.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nits all about the drugs, you people are dumb, its not a kids song at all\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nOMG!! THIS SONG IS NOT A CHILD SONG,IT'S WICKED,THE FIRST TIME I HEARD THIS I CRACKED UP LAUGHING,I LOVE IT IT'S MINE AND MY UNCLE'S SONG!!! AND I WILL ALWAYS LOVE IT!\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nomg, i dont' understand how all you people can not like this song! this is the BEST beatles song there is! yes it is childish, but isn't it better than just being... well, wvr else it isn't????? and just b/c the song is childish, doesn't mean that any of them were on ANYTHING!!!!! maybe they wanted to have a fun song, one that everyone could remember from their childhood?? ok, yea, enough BTCHing. the song and the movie both ROCK!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\ni know im wrong but to me this song is how we could live in a yellow submarine and not know it we could have just did some acid a minute ago and not know it so u think the world u are in is real but it could actually be completely fake\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nSorry to say, but I've always had a soft spot for Yellow Submarine even though It isn't by any means musically great. It's just fun and puts me in a good mood. Obviously not their best song, but it is fine. I have actually used Yellow Submarine to get people interested in the Beatles. Many kids my age would not have the patience for some of the better \"fun stuff\" like Ob-la-di Ob-la-da. If this song gets people interested, then I am happy they have found the Beatles.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nThe movie is amazingly trippy. And the blue meanies wre funny\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nMeh. I like this song. It's a nice slower song that's good easy listening.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nThis is one of those songs that gets annoying after a while, but it's fun to sing when I'm at work, it passes the time.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nThis song, even if not the greatest, is a classic. I could listen to it all the time, and never get sick of it. It's a feel good song. The beatles, could never do any wrong ...\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nwhat a happy song to listen to\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nwell I ain't really a Doors fan nor am I from Romania so you didn't even touched me there, cuttooth... by the way what does that mean? did you fell from bed the night before , broke your baby tooth and started cryin' for momy?\r\nOH! an' it ain't about gettin' stoned it's about jerkin' off cuz that's what the beatles were doin' when they wrote this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nvisitromania - i was angry at your \"beatles are a normal early rock band\". so i dissed the doors. because in reality, if it weren't for the beatles: the doors would never have formed; we would be listening to crap right now; annnd drugs would be a lot less popular!\r\nAND: cuttooth = radiohead b-side. you should check it out.\n\r\nTHANK YOU KC0199!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nthis song is just a soundtrack to the film (the whole of the album was supposed to be, but that's a different story), so you really do have to watch the film to put the song in context. even then it's still just a good, meaningless tune (depending on your own taste). it probably was influenced by the various chemicals the beatles were on at the time, but not specifically about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nTo say that this song has more to it is to undermind the fact that the beatles are one of the most innovative songwriters ever to live...in fact I would argue the best.\n\r\nSo, whether or not this song has more meaning than what is clear I don't know, but I would like those who are saying they are \"diehard\" beatles fans to stop because you fail to realize that they could have had the innovation to write this song that people still sing to this day...\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nThis song's awesome.  I'm a teenager just getting into the Beatles and I find it great that a song I sung in preschool could be so good in actuallity.  Forget that it's childish sounding, just listen to it as a song.  It's enjoyable.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\n\"Cobain and Milo Aukerman wrote far more meaningful lyrics\"\n\r\nThere's an article in a Guitar World I read over the summer, and in it there's a quote from Kurt Cobain where he states that he doesn't even know what alot of his songs are about, because he just takes random lines from different poems he wrote that sound good together.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nits a wonderful song, so fun, but they've done better.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nA few months back, This bar I live near had a beatles night and One bands choose to do a cover of yellow submarine, They put kinda of a punk twist on it. it was fun... Alot of the people in various bands where saying how hard it was to cover the beatles. It was pretty cool though.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nhey, back then we were all just tryin 2 get happy, so came this song to do so. we all live in a yellow submarine.....\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nthe song is about drugs, if you listen to it under the influence you would understand.  this song had the coolest backing vocals of all time during the chrous.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nOh dear god. Slash sucks at guitar. \n\r\nBack to Yellow Submarine. I love it, it's such a warm-fuzzy-bunnies type song.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nin the midsixties the guys stayed in greece, and there got sweed powder for their water. even children could drink this. thet was called y.s.only a children song.paul first liked to let children sing it.thats all.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nGreat song.  But then again, what Beatles song isn't? \n\r\nI do think it's ashame... reading posts here from people who are calling this song garbage. I do think the true genius behind it was how orginal was. Everything from the band playing around with their voices (\"Full speak ahead\") to their sounds of submaries... just very artistic and orginal. \n\r\nA very creative song.  It was a big kiddy.. if it wasn't about drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nafter looking at everyones comments i think...that ur either gonna like this song or ur not...and whether they were on drugs or not or whether they meant for it to be good or whether they meant for it to be bad or whether they meant for it to be childish..thats up to you. it also seems like the people who like it, tie it to a special memory or person...maybe if u heard it while with a person u like it is good to your ears...i personally like it. it reminds me of a good friend and it always makes her smile.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nafter looking at everyones comments i think...that ur either gonna like this song or ur not...and whether they were on drugs or not or whether they meant for it to be good or whether they meant for it to be bad or whether they meant for it to be childish..thats up to you. it also seems like the people who like it, tie it to a special memory or person...maybe if u heard it while with a person u like it is good to your ears...i personally like it. it reminds me of a good friend and it always makes her smile.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\neveryone says this song sucks, and i used to agree... i still kind of agree... but i had a different experience with it recently\n\r\ni was really stoned, and my friend just got a record player.  the first album she put on was Revolver, and Yellow Submarine seriously sounds crazy on vinyl.  so if you dont like the song, do a lot of drugs and then listen to it on vinyl!\n\r\noh, and this song really is about nothing, anything drug related you want to try and see in it is just the beatles fucking with you!  \n\r\nand to haters in here that say the beatles are overrated, that just means you dont like them as much as the other people who \"rate\" them.  so really you should say \"I dont like the beatles as much as a lot of people\" or something to that effect.  in my mind, they are the greatest band ever.  and they just loved fucking with people who tried to figure out meanings (ie. this song, i am the walrus, many more)\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\ni cant believe cbennet thought a song containing the words \"we all live in a yellow submarine\" was a warning AGAINST LSD...\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nHey skeetstan, guess what: I once started singing a made-up I call \"Pick a Pint of Purple Bread,\" and I've never even TOUCHED drugs. If you make an effort, you can be WAY more random than some song about a yellow submarine.\n\r\nBy the way, this song is NOT about drugs. It's just a cute little song meant for kids.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\ni dont like this song much but wanted to know what it meant.  maybe if pink floyd did a remake. that be cool.  \n\r\nwait the beatles did drugs? whodafunkit?\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nok, skeetstan your a dumbass, mewtaila \"pick a pint of purple bread\" i just died laughing, please if you could email the lyrics to ledzeppelin7200@netscape.net !\n\r\namnd goomba... why listen to crappy pink floyd remakes when you've got the real deal from The Beatles? \n\r\nYou guys still aren't getting it, this song isnt about stupid meanings or drugs.. its good old fashioned british humor.. haha like monty python\n\r\nand its also innocent yet very amusing humor, has nothing to do with drugs or nuclear war or any bullshit, and if that makes it childish than goddamnit let us fans of it be dubbed childish!!!\n\r\nI love this song. I love when Paul repeats the lines in the background followed by something that sounds like \"whAHA!\" lol my god how could that not amuse you? \"in our yellow.. SUBMARINE WHAHA!!!\" was pauls last quote. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nlol. its humor. oooh. i like it now :). also i saw the video its fuckin hysterical.  its like there all down there in the submarine and there is a big button that says dont push. and there like ringo, dont push the button, and hes like ok, but then he says ok  and just pushes the button. man those crazy stoners. there cookier then the three stoogies and marx brothers in tag team mud wrestling.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nThe Beatles enjoyed putting out songs then listening to what people thought the songs meant. Many people agreed that a lot of their songs were about drugs, but the Beatles never agreed to anything, other than Lucy In The Sky With Diamons, which was the most obvious out of all of their songs. This song is just meant to be childish and fun.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nThe Beatles where so high on drugs they even let Ringo sing a few songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\ni agree with kc0199 long time ago i know but yes you should read the anthology....And the beatles are classic....Theres more meanings to this ....and saying this is a childish song is wrong because when this song was produced it wouldn't have been childish compared to their music then\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nfact of the matter is you're all wrong. cant a band write a song that means what it says? i think its simply about what it says, the beatles changed by teh time they got to this album, they were goofy, its not about anything, and its teh worst song in histroy\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nYellow Submarine is definatly not the beatles best song...\r\nbut at the same time i agree it must have a deeper meaning than a childs song, or a song to sell records.\r\nLUKEFUN- I think your interpridation is SPOT ON!\r\nYellow submarine is without a doubt a song about drugs... that perhaps the beatles wrote whilst high...\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nI've seen this song on a sing-along video for toddlers...\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nIf you've ever done LSD or seen someone on it, it's easier to understand this song. It's easy to have a bad trip or start freaking out, and a simple childish tune that repeats over and over again can calm you down. \r\nThe beauty of this song is in how many different ways there are to interpret it. Everybody gets something different out of it depending on who they are. I think that alone makes it a good song.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nyellow=mellow\r\nsubmarine=(maybe)subconcious\n\r\nNOT A KID SONG!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nwould* lol\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\ni cant believe this, yes the beatles EXPERIMENTED with drugs, they werent addicts but as all rock stars do they tried it,maybe used it when they were feeling sad or whatever but y is there always 1 person who looks so deeply in the song to find that it is drug related? why is everything the beatles rite drug related..this is a simple song about NOTHING ok..the beatles may have writtn a song or 2 on LSD,but that doesnt mean all of their songs have some hidden meaning that its about LSD.u ppl are soo judgemental!!u just cant handle the fact that such a great band tried drugs and now u take every chance u get to accuse them of writing about acid!!if u were a true fan you wouldnt be making them out to be addicts which they rn't!\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nthis guys were high when they wrote this song! duh! but this song rocks and I love this song! the movie is quite strange but these guys are still the greatest. this song is one of my favorite beatles songs. i have pictures of the beatles all over my door\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nadri... get ur facts straight. they used LSD a lot more than \"when they were sad or something\" For a period in time they used it tons but then they got a hold on themselves and stopped (and decided to take up meditation after that, George introduced it to them)  \n\r\nYellow Submarine was written because of the beatles idea to make a cartoon called the Yellow Submarine about a guy who sailed the sea and saw a lot of cool things.  They wanted to do this because they like Disney movies and decided to make one a little psychadelic.  I think it was actually made and the song was written to go along with it.\r\nTHEY WERE NOT HIGH WHEN THEY WROTE IT! THEY NEVER WROTE SONGS THAT WERE RECORDED WHEN THEY WERE HIGH!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nI wonder how many drugs they where on when they wrote this song......\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nthe beatles wrote this song as a childrens song. He is quoted in the newspaper stating that fact, but everyone took it to be about a big acid trip. it was never meant as that at all.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nOh and I think PINKFLOYDFAN101 has it with the meaning... well done dude\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nI don't know why this song gets so much attention.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nFirst of all any one with Emo in their name, should leave the beatles well alone, they're in no position to comment! \n\r\nThe Beatles didn't often delve deep into cryptic meanings in their songs, so this song was just written as a childrens song, not at all one of my favourites though.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nWith this song and Octupusâ\u0080\u0099 garden, it seems Ringo was the most aquatic, and while im being facecious, George was most earthly, Paul was the most long-winded and without doubt, John had to be Fire â\u0080\u0093 he was the most angriest out of the whole lot!\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nAm I the only one who got right away that cbennett was joking?\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nIf this one is against acid, wasn't there a great double standard?\r\nin Lucy in the Sky with Diamonds, they rally seemed to like the drug...\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\ni am post 100...i win :) i dont even like this song at all\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nthis song is awesome, it is not the beatles's best song by far though. I hate when people say..\"..you like the Beatles? wtf what do they even sing, Yellow Submarine......\" It's like....all some people know of the Beatles is that song, The Beatles always have been and always will be the greatest band ever.  Paul McCartney.....i love you\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nUnder the influence of marijuana, it's very apparant that this song is about perfect working communism. \n\r\n\"As we live a life of ease, every one of us is all we need; sky of blue, sea of green, in our yellow submarine.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\n....I watched yellow submarine for the first time EVER today! i feel that my whole childhood was a waste of time for not including that movie, and now, almost 18 years after the first time i saw this world, i can now say that my life is complete. I have seen, Yellow Submarine! lol\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nWhat is wrong with you people?  It seems that you can't see past the idea that the song is about acid or is a childrens song.  How about you think about it for a good long time.  If your interesting in knowing what was really ment by this song you can check out giftofgabe.com which is the official web site of the book \"The Gift of Gabe\" which contains much information on interpretation of songs especially by the Beatles.\r\nw0rm\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nthis song isn't anything except a trippy random song. submarines are cool and yea. i loved this song when i was little we played it at pool parties all the time. but anyways i do love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\ngeocities.com/~beatleboy1/…\r\nI used to think there were deeper meaning to this simple but cute song. Well, according the interviews done, there isn't. I guess some of us just want to romanticise songs huh?...\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nIt's just a fun song.  Not meant to be taken seriously (especially as seriously as some of yous).\n\r\n\"would* lol\"\r\nAlso: closely; when; dialated; he's.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nWell i think the song is about wanting to be self sufficient and away from bad people, like they want their own little bubble, with their 'friends are all aboard' sea of green is a technique of growing cannabis, and the sky would be actually blue cos they would be underwater, i also think that it is a childrens song in that sometimes i listen to it to regress (or is it reggress?) anyway to go back to feeling younger and unaware of the greater evils in the world. iI think it could be about some man they looked up to who told them about the wonders of the simple life, but they adapted it to suit what they wanted, water is very calming dont you think?? ...\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nAlright, seriously. I hope that if you read some of the other opinions you get to this one, because I am astounded by some of the stupid things Iv had to read in this comment section. At one point, I believe someone actually said that Kurt Kobain was a better lyricist then John Lennon, or any Beatle.\n\r\nRest assured--They are foolish fanboys, consumed by a band so they instantly assume its better then other bands. Fact of the matter is that Beatles revolutionized rock in hundreds of ways. Nirvana would have, of course, never existed if not for The Beatles. The Beatles bassicaly invented metaphoric and symbolic lyrics in deep layers. Well, may not have invented in the traditional sence, but they certainly made them useable, mainstream, and inspired masses of people to do so in the future. I didnt even like The Beatles untill about 6 months ago, but since then I took the time to learn all there was to know about them. They did everything from invent the internet, to get the Rolling Stones their start, as well as encourging them in all regards.\n\r\nBut yea, besides that: Yellow Submarine could mean manythings. It could of course mean drugs, as many of there songs were written while on them (seriously, dont try and act like they werent. The group admitted to this hundreds of times, as well as each one being aprehended various times for marijuana posession). It could also just as easily be a childrens rhyme. Unless you hear it from the artist, let it mean what you want it too.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nRiiight, USCott08, we're the idiots. You better be kidding. You have to be both gullible and kind of dim to still believe that Paul is dead. He's not dead, why the hell would people be covering up his \"death\" if John and George died too? I've read all the ridiculous theories and they're all stupid. Anyway, Yellow Submarine was just a child's song that John and Paul wrote (NOT Ringo).\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nto valkriestar u suck and r pretty ignorant to think up lame shit like that.u are entitled to an opinion but damn!do u have to be that goddamn ignorant.\r\nplease refrain from lame comments like that.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nYellow Submarine is not crap. Yellow submarine is a work of art by the brilliant paul mccartney, about nothing in particular. You try and write something about nothing and see how far it gets you - but for the beatles - even with ringo's poor voice, it earned them yet another place at the top of both the US and UK charts. Not many artists have done even that, especially with a song about nothing.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nPaul has said it out of his own mouth atleast two times on tape that Yellow Submarine was influenced by something Ringo said when Paul, John, and Ringo were together tripping on LSD.\r\nFirst time was when he was asked in a interview what the song meant back in the 70's and the second time on the beatles anthology. \r\nBy the way, the beatles are very important band because they were way ahead of thier time and the music they made seems to still have good taste.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nthey were genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nRow, row, row your boat,\r\nGently down the stream.\r\nMerrily, merrily, merrily, merrily,\r\nLIFE IS BUT A DREAM!!!\n\r\nanother children's song with more meaning than most know\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nSea Of Green is where you grown loadsa weed plants close together. I hate seeing people argue on every song about \"its about drugs\" i doubt their songs revolved around it, they just throw you off with drug refarances and wrote a lot of them whilst tripping, so its gonna be a lot more confusing for sure.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nto otohp:\r\nisnt that song about the plague?\r\ni dunno thats what someone told me\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nI don't think this was a kids song either. They were either very bored or very high on drugs when they made this song, but i have to admit, I love this song still. It's a fun song to dance and sing to when you have friends over and you are bored.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nThis song acutually kicks ass, if you like the beatles you have to like this song. some people say its childish, i kinda have to agree cos we sung it in primary but it dosnt make it bad, it still rocks :D\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nI'm surprised so many people don't like this song. I think people always want a song to be something direct, and for the meaning to be just there and for you to figure it out, straight from the writing. Well I have learned to interpret songs in my own way, and take there meaning from my standpoint, meaning that many songs mean whatever you want them to mean to you.\n\r\nTo me there isn't much to this song... speaking directly from the song. If you read the lyrics over and over again you won't get an \"answer\" just like many songs. I love this song though because it gives off a vibe or ... kind of an outlet of a perfect happy place. Wether or not the beatles were refering to a perfect place, it seems like it and thats the vibe I get from it. Now, whether they're happy place was created from being on drugs... or it was just them dreaming about random crap... it gives off a happy simple vibe. I think people should see it for what it is. My yellow submarine is music .. :D\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nawww shit , i love this song sorry it make me happy [:\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nI apologize for possibly sounding naÃ¯ve or stupid, but this song has always seemed communist to me... I don't know why, but something about \"our firends are all aboard, many more of them live next door\" just seems it to me. I didn't search for meaning; it just came as a fleeting thought, and after all, John was a Marx-ist, was he not?\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\npsh anyone who says this is the worst Beatles song has not heard \"The Word\"\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nIf you wanna see more trippy songs like this one check out Interstellar Tin Can, they're a new english band, but they write wierd amazing lyrics!!\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nIf you think about it, The Beatles are geniuses for coming up with this. Create a song(whether it have hidden meaning or not) that is almost guaranteed to get stuck in people's heads so they'll remember the song for a while.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\noh and to the person who said about ring around the rosie its not about the holocaust its about black death\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nAlthough this song isn't the best musically, it is a fun song to listen to.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nThis song is not about acid nor is it a childish song it is just a song about happiness '' As we live a life of ease everyone of us has all we need.'' that's what the song's about.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\ni loove this song. i dont see why everyone hates it. it makes me so happy. it describes the perfect place. and idk if i believe in an afterlife, but if there is one, i will be on the yellow submarine when i die.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nim not sure if anyone talked about this already (theres too many comments to look through them all!) but people say that in the one part john is shouting \"Paul's a queer! Paul's a queer!\" its at like 1:37 on my version. i dont think it sounds like that at all and i dont know how people could get pauls a queer out of that...sounds more like \"hot potato\".\n\r\nanyone else agree/disagree??\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nWTF??? this song used to rock my lil world when i was little, how can you say that its crap? whatever your personal thoughts on the meaning of this song you cant say its a bad song. mayb its just that it holds sentimental value for me but i dont think its crap\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nThis song is not just a silly, random act of lyrical misconduct...It is itself an exploration of The Beatles psychadellic characteristics. And also, think about it: sea of green equals see of money, yellow submarine equals isolation from everyday society. The man who sailed the sea in a submarine is simply a metaphor for the band itself. It's not just a kiddie song.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nI really like the school bus theory, something like that had crossed my mind forever ago. However, reading it over and listening to the song it sounds like it could be about the the childish fantasy that fame is absoloutly great all of the time. Sort of a sarchastic, childish-sounding rant.\r\n\"As we live a life of ease,\r\nEveryone of us has all we need,\"\r\nThat's one of the big lines that got me, their lives were easy in theory, but think of \"Beatlemania\" some of the stories sound awful for them.\r\n\"And our friends are all aboard,\r\nMany more of them live next door,\"\r\nThis was another one because everyone says \"I'm going to be famous and buy big place and my friends will visit all of the time\"\r\n The see of green could be big money record labels or something. L\r\n-OR-\r\nSomeone had really nice trip, I think that with a lot of musicians from around that time you can never 100% rule that one out.\r\n-OR-\r\nThey thought it would be fun to write a children's song for people like us to endlessly analise and argue about.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nOh, come on guys! This song is hilarious! Whenever I listen to this song intently, it always make me at least chuckle, if not laugh aloud. I mean, a yellow submarine? Why not!?\n\r\nAnd I think it's a pretty good song, too. I like the melody, and it's a blast to sing along with.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\ni totally disagree w/ \"iamtheone\"\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\n\"skiff\"- the Beatles were amazing and really revolutionized american pop culture. Please do not put down the brittish trailblazers.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nI like this song, but I don't like how people will tell you (the experienced Beatles fan) that they LOVE the Beatles and then say this is their favorite song. I mean, it could be, but there are so many better songs showing more talent, in my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nskiff-\r\nthat's your opinion, but don't trod on the opinions of others. Respect the fact that we love the Beatles. Plus, they rock even now. (Ringo and Paul, that is.)\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nThere's so many possibilities. It's endless. Someone needs to just go with a notepad, and get Ringo and Paul to answer all the Beatles questions. I bet you they wont know half the time. I like the Idea of it being just life. You live, and you die. \r\nSubmarine - Coffin - Under the world sort of, you know...\r\nAnd just read it, i reckon it's quite cool. Open to all things though. I just think the chord and melody structure is happy, becuase they can (they're the Beatles!), and they can't do anything abuot dying.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nNo, i think it is, just reading over it again...\n\r\nIn the town where I was born,\r\nLived a man who sailed the sea,\r\nAn old guy that's done the rounds of the world you know, then has done his time...\r\nAnd he told us of his life,\r\nIn the land of submarines.\n\r\nSo we sailed on to the sun,\r\nTill we found the sea of green\n\r\nSo we did our life, we did well found money, (Sea of green)\n\r\nthen just keep reading i'm sure you'll understand.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\ni read something, they said it was really just a kids song. you know, not EVERYTHING has to be about drugs, even if it is trippy.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nyou people anger me. You make yourselfs look like idiots.. \"where they on something?\" No duh! do you know anything about the beatles? Dear god people. Maybe we should try and learn about a band before we critize them or say that they against LSD...THEY ARE FFFOOORR LSD\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nThis song was actually the song that got me to listen to my first Beatles' cd. Now I am in love with the Beatles, and I hardly even listen to this song anymore. But the more I learn about the Beatles the more I delve deeper into the lyrics, searching for hidden meanings, in all of their songs (which is why I joined this website), but I can't come up with much of anything very convincing for this one. It does seem like maybe their first experiences with drugs. In the town where I was born there lived a man who sailed to see...so we sailed on to the sun...like, they were introduced to whatever drug this happens to be by a man who had taken it frequently, and they all decided to give it a try after seeing what a fantastic life it seemed to be for this man. It reminds me of Alice in Wonderland. That was percieved as a childrens' book and movie until you realize the author was high the whole time. But I really don't know. It does strike me as strange, though, that in a submarine they can all feel so free. Submarines are cramped and scary...they are UNDER the water!! big metal things that just go quietly throw the water except for the sonar thing, and it's dark, and I can't imagine how the Beatles ever thought of it for this \"happy\" song.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nActually, I like Ruralfreed's explanation. It makes sense and satisfies my confusion.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nI never liked this song, but last night I was taking 1 and a half hit of lsd and i was starting to have bad visuals in my head. I turned off the psychedelic early floyd and put this on. It made my trip enjoyable, seeing funny and happy things again, I will always have respect for this song now.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nWow none of yall have come even close....the beatles were part of a culture seriously lead by marijuana.  if you noticed key phrases in there and knew a little history it would be obvious.  in the 60's, rolling papers used for joints were primarily yellow, and when rolled, resembled a submarine.  Especially after finishing one.  The man spoken of in the beginning is the guy who introduced them to marijuana use.  The sea of green spoken of in the first verse is actually a growing technique that keeps a steady supply coming, with a harvest every month.  the line \"our friends are all aboard.\" means all their friends smoke too.  living the life of ease also refers to marijuana use for obvious reasons.  I dont see how cbnnet came up with hidden LSD messages, but you either need to get off or start using the drugs, cuz what your doing now isnt working lol\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\ni like this song, sorry. i think it's basically about a drug trip. nothing serious though, it's light-hearted and fun. just another random weed experience. \r\nwatch the movie \"yellow submarine\" that is SOOOO trippy!!\r\nbut i think it's funny, it isn't supposed to have a hidden deep meaning, i personally think it's just the Beatles all high and laughing\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nif you think of it as a childrens song it could be but it could be triippy to.   see of green,pot.plus the movie is realy trippy. and its probably about peace,we all live in a yellow submarine.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nhmm...I once heard \"yellow submarine\" was a reference to mescaline...Idk if anyone else said that already or not, I'm too lazy to read all the comments!\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nit's about communism!\n\r\n\"Everyone of us has all we need,\"\n\r\ndoes that not sound like communism?\r\nidk, it just struck me earlier.\n\r\ni adore this song, however terrible it is. i remember when i was a little girl at girl scout camp, during a meal someone would yell \"air raid!\" and we'd all dive under the tables and sing the refrain to this song. it was amazing.\r\nand then it got banned because people hit their heads. \r\noh well...\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nListen people. The Beatles did drugs, we all know that. Most likely this song was influenced by drugs, but The Beatles didn't write their songs about drugs. Sure, Lucy in the Sky with Diamonds, but that wasnt about the drug LSD, it was about the psychedelic experience. Anyway, if you take in to consideration everything that The Beatles represented about peace, love, and happiness, the most likely interpretations are that the submarine represents a personal microcosm and the sky of blue and sea of grean, etc. represent the paradise that everyone wishes for, or the interpretation that submarine means coffins and that death is inevitable and that we should all make the most of our lives. And really people, we're not here to judge a song, we're here to interpret it. If you're not going to praise it, at least dont complain about how much you hate it.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nA wise man once told me about the meaning of this song, and I agreed with him. Are you ready???\r\nThis song is about people who have found wealth (blue & green). Live in their house (submarine)\r\nand don't interact (beneath the sea) with their neighbors. NOW, go out and say hi to your neighbors.......\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\ntest\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\n\"Submarino\" is spanish for submarine. And in spanish, \"to do a submarine\" means smoke pot in a closed place. So I always thought of it like that.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nThis song is genuis. Its fun.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nGotta Love Those Taoists :)\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\ni know for a fact the song isnt simply, \"a childrens song with no real meaning\" im only 16, but i think this is a one of thier really deep songs,\r\nmostly, the beatles' songs true meanings are just too deep to decipher and wer based off of moments tht they themselves only experienced.\r\ni dont know bout u guys, but i happen to like this song..\n\r\nits catchy and simple, yet deep and mysterious.\r\nthats what makes the beatles.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nIt would seem as though a lot of people don't really like this song, but it's always been one of my favorites. When I thought about running away sometimes, I would play this song, and that helped.\n\r\nFor some reason, I had always thought about it this way: they were going underwater to live in submarines, with \"our friends are all aboard, many more of them, live next door.\" So, there would be like everyone you were close to just being with you, with no worries or anything.\n\r\nI don't really know or care if that's right or wrong or whatever, but that's what I've always thought about when I play it. And yes, the movie is pretty trippy. The Wall is the trippy-est, though, in my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nOccam's razor, anyone?\n\r\nThe simplest explanation is the most likely, soooo most likely they just wanted to make a different, light-hearted song for their era.\n\r\nOrrrr they were all on crack/LSD/sniffing Sharpies.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nThis song could have multiple meanings\n\r\n1) Marijuana, the man who sailed the sea could possibly mean the immigrants coming over with drugs. The fact he told them of his life could mean he was telling them how great the stuff was. 'sea of green' green is another word for grass, 'lived beneath the waves in our yellow submarine' could mean they thought more deeply into things (as marjiuana does), this was there first recognition of the drug and also things about life. \n\r\nAs the poem goes on it starts to become even more ironic. 'Our friends are all aboard, many more of them live next door' meaning that there  are people who also understand different things about life, the people who live next door are the people who have still to recognise these things. \n\r\n'As we live a life of ease' also has connotations of being stoned\r\n'Everyone of us has all we need\r\nSky of blue and sea of green' \r\nhere they are making us realise that material things mean nothing, just the simplistic things that make life such as the sky and the sea.\n\n\r\n2) It could be about isolation. The town where HE lived, and the MAN who sailed to sea, could be reffering to himself and how he feels isolated, he achieves this by using a strong metaphor 'submarine'. The fact that sumbarines.\n\r\nThe first 'stanza' is basically how they started to feel isolated, the 'sailed towards the sun', meaning they were looking for fame and to be recognised, then realised that having so much fame took away there private life 'till we found the sea of green'\r\n'and we lived beneath the waves' means they haveto keep there thoughts to them selves, below the surface. \n\r\n'many more them live next door' meaning they cant get to them, they feel isolated from there friends even although they are so close.\n\r\nThe last stanza is meant to be ironic, 'as we live a life of ease' as everyone knows that being famous isnt living life at ease. 'everyone of us has all we need, sky of blue and sea of green' shows irony as isolation has taken over him that they cant appreciate communciation anymore, the only things that they have/had any relation with is the sky and the sea.\n\n\r\n3) The song could mean the meaning of the song, if you get me?\r\nLike the beatles are showing how they get there meanings across through songs.\r\n\"And he told us of his life,\r\nIn the land of submarines.\"\r\nmeaning there telling us a story through the song deeper than we think.\r\n\"And we lived beneath the waves,\r\nIn our yellow submarine.\"\r\nwaves makes me think of 'sound waves', meaning they became dependant on getting there messages across through songs.\n\r\n'And our friends are all aboard,\r\nMany more of them live next door,\r\nAnd the band begins to play.'\r\nmeaning that there could be more than one meaning to there songs. 'and the band begins to play' could mean they want you to listen to it again and try and find out the other hidden meanings.\n\r\n\"As we live a life of ease,\r\nEveryone of us has all we need,\r\nSky of blue and sea of green,\"\r\nCould mean that they think that getting a point across through music is easier/more effective than making it blatantly obvious. They are showing how a simple song is all thats needed to get a strong point across '..has all we need, sky of blue and sea of green' the simplicity of the sky and the sea, but also the big capacity, and the fact that is all we need, shows the huge range of possibilities one song could mean to an invididual :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nTo me, this song is about getting high with your friends (similar to With A Little Help From My Friends). lukefun interprets it about the same way I would. I also like dominicana's interpretation.\n\r\nSeriously people, this song can have more than one meaning. That was the great thing about the Beatles. There was always more to them than met the eye.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nI think that this song's meaning is that most of us live our lives as if nothing else was happening in the world. We go through our lives only really caring about things that directly affect us in everyday life. We live in this tiny yellow submarine and we need to pay attention to the world outside of our little submarine.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nThis song is simply a childrens song. Although this song is from their first psychadelic rock album Revolver. It's just another happy Beatles' song.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nAlso might i add that Revolver is one of their best albums if not the best i would say it's second Sgt. Pepper would be first. But i love this album because It is so different from all the others the musical style is different and lyrical subjects are different too.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nI think it's funny that my brother runs into the house when he's about 9, and says, \"There's this cool new band out, Dad, it's so good, they're singing about a yellow submarine or something!\"\r\n...this happened in the late 90s. LOL!\n\r\nBut to the point,\r\nthe meaning can be interpreted so many ways,\r\nAnd lyrics can.\n\r\npersonally, when I hear it,\r\nI get the intense craving for a good trip.\n\r\nBut some people find it meaningless.\r\nIt's all different to the ears listening to the songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nI've already posted something, but my mind has changed about the meaning of this song. I think it has to do with fame. Yellow tour bus...sky of blue (bright future ahead)...see of green referring to the flow of money. It's saying how wonderful this life is, but almost sarcastically. \"As we live/a life of ease/Every one of us/has all we need\" this would be how being on tour, they all have what they \"need\": money and prospects, but they are saying real life is deeper than that, and to envy them is silly (which is why it is under such a silly pretext). It's like they are repeating what a person may say of their life, but sarcastically to point out that it isn't as fantastic as everyone might hope. Also, while Ringo sings this, I do believe Paul is the writer for it.\n\r\nI really hope I'm not stealing what someone has already written. I've thought this for so long, it is possible the idea came to me through what someone else has said, so if you said this first, sorry!!\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nlol the person who wrote this song was on something? no shit............\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nYellow Submarine-I read the first page of the 2002 entries (from what I've seen of the dates, this appears to be when this website came into existence).  Someone said that this song means to them that The Beatles can get away with making a silly song and it will be a hit.  Others said itâ\u0080\u0099s about drugs and some said it means childhood and growing up.  For me, the song means, that is, what I think of when I hear it is that The Beatles can get away with a silly song (esp., having Ringo sing it gives it that silly, we don't take ourselves too serious attitude) and it will somehow make a lasting impression on their listening public.  Personally, I think the song itself is awful.  But whatâ\u0080\u0099s so amazing is that somehow the Beatles are so damn charming, so damn clever and inventive and creative and just so damn good that a song as bad as this becomes one instantly recognizable.  It goes from bad and forgettable to a curiosity that is almost listenable.  It brings forth quite a bizarre imagery set and Iâ\u0080\u0099m taken somewhere even if I donâ\u0080\u0099t know where.  For some itâ\u0080\u0099s to a place in which they want to impale things.  But for most of us, itâ\u0080\u0099s a better placeâ\u0080\u0094childhood, the sea and its mystery, an adventure or to thoughts about what in the hell were they actually thinking with this one?  And to boot, they make a movie with its title.  Drugs?  Indubitably!  The English were so conservative, â\u0080\u009cprim and properâ\u0080\u009d I think they call it.  The Beatles (esp., John) were so irreverent, so cheeky, so New Britain, that they challenged everything holding them back.  This creative and unbounded energy created songs/movies Help!, A Hard Dayâ\u0080\u0099s Night, and Yellow Submarine.  The last of which was helped in no small part by the psychedelic drug culture of the 60â\u0080\u0099s. This creativity (with and without drugs) didnâ\u0080\u0099t come out all that great in their movies, but their songs trump all.  And this song represents for me all of these disparate elements coming together into a silly but poignant sign of  where The Beatles came from and played a fundamental and integral part in shaping music both silly and profound.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\ni think that the yellow submarine was a place the beatles had to go because they were known all over the world. they couldnt go out in public because they would be noticed. They were stars and people would freak out when they saw them.\n\r\n\"And our friends are all aboard,\r\nMany more of them live next door\"\r\nthe beatles relate to many other celebrities because now they are famous and have to live in a bubble because everybody knows them now.\n\r\n\"And we lived beneath the waves\" \r\nthis line is kinda self explanatory. they try to stay beneath the waves to stay out of the public's eye. just a thought. not sayin im right\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nI don't know why, but every time this song comes on the radio, my father blasts it and sings at the top of his lungs.\r\nAnd every know and again..I find myself whistling the tune.\r\n=/\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nThis song, like many other beatles songs, were written so that you can come up with your own meaning.  It probably had its own meaning to John just like it has its own meaning to each one of us.  And for those thinking its purely made as a child's song with no real meaning, I do not think they would release a song like that.  Listen to the lyrics and you can't help but find your own interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nNot that I'm saying this is the 'official' or 'real' interpretation, but personally, I see this as a lighthearted song about death:\n\r\nIn the town where I was born (the start of life...)\r\nLived a man who sailed the sea (life can be related to a long journey, perhaps overseas)\n\r\nSo we sailed on to the sun (sailing on to the sun=sailing to a higher place, to heaven)\r\nTill we found the sea of green (brings to mind a carpet of grass, like in an outdoor funeral)\n\r\nAnd we lived beneath the waves (beneath the waves... beneath the surface of the earth)\r\nIn our yellow submarine (we're all in the same boat; we all die)\r\nWe all live in a yellow submarine (...)\r\nAnd our friends are all aboard (same idea)\n\r\nAnd the band begins to play (funeral music, perhaps)\n\r\nSky of blue and sea of green (again, this brings to mind a funeral outdoors)\n\r\nI don't know, I think it kind of fits. I'm not getting a drug vibe from this :)\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nthis song was very nostalgiac probably of their childhood, even though I think they were high when they did this. Either way it is a childs song talking about the carefree lifestyle of the 1950's and them living in their own little world(Yellow Submarine)\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nAll it is is a cute, child song. The end. \t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nAll it is is a cute, child song. The end. \t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nAll it is is a cute, child song. The end. \t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nthe 1st part talks about the person who showed them the idea of higher consciousness and how he found quote unquote the land of submarines\n\r\nSo we sailed on to the sun\r\nthis is when they used heavy hallucinogens to produce a higher conciousness effect for themselves\n\r\nTill we found the sea of green\r\nthe sea of green is the happy place they went after understanding that material possession is merely material possession and not a way of life\n\r\nAnd we lived beneath the waves,\r\nIn our yellow submarine.\r\nso with their new ideas about life they are living in their metaphoric yellow submarine or higher conciousness\n\r\nAnd our friends are all aboard,\r\nthey are saying their friends get it too\n\r\nMany more of them live next door,\r\nthere are others who are right there but dont fully understand what it is to let go of material possession\n\r\nAnd the band begins to play\r\nduh they r the band\n\r\nAs we live a life of ease,\r\nEveryone of us has all we need,\r\nSky of blue and sea of green,\r\nIn our yellow submarine.\r\nnow they just explain what its like living in that higher conscious state only needing blue skys and good thoughts to live their lives in their metaphoric yellow submarine or higher consciousness you can probably thank the dalai for this oh so annoying but way more insightful then any of us kind of song\n\r\nin short its about living a carefree life free of everything but blue skies and positive thought here on dry land. and yes it makes for a great childrens story as well as news story... but dont always believe rock star quotes from tv or papers unless they came from john lenon.... he was one of the only major stars ever to be as real as he was. plus he got shot for telling the truth on tv which pretty much proves that he was cool enough to b real. so in his honor i say......\r\npeace peace peace peace hair peace bed peace peace to all and everyone peace to all who with one read can understand such simply ways of explaining life... peace\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nahh...woops xD\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nSgtPepperLHCB , hear hear. i love it. it is an amazing song as with all the other beatles songs. \t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nI have no reference but I once heard that this song was about a popular pill in Liverpool when they were younger. The pill was supposedly yellow and oval-shaped with the street name 'Yellow Submarine'. I don't know how true this is especially because I'm pretty sure The Beatles didn't experiment with drugs until much later when trying to stay awake to record. But then again the entire back side of the Yellow Submarine album, (Pepperland, Sea of Time, Sea of Holes, Sea of Monsters, March of the Meanies, Pepperland Laid Waste, and Yellow Submarine in Pepperland) is like an acid trip and a half, sounding much to me like Disney's Fantasia movies or whatever.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nthe yellow submarine sybolizes a vile of LSD\r\ncmon guys the whole album and movie was a straight up acid trip\r\nopen your eyes!\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nAm I the only one who actually LIKES this song? seriously. \r\nGrow some ears please. \t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\ni remember singing this as a 5-6 year old at school.amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nIt's just a silly fun song nothing more nothing less...\n\r\nI think it's a lot of fun but I enjoy most of the different styles of The Beatles.  I think the silly Beatles songs are some of my favorite.\n\r\nI don't think this song has to be about drugs, sex, or Kurt Cobain's death....\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nthis song is not a childish song it is a metaphor for smoking pot. submarine referring to a joint and the sea of green as pot. the man i think could be bob dylan who was the person that first smoked pot with them and it was the entire band who was with them. notice the beginning of the submarine sounds it sounds like some one taking a toke. if u add all these facts together u get a song about pot AND THEREFOR THIS SONG IS GREATNESS\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nI think this song is about an adventure in a yellow submarine.\n\r\nWhy do people say everything is about drugs....WTF? Nothing is about drugs ya weirdos!\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nyou are all idiots whoever this song had nothing to do with hidden messages or other stupid propagnda like nuke disarmarment or any other dumb notions you people have posted it was simply done because the beatles were trying to do some kids songs elanor rigby an the octopus one were all kids songs pull your heads out of the damn hippie dream and learn the facts  \t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\neveryone always makes the mistake of thinking that the beatles songs were all about drugs or their trips on drugs eeeeeehhhhhhhhh wrong losers \t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nThis song is obviously a huge metaphor just like Octopuses Garden was.  They just wanted to be alone so that no one could bother them.  Think about it, they mention they have all their friends but don't say anything about random people or fans.  They hated the publicity and would run away from fans.  \r\n  This song is really simple, it's just a metaphor like The Long And Winding Road.\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nI'm surprised at all the negative comments this got. I admit, Ringo is not the BEST singer, but I still think this song is one of their best (thus my username). This was also the very first Beatle song I ever heard, when I was 9 and saw the movie for the first time. I like the fact that it's childish-It always cheers me up no matter what. =) \t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nI don't get it. if the beatles say its just a children's song why can't it just be a children's song?\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nIt means nothing, its cute, its fun, its happy, it was probably written high. Movie is trippy as fuck though.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nSTFU STFU STFU ALL OF YOU STFU GOD DAMN. \t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nOkay, seriously, this song isn't about drugs or death or communism or anything like that. It's an innocent children's song written by Paul and John (mostly Paul, though) for Ringo. Nothing more, nothing less. \t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nIt is a pity that there is so many meaningless comments.I read them so long but found nothing new.\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nThis song sounds like a child's song-It was on the \"Beatles for Kids\" tape my parents got for me when I was five-but the Yellow Submarine is actually a reference to a type of drug.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nI'm no expert here, but I seriously doubt The Beatles released this as a childrens song.  I read an article a long time ago about songs with a hidden drug reference and they specifically detailed this song.  From what I read, it was about a commonly prescribed downer, maybe for ADHD or something back in the 60's.  The pill was abused often and easily attainable.  Being that it was a downer and a yellow capsule spawned it's nickname \"Yellow Submarine\" as the shape is similar to that of a submarine, and a downer brings you down like a submarine.  I wish I remembered the actual name of the drug, but as I said I read the article years ago. \t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nWell, my take on it is that this song is really an anti war protest tune. The sea of green being soldiers and they went into a yellow submarine ( yellow as the color of cowardice) beneath the sea of green, with friends next door ( Canada ). \t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\ni think it's about how we're all living in a little happy bubbly we've created for ourselves ( the yellow submarine ) , living a life of ease and blocking out that there are some really terrible things going on around us ( we sailed up to the sun and lived beneath the waves )anybody agree?\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nOh, my...the lack of knowledge about the Beatles is staggering. Paul says that the idea came to him while he was falling asleep. Just a simple children's song, nothing more, nothing less. And who better to pull it off than Ringo. It's also important to know that this song was part of one of the few double A-side singles that the Beatles released. What was on the flipside? \"Eleanor Rigby\"! Isn't it just a wee bit possible that the Beatles were announcing to the world that the band could no longer be pigeon-holed as just another pop group?\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nPaul wrote this song as a children's song, but found his voice didn't work for it so got Ringo to sing it.\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\n\"Sea of green\" might be interpreted as the big money that the Beatles personally came into.\nAs they became mega-famous, they became more separated from normal people as well as protected by security, and so became companions who were isolated to some degree from the outside world, kind of like being in a submarine.\nI see this as sort of a humorous \"slice of life\" song of their experiences at the time.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nThe life many \"civilized\" societies take for granted. The bubble we wrap ourselves in to pretend our easy \"buy more stuff\" lifestyles aren't harming the rest of the people and planet. It's yellow to represent gold to represent wealth. Just like the yellow brick road in The Wizard of Oz. Our friends all being aboard is pointing out that we all feel ok about this because everyone we know is a part of it as well. It's \"Just the way things are.\" Until people are forced to see firsthand what this lifestyle does they can remain completely detached from it. Living a life of ease in their yellow submarine. It's ignorance of world issues by being distracted with selfish desires.\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nWhen Lennon describes his first trip on LSD, he talks about how George's house felt like a submarine. This song refers to all of their first trip and how high they all were. It is obvious if you think about it:\n\nSailing to sea = doing LSD\nBeneath the waves = being on drugs makes a wavey feel\nYellow submarine = literally George's house but has a deeper connotation of their new lifestyle with hard drugs\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nI think saying this song is simple and childish is a massive cop-out. First of all, very few people were constructing songs with sound effects in 1966, and they certainly were not reaching as many people that the Beatles were. Second of all, the melody to the verse and chorus are insanely catchy. Simple perhaps, but effective. \n\nTo put this song in its proper cultural tradition, one must look back to the absurdist radio program the Goon Show. This song isn't supposed to be interpreted on a symbolic level, its simply a heartwarming song about friendship and a life without worries.\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nAs a kid when I went to the beach,  and gazed intently at the sea, the waters would appear  to be green. I am not sure whether green means money alone because there is plenty of greenery in nature, or what is left of it. Incidentally, I  still recall watching waves, small ones like ripples lap into the  shore from various angles, different directions. Whenever they collided I always thought they would   sort of crash and disintegrate,  but I was surprised and thrilled to find that they would always merge and reemerge and continue along their course  as if nothing had happened. A wave is first and foremost not just an abstract trigonometric or periodic function,  but a real physical entity with a crest and a trough, although math can hope to capture and model some characteristics or aspects of it,  to the extent possible,  but just by remembering what I saw,  I can say with absolute certainty, the waves in reality  neither know about nor care to obey the law of the integral of Fourier series.\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nOne of the greatest piles of dogshit in musical history.\n\nUtter bollocks.\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nThis song is really a child song. It is really very very bad.\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nThis song is quite clearly a cry for help. The Beatles are also pleading for people not to try acid. Though, the song may appear to be simple, there any many hidden messages in this song, not least they are warning against LSD and campaigning against Nuclear Disarmerment.\n\r\nThis song, seems deceptively simple but is in fact the most complex and meaningful song the Beatles ever wrote and by far their best song. \n\r\nIf you look at the lyrics closely you will notice a distinct patter, the amount of l's and s's and d's give it away. Land Submarine Door. You see LSD. It's so odvious.\n\r\nIt really is a terrible shame that No-One understands the Beatles.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nThe only track I skip on Revolver, but I did like it as a child\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nScheisse...the word is \"tyypo\" ;)\n\r\nLHCB (which I choose to pronounce Luh'kib)...\r\nI would enjoy seeing any actual sentient beings who believe this song has any merit whatsoever, artistic or aesthetic.  And then I would enjoy impaling them on something really sharp.\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nsubmarine = coffin\r\nthe sea of green = the grass on the cemetery\r\nwe all live in a yellow submarine = we are all gonna die anyway....\n\r\nget it ?\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nlmfao. LET'S GO ROOT DEAD CHILDREN. i think not. i don't know what the lyrics mean. i don't really care either. they play this song on my school's tv announcement system EVERY day. it's annoying. this is the worst they ever did.\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nbabycakes, you have no musical taste whatsoever, even the beatles could admit that this isn't their best song\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nI think it's about doing acid. It sounds childish because when you're high you act pretty childish. Clever, eh?\n\r\nAnyways, here is my dissection of the song:\n\r\n\"In the town where I was born, \r\nLived a man who sailed the sea\"\n\r\nThis line refers to the dealer.\n\r\n\"And he told us of his life, \r\nIn the land of submarines.\"\n\r\nHe's telling them about his experiences on acid. \n\r\n\"So we sailed on to the sun, \r\nTill we found the sea of green\"\n\r\nThis line's about dropping acid til you're on a trip\n\r\n\"And we lived beneath the waves, \r\nIn our yellow submarine.\"\n\r\nWhen you're high your troubles, or 'waves' are away from you.\n\r\n\"We all live in a yellow submarine, \r\nYellow submarine, yellow submarine\"\n\r\nOr we're all on acid.\n\r\n\"And our friends are all aboard, \r\nMany more of them live next door\"\n\r\nThey're saying how they're dropping acid with their friends.\n\r\n\"And the band begins to play.\"\n\r\nI'm not sure about this line. Maybe it refers to the fact that when you're high you appreciate music.\n\r\nAnyways, that's my perception of the song. Might not particularly be anyone else's.\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nlukefun - \"And our friends are all aboard, \r\nMany more of them live next door\" \r\ntheir \"friends\" are the drugs. \n\r\ni am a HUGE beatles fan but this song makes me sad. it makes me want to go to a bar or something. ...to drink away the horrible experience of listening to a very overrated song. oh well. i love the beatles, but COME ON, whoever denies that this song isn't 100% about getting stoned is just ignorant. \n\r\nvisit romania - romania sucks. oh-and so do the doors in the light of the beatles.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nthis song really is about their experiences with lsd.  Back in the mid sixties, one of their friends laced their drinks with acid, and they were driving home and believed that they were in a 'yellow submarine'.  It tells you all about it in the anthology\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nthe beatles are completely awesome. this is a song of their drugs and stuff, i know, but no matter what you guys say about this bein a shitty song, i really do like it!!\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nI think it's hilarious people arguing over the meaning of songs like this. It means nothing,  they knew that they could record anything and people would buy it, so why would they put any effort in? Selling more records than anyone else does not make a band great. Their musical ability was massively overrated. Their guitar skills were negligible compared to Hendix or Slash, and Cobain and Milo Aukerman wrote far more meaningful lyrics. And if you don't know who Milo Aukerman is, that doesn't surprise me. Unlike the Beatles, he was never in it for the money or fame.\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nboy does this song suck\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nWrapid:\r\nThat's exactly why Nirvana's lyrics are so meaningful. Cobain didn't try to be melodramatic, but just wrote lyrics that meant something to him (since they are mostly from poems he wrote), even if he didn't know what it was. Unlike the Beatles, who just wrote lyrics people would sing along to so they could sell records. And no, I'm not an obsessed Nirvana fan, I don't like Nirvana any more than I like the Beatles (which is not at all). I can just tell the difference between a talented band who played because they loved music, and a bunch of posers who were only in it for the money and to be famous.\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nLSD\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nthis song stinks. they really made a fool out of themselves to record this song. and what a fools john and paul are to let ringo sing this song! i am a great fan of the beatles but this song just sucks\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nthis song is about the beatles love of drugs and wanting to live in a yellow submarine with all their tripy friends\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nFunny... childish... ingenious... and yet another song about getting high on LSD... or whatever.  I love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nSky of blue= blue pot smoke\r\nSea of green = pile of pot\r\nYellow Submarine = yellow bong\n\r\n'nuff said\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nRingo's attempt at confiding in John about an incident that took place at the Mirage hotel in Las Vegas.\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nall of you that say this is a childly song are idiots.  The first idea was for it to be for children, but it has a much deeper meaning.  Submarines in a sea of green is saying we live in a coffin in a cemetary.  Even if you live to be 110 years old, the majority of your life (spiritual), your body is spent in a coffin.  Song may suggest that Paul is in a coffin, after dying in a car accident....?\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nlook - the beatles were SOOOOOOOOO fucking stoned when they wrote this song and thats it!!!!! 'we all live in a yellow submarine' how fucking wasted do u need 2 be to write that?? it sounds like a fucking mean trip!!\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nhey if u listen 2 it closly wen johns voice is diolated it sounds like heys saying paul is a queer kinda weird y wold he say that\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\ni dont think that this is a child song but i dont really like it\r\nthe hidden meaning is fab but the whole feel of the song is too... childish\r\nnow, now, dont yell at me for saying childish... i understand that deep down this song is pretty good\n\r\nlove\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\ni think this song is about death and the after life, im going to go thru it line by line:(this is just my opinion, but it all seems to make since this way)\n\r\nIn the town where I was born,\r\nLived a man who sailed the sea,(a ghost visited the singer, ''sailed to sea'' means he died[ill expain later])\r\nAnd he told us of his life,\r\nIn the land of submarines.(he told them aobut how it was after he died in the land of submarines. yellow sub.=coffin) \r\nSo we sailed on to the sun,(this is really wierd, its like they hear the story from this ghost, so they die/kill themselves dont know which i think they jsut die tho ill get into that more later)\r\nTill we found the sea of green,(sea of green is the grass)\r\nAnd we lived beneath the waves,(under the grass)\r\nIn our yellow submarine.(coffin)\r\nWe all live in a yellow submarine,(all his friends that also ''sailed unto the sun''/died live in the yellow sub.)\r\nYellow submarine, yellow submarine,\r\nWe all live in a yellow submarine,\r\nYellow submarine, yellow submarine,\r\nAnd our friends are all aboard,(aboard in heaven)\r\nMany more of them live next door,(next door in hell)(in these lines it makes me think they are in heaven since ''many more'' are next door, and more ppl are in hell than heaven)\r\nAnd the band begins to play.(could be thier surroundings, seen as a good thing i think)\r\nWe all live in a yellow submarine,\r\nYellow submarine, yellow submarine,\r\nWe all live in a yellow submarine,\r\nYellow submarine, yellow submarine,\r\nAs we live a life of ease,(anotehr reason why i think they are in heaven and not hell)\r\nEveryone of us has all we need,\r\nSky of blue and sea of green,(in the coffin they are under grass[''sea of green''] with a sky of blue}\r\nIn our yellow submarine.\r\nWe all live in a yellow submarine,\r\nYellow submarine, yellow submarine,\r\nWe all live in a yellow submarine,\r\nYellow submarine, yellow submarine. \n\r\nremeber this is IMHO, feedback on it would be appreciated.\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nOk, so i don't like The Beatles, to me they are extremly over-rated, but this song...\n\r\nOk, they were high when they wrote it! Everyone knows that...but itz sooooooo KWL!!!! I cracked up laughing the first time I evah heard it...It's awesome! One of the only 2 songs by them that I actuallt LIKE!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\ndude, you really read way WAY to deep into the song...this song is obviously about drugs...they were heavy into acid and were probably like dude...wouldnt it be cool if we made a song about some weird shit...like a submarine?...yes they were musical geniuses but comon...not everything has to have a hidden meaning...faggot\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nI'm just gonna tell it to you straight:  this song SUCKS.  Every other track on Revolver is pure gold, and this one is a disaster.  How it ever got to #1 is beyond me.\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nI personally, think they were on drugs when they wrote this retarded song. A kids song? I think not. You might want to look a little closer at the lyrics, and if you cant see it then, then I suggest you look at other more obvious songs, such as LSD in Lucy in the Sky with Diamonds...how else would they come up with such a random statement?\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nring around the rosie, poket full of posie, ashes, ashes we all fall down.  thats about the holucost\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nI havn't really read anyone else's review of this song, but this is, in my opinion, the worst Beatles song ever released, and it is such a shame that it comes on one of The Beatles best records: Revolver.  Ringo is the worst Beatle and it shows on this song.  I am completly perplexed noticing this song has more reviews than most of their good stuff.\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\numm this song is obviously about urine...YELLOW submarine. They wrote a song about living in a yellow submarine after one of the beatles pissed himself and kind of realised that we was living in his own urine soooooo he wrote this song about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\numm this song is obviously about urine...YELLOW submarine. They wrote a song about living in a yellow submarine after one of the beatles pissed himself and kind of realised that we was living in his own urine soooooo he wrote this song about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\ni think the beatles are total crap in general. People like Led Zeppelin are way better. they should'nt be so famous\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nok...first of all....this is a good song and very catchy. If u thionk it sucks so nad go away.. this isnt \"what songs do you think suck.com\". Yellow submarine is a street name for LSD.... cbennet almost has it right. Its NOT against LSD. thats it...not a nursry ryme...its for all us stoners that know whats going on.\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nI think this song is directed at the masses of dumb people...the herd, the sheep. \"We all live in a yellow Sub.\" = heads in the sand. Yellow = the colour of the coward. \n\r\n\"We live the life of ease\" = we live devoid of truth, but of simple minded comforts.\n\r\nIt's a take anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\ni know for a fact the song isnt simply, \"a childrens song with no real meaning\" im only 16, but i think this is a one of thier really deep songs,\r\nmostly, the beatles' songs true meanings are just too deep to decipher and wer based off of moments tht they themselves only experienced.\r\ni dont know bout u guys, but i happen to like this song..\n\r\nits catchy and simple, yet deep and mysterious.\r\nthats what makes the beatles.\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nOccam's razor has nothing to do with this song.\n\r\nEverybody whos says it is about POT, is right.  Almost ALL of Revolver is about drugs.  \"Sea of Green\", for those who smoke pot, refers to a sea/field of marijuana plants.  Don't believe me?  Look it up.  why would they say, sea of green?  If the sky is blue, the sea should be too.  but, it's green.\n\r\nBob Dylan, the man who turned the Beatles on to pot (this is documented) is the \"man who sailed the sea\".\n\r\nNotice the bubbling sounds in the song?  Ever smoked through a bubbling water bong or pipe?\n\r\nI am sorry people are so naive or so close-minded they don't want to believe the Beatles did LOTS and LOTS of drugs, and wrote about them.\n\r\nOf course, though, they're going to deny the song is about drugs. If you wrote a \"nice little children's song about drugs\" would you admit it's about drugs?  Of course not.\n\r\nIt's not deep and mysterious, at all.  It is fun, though, how they disguised a song about pot as a children's song.\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nThe \"Yellow Submarine\" Represents the Goverment. and we are all \"in\" AKA Controlled by them. We don't know how to get out! and all we can do is watch the crazy \"sea of green\" AKA America! Green Represents Money, even though we are totally controlled by the goverment they distract us while they whisk us away on a \"yellow submarine\" of sorts with money!\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nDoesn't anybody realize a yellow submarine is a water bong?  Listen to the music, and you will hear the actual bubbles/the sound of a water bong.  Yes, it's about marijuana - sea of green.   A submarine is very similar to a water bong.\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nThe song is about being dead and in a coffin.\n\r\nthe sea of green: is the grass\n\r\nAnd we lived beneath the waves: under ground\n\r\nIn our yellow submarine:Coffin\n\r\nAnd our friends are all aboard: people are buried close to family usually\n\r\nMany more of them live next door: people are buried next to one another\n\r\nAnd the band begins to play: the music that accompanies a funeral and its service\n\r\nEveryone of us has all we need: you need nothing once your dead\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nStop overanalyzing it dudes. It's about bud. And it's pleasurable even when you're sober.\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nok, i think this song can really be w/e u want it 2 be, thats why its so good! u can look at it as a fun child song that u can laugh at and enjoy w/ a simple, innocent mind, or u can see this song as just something that they wrote while on a trip and was just about the trip and leave it at that, or u can think its about death it does have things in it that can be interpreted into death -kinda far fetched but w/e floats ur submarine (ahahaha, its late...)- or u could see it as a sentiment worning ppl not to do acid i could sorta see that...\r\nso heres wut it means to me:D\n\r\nthe town where I was born,\r\nLived a man who sailed the sea,\r\nAnd he told us of his life,\r\nIn the land of submarines.\r\nSo we sailed on to the sun,\r\nTill we found the sea of green,\r\nAnd we lived beneath the waves,\r\nIn our yellow submarine.\r\n-this kinda makes me think of when ppl tell u of when ur going to grow up wut things will come and the things ull see, so they grew up and they saw and they lived \n\n\r\nWe all live in a yellow submarine,\r\nYellow submarine, yellow submarine,\r\nWe all live in a yellow submarine,\r\nYellow submarine, yellow submarine,\r\n-im thinking this yellow submarine might be the group of ppl in ur life and how like in school we have cliques, but were all still one school, one land of submarines\n\r\nAnd our friends are all aboard,\r\nMany more of them live next door,\r\nAnd the band begins to play.\r\n-this kinda adds to my interpretation of the chorus\n\r\nAs we live a life of ease,\r\nEveryone of us has all we need,\r\nSky of blue and sea of green\r\nIn our yellow submarine\r\n- life is good, life is really good when ur on acid! \n\r\nu know wut this could be about the afterlife...\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\ncharliemanson.com/places/…\n\r\nGenius. it's about the manson family.\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\ncharliemanson.com/places/…\n\r\nmanson family guys, genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nYou people are pretty harsh. Yellow Submarine is a extreme example of a good bad song. And if you think there's no quality musicianship in it, listen closer to the chorus. Amazing harmony. Would you have come up with that? No.\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nExactly, as valkyriestar said, submarine = coffin, sea of green = cementery grass.\r\nBut I think it's a story about some dead music band members:\n\r\nIn the town where I was born / Lived a man who sailed the sea / And he told us of his life / In the land of submarines: The land of submarines is clearly the cementery. Is that man someone who worked in a cementery?\n\r\nSo we sailed on to the sun / Till we found the sea of green / And we lived beneath the waves / In our yellow submarine. He's talking about their burial. Since then, they lived in their coffins, beneath the green \"waves\".\n\r\n\"We all live in a yellow submarine / Yellow submarine, yellow submarine\"\n\r\nAnd our friends are all aboard / Many more of them live next door / And the band begins to play. Everybody is buried now, \"all aboard\", and many of them buried next to another (\"next door\"). They're together again and they can play music, again.\n\r\nAs we live a life of ease / Everyone of us has all we need / Sky of blue and sea of green / In our yellow submarine. Now they're peaceful... in their \"submarine\" beneath the grass (\"sea of green\").\n\r\nPretty dark, huh?\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nExactly, as valkyriestar said, submarine = coffin, sea of green = cementery grass.\r\nBut I think it's a story about some dead music band members:\n\r\nIn the town where I was born / Lived a man who sailed the sea / And he told us of his life / In the land of submarines: The land of submarines is clearly the cementery. Is that man someone who worked in a cementery?\n\r\nSo we sailed on to the sun / Till we found the sea of green / And we lived beneath the waves / In our yellow submarine. He's talking about their burial. Since then, they lived in their coffins, beneath the green \"waves\".\n\r\n\"We all live in a yellow submarine / Yellow submarine, yellow submarine\"\n\r\nAnd our friends are all aboard / Many more of them live next door / And the band begins to play. Everybody is buried now, \"all aboard\", and many of them buried next to another (\"next door\"). They're together again and they can play music, again.\n\r\nAs we live a life of ease / Everyone of us has all we need / Sky of blue and sea of green / In our yellow submarine. Now they're peaceful... in their \"submarine\" beneath the grass (\"sea of green\").\n\r\nPretty dark, huh?\t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\nExactly, as valkyriestar said, submarine = coffin, sea of green = cementery grass.\r\nBut I think it's a story about some dead music band members:\n\r\nIn the town where I was born / Lived a man who sailed the sea / And he told us of his life / In the land of submarines: The land of submarines is clearly the cementery. Is that man someone who worked in a cementery?\n\r\nSo we sailed on to the sun / Till we found the sea of green / And we lived beneath the waves / In our yellow submarine. He's talking about their burial. Since then, they lived in their coffins, beneath the green \"waves\".\n\r\n\"We all live in a yellow submarine / Yellow submarine, yellow submarine\"\n\r\nAnd our friends are all aboard / Many more of them live next door / And the band begins to play. Everybody is buried now, \"all aboard\", and many of them buried next to another (\"next door\"). They're together again and they can play music, again.\n\r\nAs we live a life of ease / Everyone of us has all we need / Sky of blue and sea of green / In our yellow submarine. Now they're peaceful... in their \"submarine\" beneath the grass (\"sea of green\").\n\r\nPretty dark, huh?\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nI have been really stoned and heard this song and it still sucked when the circus brass cuts in. It doesn't mean a fckn thing but it's cool, WTF there's 1000's of songs that don't mean shit yet their cool. Not a top 100 favorite of all time but I can sit through itonce a year I suppose.\r\nA O.....\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\nIt's not that complicated. It's a psychedelic novelty song, and they're just having fun with all the sound effects and noises and stuff. The drug part: someone was high and experienced depersonalization; he experienced his body as a vehicle for moving about in the environment and his consciousness as a person (living) inside of it - and then generalized it to 'we'. That's where the refrain came from. The verses are just some folk-y seafaring lines to fill out the song. Really, it's that simple. Whether you like it or not is another matter. At least consider the context.\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nits a good song but its TOO sloww ! \n\n\n", "comment_237": "\nOk, as always, my own interpretation. Please do not judge me for my views, as this is the main fact that makes it worth while for us all to be on here and it leaves a slight distaste to one who is negatively critisized.\n\r\nCharles Manson was released from prison on 21 Mrach 1967. You have to have a bit of background info on Chralie, as they called him, to understand many of this, but C believed that there would at some stage, rather sooner than later in his time, be an uproar of racial differences in the US. (Long storie Short). \n\r\nWhen he was realeased he returned back to the ranch where himself and (Some call them his followers). It was the second ranch where they found refuge and it was called the Spahn Ranch or something like that.\n\r\nManson was adiment to start his own little town/city in the desert, and was sure that this would be a place where they all could survive in peace, when the civil war broke out. They could exist in such a darrn place, where no one else would be able to survive, not knowing how to. they started to accumulate all needed to build their city and Manson's plan was to create incredible music, aiming to be signed and recorded, to help fund his dream of having his own perfect city.\n\r\nThey practised, wrote lyrics, put songs together and became perfect at what they were doing. Eventually, as they felt they were ready, they set off to LA, to be discovered. (Keep in the back of you minds that, Beatles released their WHITE album in this time period, I think just before 1967.It was said that Manson was very influenced by them and that most songs on the WHITE album, was a direct communication from the beatles to himself and his followers.Manson sort of denies this though and said that it was some of his family that began to unravel the hidden messages in the songs) \n\r\nManson was acquainted with some guys in the music industry and his plan was to get in touch with one of them and they could arrange from there to be sampled in studios to perhaps record etc.\r\nHis main contact was out of time, when himself arrived in LA, but he was surprised to find out that the labell was speaking about them, but could not reach them, due to their desolate residence on the Spahn farm in the desert. \n\r\nCharlie then set out to find a place of residence for a short while, while they waited for this friend of him to return. (I think his name was Dannis) They needed a big enough place to house about 15 to 20 people and it needed to be close enough to where all the shit was going down in the industry they were so desperatly trying to break into. They found a house in Gresham Street, in Canoga park. About 30mins drive from hollywood and only a couple of miles away from the ranch. IT was quite spacious and guess what. The house was bright yello and had submarine like windows on the top floor. Get this, Charlie actually christened the house \"The Yellow Sub-Marine\". As they stayed there and became known, many guests would visit the house. At one stage the Beatles were often found, visiting the house. They would stay there at Charlies place, when in that part of the world when doing shows etc. \n\r\nThe house was described as a place that drew you in. You could go in so easily, but a week might quickly pass before you come out again, as you get so caught up in, not only the drugs , but the lifestyle that was reigning with it. charles was believed to have an incredible strong mind and motivational/manipulating qualtities. Charlie woud say that \"The family would remain 'submerged' beneath the awareness of the outside world\"\n\r\nThis my dear friends, was the yellow submarine that the beatles wrote about. \r\n - Budokan\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\nThe WORST song ever written/sung/performed. This song should have been SOOOOO beneath the Beatles. It's horrible. It's not even catchy... it's cliche. It's not light and airy...it's stupid and shallow. It's just plain BAD. It makes the list of my top five WORST SONGS EVER!!! Ughhhhhhhhhhhhhhhhh\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\nBeatlemania is always not something that can be figured out by traditional psychology, transactional analysis, or anything quite that absurd. The explaination for the song is socially unacceptable by conventional thinking, even to the present day. Read your back issues of science fiction magazines for the answer, it's in several languages, the story was that popular. It's just a violation of conventional thinking, the answer is not a no-brainer.\n\n\"The psychologists got Beatlemania all wrong\". Did George Harrison or Ringo Starr say that?\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\nI think  is another  silly song composed just for Ringo can sing any song in the LP.\n\n A silly song for a silly singer.\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nWe are living in a box, but it is nice, not common, yellow...\r\nthe color save our \"prison\" ... Is the color the fantasy? \t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\nWe are living in a box, but it is nice, not common, yellow...\r\nthe color save our \"prison\" ... Is the color the fantasy? \t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\nWe are living in a box, but it is nice, not common, yellow...\r\nthe color save our \"prison\" ... Is the color the fantasy? \t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\nacid trip\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\nNot really.  I think john would have just made it worse.  Paul...nah.  Then again, you can't really make it more irritating :)\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\nTHIS SONG IS MY FAVOURITE BEATLES SONG.. ITS ABOUT A PERSON WHO IS A NECROPEDOPHILE.. IN OTHER WORDS THEY ROOT DEAD CHILDREN... THIS SONG MAKES ME WANT TO ROOT DEAD CHILDREN.. GO BEATLES GO\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\nnow why do the beatles suck so much? hmm....let's see... cuz they're OVERRATED SO GODDAMN MUCH !\r\nOK, they have some happy childish tunes which gives ya a good mood but that don't make 'em like best band out there ! to me they're just a normal early rock band.\r\noh, and the Doors are better...\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\nactully if u follo the beatles albums quite closly, the have suggested quit care fully that paul is dead, the song a day in the life tells the story of it. the whole entire album Sgt peppers lonly hearts club band has many of these signs ( look it up ) suposivly paul died wedneday morning at 3 o clock in a cary crash and billy shears took his place , such being why the song is said that the Submarine is a \" coffin \" and a sea of green is the grass . Look it up\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nCan you say paranoid schizophrenic \t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nSea of green= Lot's of pot\t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\nBoring predictable below average twaddle for wannabe trippers.\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\nthe beatles are great but this is the worst song they did\t\t\t\t\n\t\t\t\t\n\n"}