{"comment_0": "\nI read most of the 104 comments about \"Yesterday\" and was surprised that nobody else picked up the same meaning of the song that I picked up.\r\nWhen Paul was about 12 years old, his mother died (at a similar time period that John lost his mother).  His mother and father both worked for a living, and the family was pretty poor.  In one book I read it was said that upon hearing that his mother died, he commented \"What are we going to do without her money?\"\r\nWhen we are young, sometimes we say things what we are thinking instead of saying what is politically correct.  Sure, he loved his mother, but he also was worried about the future as well.  In retrospect, he probably wishes he had never made that comment.  Before she was gone, his life was much better.\r\n\"I said something wrong, now I long for yesterday\".  Expand on that thought and that line, and you have the meaning of the song.\n\n\n\n", "comment_1": "\nLennon: \"I never went to high school reunions. My thing is, Out of sight, out of mind. That's my attitude toward life. So I don't have any romanticism about any part of my past. I think of it only inasmuch as it gave me pleasure or helped me grow psychologically. That is the only thing that interests me about yesterday. I don't believe in yesterday, by the way. You know I don't believe in yesterday. I am only interested in what I am doing now.\"   \n\r\n:D\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nOn an interview with Paul, he said this was actually about his mom dying :(  \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nLennon once said \"The only good thing you ever did was Yesterday\" about McCartney.\r\nThis is The Most Covered Song Ever.\r\nMore remakes of this than any other song!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nHey, there's mistake with this lyric. Line 4 and 5 are need to be swap. It should be: Suddenly, There's a shadow,,, I'm not half,,, \t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nIts about a Woman that was sick. She went to the hospital and died there the night after she was admitted. Her Son thought she left him because He may have said the wrong thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis is a very sad song. One minute, you're happily in love with someone, enjoying the relationship. The next thing you know, you're wondering how things went wrong, distressed. I can relate, somewhat. But, in the end, there is hope...\"I believe in yesterday\". Sometimes, I think hope is all you've got. Amazing song. Uplifting and depressing at the same time.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\ntis song is bitter sweet in some way it seems kinda sweet to me but when you really listen to what he is saying the sadness just pores out of his words its a beautiful song and i think he is saying that he had his love at one time and everything seem so clear and easy and fun to him but he lost that love and now its all messed p and he is looking back at the past\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nwhile we all know this song was originally called \"Scrambled Eggs\", I'm not sure how far Paul got with this first version of the song. \n\r\nThe story goes that Paul came up with the tune without any lyrics, and in order to keep the tune in his head kept singing \"Scrambled eggs, oh you've got such lovely legs\". But did he actually write out the whole song or just this one line?\n\r\nHere are the scrambled eggs lyrics. Whether or not these are the original lyrics written by paul or whether someone else made them up later, I do not know. They fit very well.. Almost too well to be confident that Paul actually wrote them before he changed the lyrics and song to Yesterday. It seems almost more likely they were made up afterwards by someone else who had heard the original title.\n\r\nScrambled eggs\r\nHave an omelet with some muenster cheese.\r\nPut your dishes in the washbin please\r\nso I can clean the scrambled eggs.\n\r\nJoin me, do\r\nThere are lots of eggs for me and you\r\nI've got ham and cheese and bacon too\r\nso go get two and join me, do.\n\r\nFried or sunny-side\r\njust aren't right. The mix-bowl begs.\r\nQuick - go get a pan\r\nand we'll scram-ble up some eggs, eggs, eggs, eggs.\n\r\nScrambled eggs\r\nGood for breakfast, dinnertime or brunch\r\nDon't buy six or twleve - buy a bunch\r\nand we'll have lunch\r\non scrambled eggs.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI'll never forget the day I was sitting in the doctor's office and my father said that this song truly made him cry...\r\nhe never said why it made him cry..\r\nBut just the thought of my father crying...\r\namazes me..\r\n.....I remember that...and I was only 6 years old.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nFor a melancholic five year old, this was the perfect song to mourn my parents' divorce. \t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\n\"Yesterday\" can be applied to many scenarios, but for me it is more specific to heartbreak.  When in love you feel like the world is yours.  To have your love leave you (through something you said or no fault of your own) is a very crushing thing.  You would do anything to get them back.  Often you are filled with regret for having ever lost them.  What was once happy is now sad, so you end up longing for when things were better... yesterday.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nIâ\u0080\u0099m very interested about this songs because this songs remember about past. And Iâ\u0080\u0099m very sad when I listening that songs.  Because love is everything. Love is like was we play somethink we like.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis song reminds me exactly of last year. There was this girl named Ali that I worked with, she was 23 so a couple years older than me. She was gorgeous, sweet, and really down-to-earth. When she started working and when I met her she was in a deadbeat relationship. With a little charm and wit, I expedited the process of breaking up with her then boyfriend. And from there we started to spend a lot of time together outside of work, and I even spent the night at her place a couple times. I knew she was really into me almost from the start and I really liked her too. It was a glorious time. Plus, how apt it was that we quoted Beatles lyrics together all the time. This went on for several months when summer came along. We were swimming one day and she popped THE question of if I saw her as a potential girlfriend or just a fling. I told her honestly from that I could see us being together. Literally overnight, she put up a wall and hardly spoke to me. When I confronted her about it she said that right now she wanted to have fun and be carefree right now (We all know what that means). I empathized with her wanting space and to enjoy being single before being in a relationship again, but to overcompensate the way she did was hurtful and I was lost in a whirlwind of confusion and frustration because I never in a long time would think I'd ever fall in love again. This song and The Beach Boys' \"Caroline, No\" remind me exactly of this predicament.\r\nLove was such an easy game for us two to play, my troubles seemed so far away when I was with her. Why she had to go, I don't know she would hardly say. I longed for yesterday; the beautiful times we spent together that I took for granted and the heart aching nostalgia that inevitably follows. All of this was so sudden and I believed that those times would eventually bring her back to me. I wanted to hide away but I believed in yesterday...\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\n1 of the best songs ever,this truly rules\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\numm..hy92 are you on crack????\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThe original working title of this was SCRAMBLED EGGS.  And the first verse was \"Scrambled Eggs. Oh my baby how I love your legs.\" (or something like that)\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nPaul said he dreamed the melody and when he woke up he thought that someone else made it and put it in the back of his mind...After he realized that it wasn't anyone else's he wrote scrambled eggs as ferthuko said...Then he thankfully made it Yesterday, one of the best songs of all time.\n\r\nAnother interesting bit of trivia, this is sort of the first \"solo record\" of a Beatle, considering that Paul's the only Beatle involved in the recording.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\none of the best\n\n\n", "comment_19": "\nyes, definitely one of the best. called the best love song ever my frank sinatra. also the most covered beatles song. i'm glad paul didn't leave the \"scrambled eggs\" lyrics...lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nokay..i'm getting my beatles songs mixed up now...frank sinatra called \"something\" the best love song..not this song..erg..\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\ni love this song. its pretty self- explanatory.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nMy favorite song of all time, said to be perfect by Elton John. It is true he dreamt it and he did originaly call it scrambled eggs. It has been played more than 7 million times on U.S. radio and might have been about the death of his mother.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI agree with hy92, the Shadow is before half a man.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nshadow is not before half a man and yes it is the greatest song ever written\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\ni love this song.  I bought the beatles 1 album, and this is about the only song I listen to\n\n\n", "comment_26": "\nUhhhhh... no... \"I'm not half...\" comes BEFORE \"There's a shadow...\"  If you don't believe me, listen to it on ANY Beatles' CD you want, and that's the way it'll be played.  Trust me, I've heard this song hundreds of times, my mom always insists on playing it in the car.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nWeezer, Frank Sinatra said that Something is the greatest love song ever written, which he gave no credit to George for, not Yesterday.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nit is 'theres a shodow haging over me, i'm not half the man i used to be' i'm listening to the song right now, and thats the way its sung\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nThis song is an all time fav of mine. I listen to it all the time, and this controvertial issue about the order of the lyrics, happens to be my FAVORITE part of my FAVORITE song. \"there's a shadow...\" comes AFTER \"I'm not half...\" Please, if you are really listening to this song as you type, listen to the words you HEAR, and the not misconeption playing in your mind. I have the sheet music it to the song as well, which varifies my point of view. I am also a music major, so I think I would know a little about music, and how to hear what is being played. And lastly, if the lyrics were backwards, like so many of you claim, the song wouldn't even fit right in it's phrasing. So I have brains, ears, written proof, music theory, and common sense on my side of this issue. I hope this issue is FINALLY resolved. Good night.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nok, obviously there are 2 versions of the song, because i have the one where shadow hanging over me is first, and some of you are set on the other way, so lets just say there are 2 versions of the song, just to end the dispute, cuz its dumb.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nok, i know for sure there are 2 versions now, because i have them both\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\ngreat song :) \t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nThis is my favorite beatles song of all time.  Paul McCartney is a freaking genius\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\ni love this song becuz of the memories it brings back,to when i was ignorant of all the problems in my world and the whole world in general.when my dad would sit beside me and pull out his guitar when i was 6 and sing this to me,thats why fell in love with the beatles.the music and the memories\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nby undomiel on 06-05-2002 @ 04:25:01 PM  \r\nTHANK GOD HE GAVE THE INTELLIGENT TO PAUL MCCARTNEY TO WRITE THIS PERFECT SONG EVER WRITTEN!!\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nby undomiel on 06-05-2002 @ 04:25:01 PM  \r\nTHANK GOD HE GAVE THE INTELLIGENT TO PAUL MCCARTNEY TO WRITE THIS PERFECT SONG EVER WRITTEN!!\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nYAD:  Argumentitum ad Hominem.  Logical fallacy.  Don't use it.\n\r\nYes, doomy.  We get it.  Undomiel is not only an idiot, he's an idiot with bad grammar.  It's like bad Engrish.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nNeedless to say, this song is about arriving at a state of depression and comparing it to the better days- Yesterday.  Any asshole who thinks differents can eat it.  This is a very short song.  However, there is something about it that just makes it addictive.  If anyone can figure out that one thing that makes me want to hear this song over and over again, let me know.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nanyone who agrees with hy92 needs to listen to the song again before they say anything... think before you speak.. sorry.. anyway, i love this song.. but please, this version is correct... this song is so beautiful. and i agree with retsyn, oh and JAYA, dont say stuff like that, youre just lookin for a fight, if you dont like the song, why did you come to it in the first place? its a wonderful song, let it be...\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI think that every man, or anybody for that matter, can relate to this song. Everybody has their heart broken one time or another. I think that the reason you're addicted to this song Better Than You, is because you can relate to it. Everybody needs to feel sad everynow and then, and this song is perfect for sadness.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nthat one line \"yesterday, all my troubles seemed so far away.\" boy that line is so true. I heard that McCartney worked on it by himself and composed it by himself. Pretty cool. As a global fact somewhere, somewhere in the world this song, or another version of it is being played.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI love this song immensely. Every time it comes on in the car I sing along. It's the best.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\n1. this song's good but not as good as you all seem to think\r\n2. young and desperate- a communist idiot? lennon? damn you're narrowminded. He has a dream of equality- one that fits in with the communist dream. sure, communism doesn't have a fantstic history of working, but the dream itself is far superior to the capitalist one. will you believe any crap your government feeds you if they say it often enough?\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI love this song! i just can believe people still lisen it....\n\r\nAnd Keating, shut up, besides this song was wrote by paul, and what do you care if they had dreams, you don`t have any??\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nmrs beatles- I'm directly responding to young and desperate, hence why I'm writing on this page. I'm not talking about john or paul's dream- I'm talking about the communist dream. Is that really too hard to understand?\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\na lack of education perhaps? \"wrote by paul\"?\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nIm a metal fan, but the fact is, the Beatles were fucking brilliant and this is their best song.\r\nI think it just perfectly captures the way it feels to be with someone, and things are going great, then the next minute its all over and you can't understand why, and the feeling of wanting to go back to the happier times.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nDue to a novel called \"Vivienne\" by Richard Hoyt, I began to relisten to this song, as well as \"Hey Jude\" by the Beatles and \"Sympathy for the Devil\" by the Rolling Stones.  The title character plays this over a record player after saying goodbye to the man she loves.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nI was reading some book on the Beatles, and the author pointed out that this song has some similarities to \"Answer Me My Love\" by Nat King Cole...\n\nYou were mine yesterday\r\nI believed that love was here to stay\n\r\nThey also pointed out some similarities in the chord progressions. I do believe this is the greatest rock n' roll song ever, though. It's played right after \"Greensleeves,\" which has been around for how many hundreds of years, on the carrillon where I go to school. And if it's put in the same category as a song that timeless, then it has to be on a completely different level from every other song in the rock genre.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nyeah my grandmother told me it was about the death of pauls mother she died of cancer or something. It's still a beautiful song i love how the beatles still are loved by every generation. there will never be such a timeless universial band ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nCancer! That was it, thanks Niam. My Grandmother told me the same thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nthis some makes me so sad! it reminds me of my mum who passed away on christmas day a few years ago ... \n\r\nlosing some one creates a burden, a shadow, which at the time seems as though it shall stay forever and i think this song is cut short ... \n\r\nas beautiful as it is now i think if paul added lyrics to this song on this topic now ... he would write about how you do learn to cope, you never froget but you learn to carry on ... \n\r\nexcellent song ... so simple ... so great :D!\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nthis is one of the worst songs the beatles ever wrote.  sorry,but it is just so freakin sad sounding.  i dont like sad sounding.  sure, i suppose you could call it thought provoking or something, but i downright dont like it.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nIt's quite safe to say this is the greatest, or one of the greatest ever written. I haven't heard every song, but if I haven't heard such-and-such song, how could it possibly be the greatest? That's not saying that all popular songs are great or that absolutely every great song is popular (\"Trilogy\" by Sonic Youth is a good example of this). But this is most certainly a landmark in rock n' roll, along with \"Johnny B. Goode,\" \"That's All Right,\" \"Stairway To Heaven,\" \"What's Going On,\" \"Imagine,\" \"Like A Rolling Stone,\" \"Hey, Jude,\" \"London Calling,\" and \"Smells Like Teen Spirit.\" Not only that, it's become a landmark in music PERIOD, and is on par with \"Greensleeves\" and \"Happy Birthday.\" EVERYONE knows \"Yesterday.\" They play it on the carillon at the university I attend every day at 5:00. It's the most-covered song in history.\n\r\nAnd to say that John Lennon was a communistic idiot is insulting. He was one of the best songwriters to ever make records.\n\r\nI personally think this is the greatest song ever in the history of music, along with \"Greensleeves.\" It's just that good.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nlol, i have a rediculous theory, worth researching if you're interested.  this song is supposedly about paul's death in a car crash.  it's kinda like the elvis is alive thing.  there is a bunch of evidence suggesting that paul mcartney died in a car crash somewhere in the middle of their carreer and they got a really good look-alike, plastic surgery and singing lessons to cover it up.  if you look at all the evidence it is logical, but still hard to believe.  \"i am the walrus\" is also about this incident supposedly.  btw, if mr. prestopnik ever reads this, thanks for teaching me about this.  lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\ngreeneyes - haha that is a little bit ridiculous, but there are crazy theories about stuff like that with like loads of famous rock bands. anyways, this is a really good song.  the beatles are very possibly the most popular rock band that has ever been, and maybe ever will be. if you look at like old video footage of places where the beatles were, it is absolutly unbelievable how many fans would be gathered there. it is just insane\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\ngreeneyes - haha that is a little bit ridiculous, but there are crazy theories about stuff like that with like loads of famous rock bands. anyways, this is a really good song.  the beatles are very possibly the most popular rock band that has ever been, and maybe ever will be. if you look at like old video footage of places where the beatles were, it is absolutly unbelievable how many fans would be gathered there. it is just insane\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nVisit_Romania, without the Beatles, there would be no metal. It's as simple as that. The Beatles have influenced EVERYBODY that came after them, either directly or indirectly, that's how amazing they were. I guess you just don't know enough about music to understand that.\n\r\nJAYA, i respect your opinion, but i fail to see how this song's lyrics are dumb. Surely you have one, or maybe even several, life experiences that you can relate to this song.\n\r\nI think this song is just brilliant. It isn't THE MOST COVERED SONG EVER for nothing!\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nshows how one day could be fine, perfect. and then whats to come is the end of it, just in one day it all changes.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nhey just thought i'd say -haat john's imagine album there's a song...  i think its the one called how do u sleep or something like that in which he says \"the only thing you ever did was yesterday\" which was supposed to b him slagging off paul saying that he wrote all the songs except this one. bit of a moan really i think.... ill check up on what song he said it in\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nDeffinetly a flawless song...I just hope I'll never have to feel that way\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nLike they say in Pulp Fiction: \"You like the Beatles or you like Elvis.\" Well you could break that down more to, you like McCartney or you like Lennon. I think that John did alot of good for the world in the fact that he was always campainging for peace and he made some really awesome music but anytime I listen to this song I can't help but realize how Paul was such a genius. This song in such few lyrics really got the point across with such a beautiful melody. The Beatles like many from their era (Dylan, Hendrix, the Stones, etc.) have influenced most of the artisits since then in one way or another. And this song is the most recorded song in the world so that should definitely tell you something.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nthe beatles 1 album is what my mom gave me for 8th grade graduation, this is one of the songs i can play over and over.  sometimes, i do believe in yesterday...\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nmusically, this is genious\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nthis song is depressing, but beautiful and wonderfull thank god for the beatles\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nweezer funny you should of said that sinatra called it the greatest love song and rightfully corrected yourself and saud it was something because he said \"something is the best lover song ever! by lennon and mccartney\" the funny thing about that was it was written only by george harrison wich pretty much summed up the amount of respect he got. he truly was one of the best song writers in the same league as mccartney and lennon with other songs like while my guitar slowly weeps and here comes the sun my favorite song ever,\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nok old sk00l, first, learn to spell.\n\r\nsecond, it is while my guitar GENTLY weeps, aside from that i agree with you about harrison not getting the respect that he deserves.\n\r\nwhenever i listen to Yesterday, i just clear my mind of all things and get inside the song..if you know what i mean. btw, have you watched paul's solo video of this song? he is CRYING... awww...\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nProbably the saddest song. Every time I listen to it I almost cry. It's such a wonderful song though, but most Beatles songs are.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\ngreat song but wtf backwards  im lost\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nYesterday is a great song that is easy to play on the guitar. I don't understand how it is the most popular beatles song, with 25OO versions covered by other people. It's a great song\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nim playing this in band, i luv it so much :)\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nAlthough anodyne and uninspired it would be hard to classify Yesterday as at terrible song. What is terrible, however, is the legion of people who proclaim it as their favourite or perhaps even the greatest song ever written. It's a bit like being asked to choose your favourite food from all the great dishes the world has to offer and settling on poached egg on toast. Nothing wrong with poached egg but to choose it as your favourite dish would seem to suggest such a person with no real love or appreciation of food. \r\nThe story goes that when McCartney started writing the song it came so easily to him he felt sure it must already exist and was mildly surprised when he found out it didn't. Not every song written has to break new ground or be startlingly complex but, my God, just listen to the tune in your head. It sounds like an exercise for kids learning to play an instrument.\r\nThen there's the words. Hard to think of a lyric so completely devoid of poetry. \"Yesterday all my troubles seemed so far away now it looks as though they're here to stay\" is fine for a bit of dialogue in a soap opera but to say this belongs to the greatest song of all time hints at madness. The nearest the song gets to using some kind of imagination is the line \"love was such an easy game to play\" which, although nothing to write home about, is at least not dreadful cliche like \"there's a shadow hanging over me\". \r\nTo recap: Yesterday is a perfectly bland and inoffensive song made offensive, and perhaps grotesque, by those who believe it a work of genius or even perfection.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nAlthough anodyne and uninspired it would be hard to classify Yesterday as at terrible song. What is terrible, however, is the legion of people who proclaim it as their favourite or perhaps even the greatest song ever written. It's a bit like being asked to choose your favourite food from all the great dishes the world has to offer and settling on poached egg on toast. Nothing wrong with poached egg but to choose it as your favourite dish would seem to suggest such a person with no real love or appreciation of food. \r\nThe story goes that when McCartney started writing the song it came so easily to him he felt sure it must already exist and was mildly surprised when he found out it didn't. Not every song written has to break new ground or be startlingly complex but, my God, just listen to the tune in your head. It sounds like an exercise for kids learning to play an instrument.\r\nThen there's the words. Hard to think of a lyric so completely devoid of poetry. \"Yesterday all my troubles seemed so far away now it looks as though they're here to stay\" is fine for a bit of dialogue in a soap opera but to say this belongs to the greatest song of all time hints at madness. The nearest the song gets to using some kind of imagination is the line \"love was such an easy game to play\" which, although nothing to write home about, is at least not dreadful cliche like \"there's a shadow hanging over me\". \r\nTo recap: Yesterday is a perfectly bland and inoffensive song made offensive, and perhaps grotesque, by those who believe it a work of genius or even perfection.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nok mikeymike...does this mean you're challenging the man who can come up with an amazingly insightful melody in a matter of MINUTES (Elton John) when you say people who think this is the greatest song ever written have are no judge of music?  really now...whether you like Elton John or not, who described \"Yesterday\" as PERFECT, you can't deny that he is a musical genius.  so i'm going to trust him.\n\r\nand to what you said about imagination in the lyrics...sometimes something simple, honest, and pure speaks louder than something obscure but more \"creative\"...at least it speaks to more people.  i sincerely doubt that when you feel depressed or down, you think of an imaginitive way to describe it.  sometimes when you have as much emotion as paul did, the easiest way to say it is with simple words.  and then everyone will know how you feel.  he's no poet who's trying NOT to be understood.  and the music is amazing.  those strings....and the guitar.  they're beautiful.  i challenge someone to find a more pure, honest, and emotional song than this.  to me, that's the mark of a really great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nFor the record I, mikeymike111, hereby deny that Elton John is a musical genius. He's done some quite nice stuff (Daniel) but then he's also perpetrated some horrors (Goodbye England's Rose). The word genius is used far too often - in terms of rock I'd use it to describe Dylan, the Stones (69-72), Velvet Underground and maybe a handful of others. But certainly not Mr John.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nwell, the Queen seems to value Sir Elton John on the same level as Sir Michael Philip Jagger and (to bring it back to the original subject, \"yesterday\") Sir Paul McCartney.  so even if you don't, there are those who do think he has exceptional talent. i trust his opinion on music, just because he knows it so intimately.  you don't have to like everything he writes to respect him and believe he has a worthwhile and educated opinion.\n\r\nand anyway...everyone has their own personal taste when it comes to music.  i'm just wondering why you would come to the lyrics page for this song just to try to shame all the people who think it's \"amazing.\"  it seems a little condescending.  just remember that what gives YOU such good taste are all the people who have bad taste or no taste at all.  why not just be content with the fact that you have superior taste, and try not to put down those who lack your discerning ear?  do you really think you can get people to change their opinion on their favorite song just by calling it \"bland\"?  it's like asking a redneck to vote democrat.  it won't happen.  you can't change someone's opinion just by telling them, with a condescending tone, that it's wrong.  it doesn't work that way.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nC'mon Miss Stake, what would you rather read? A posting that simply reads \"One of the best songs ever\" or an intelligent, well-written contentious slating of a much-loved song. The whole purpose of a site like this is to indulge in analysis and/or criticism of songs. By stating that I shouldn't have written my genuine feelings about Yesterday you imply that this whole site should consist of people writing \"I liked/loved this song\" over and over until the crack of doom. \r\nYou're quite right: you can't change someone's opinion by such a post. But you can certainly inspire in people the thought which runs along the lines of \"Yes,I don't like Yesterday either but faced with its critical approbation I've never dared voice my dissenting opinion but certainly will do so in future.\" When I was in my late teens there were many books, films, records I pretended to like simply because I didn't want to look foolish. If my posting helps one other person come out and admit that they actually rather hate song X (or, conversely, actually like song Y) my work here will have been done.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nI don't suggest that you shouldn't write your true feelings on the song...but I do suggest that you be a little less insulting in your statement.  i'm not sure that the group of people who would take the time to write a post saying \"the greatest song ever\" here necessarily have the most malleable opinions on the song, or that they are suppressing unfavorable feelings towards it- and therefore they would not be a desirable target audience for your attempt to enlighten someone.  but i suppose i could be wrong.\n\r\nin truth, i guess your work has been done, since your post caught my eye and drew a response out of me.  i have never been of the opinion that \"yesterday\" is one of the greatest songs ever, but i do enjoy it as one of my favorites...which i have discovered recently have a tendency towards simplicity, and that's basically just my taste.  i enjoy dylan, pixies, the stones, etc., but a lot of my favorite songs go back to the basics...mostly ones that my father used to play for me when i was little...so maybe my love for it has to do with the attached sentiment.  that is all i can say on the song, and i don't intend to force my opinion on you...you should just know that i am not a mindless idiot who thinks most popular songs are \"good\" songs, i have my own likes and dislikes based on what i would like to call a moderate level of music knowledge.\n\r\ni guess i was just wondering...because even though i despise the band \"fall out boy,\" i would never think to go to the lyrics page and rant about how the lyrics make no f-ing sense and their musicality is generic at best.  but i assume those who like their \"music\" wouldn't care to hear it.  and i don't care to tell them.  i guess this comparison to your disdain for \"yesterday\" is a little more extreme, but i hope it gets my point across.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nA very nice touching song.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nI have a slightly controversial statement to make... I think that Yesterday is a little bit over-rated.  I do love the song, and I love the lyrics, but I don't think it is one of the absolute greatest songs of all time, and not one of my favourite Beatles songs.  I think it's an excellent song, but I don't think it's one of the Beatles very best.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nSelf-explanatory. Especially as of lately, this song has really helped me continue. It explains a feeling that tries to cry out from within, but it's not one defined feeling. It's a 'plethra' of feelings that morph into one. it's the feelings of yesterdays confoundings.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nthe lyrics are correct.\n\r\ni like this song. its slow soft melody soothes me.\r\nand it's a sad song; considering the original song WAS called \"Scrambled Eggs\"...\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nI agree, this song is most likely very self-explanatory (unless we're missing something huge, although we probably aren't). But it makes me think about how art means something different to each person. For Paul, it could've been about his mother or something like that, but for someone else it may be about a grilfriend or maybe even a car, and that only makes it more perfect. Like I personally can't stand that band Crazytown, but back in the day my friends would always play them while we played hockey - so despite my hatred for them, their songs now mean the best times of my life to me. The only way art is ever beautiful is by the audience and artist alike seeing themselves in it.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nThis is the greatest wedding song ever written.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nBEST SONG EVER WROTEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE wootwoottt\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nThe lines \" I'm not half the man I used to be\" and \"there's a shadow hanging over me\" can be transversed, depending upon if your listening to the anthology, or not\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nI agree with LennonForever\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nyo, since this came to him in a dream, could you say that McCartney wrote this song in his sleep?\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nMy favourite Beatles song\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\npaul said \" I woke up one morning with a tune in my head and I thought Hey, I dont know this tune-or do I? I thought maybe I'd  just remembered it from the past... Over the next couple of weeks I started to put in the words... and then one day I had the idea of 'Yesterday'... It was my most successful song. its amazing that it just came to me in a dream. That's why i dont profess to know anything; I think music is all very mystical.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nit's the story of my life with one of my lost friends. she ment everything to me then i messed it up\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nPaul McCartney actually had thought he heard the music of the song b4, out of of his fathers music collection the actual music not the lyrics...he dreamt of the lyrics and wrote them to the tune he had thought to have been out before...cool lol\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nit means everything to me.i love the beatles more than i can express.kinda an obsession...\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nThe last single :(\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nwhile we all know this song was originally called \"Scrambled Eggs\", I'm not sure how far Paul got with this first version of the song. \n\r\nThe story goes that Paul came up with the tune without any lyrics, and in order to keep the tune in his head kept singing \"Scrambled eggs, oh you've got such lovely legs\". But did he actually write out the whole song or just this one line?\n\r\nHere are the scrambled eggs lyrics. Whether or not these are the original lyrics written by paul or whether someone else made them up later, I do not know. They fit very well.. Almost too well to be confident that Paul actually wrote them before he changed the lyrics and song to Yesterday. It seems almost more likely they were made up afterwards by someone else who had heard the original title.\n\r\nScrambled eggs\r\nHave an omelet with some muenster cheese.\r\nPut your dishes in the washbin please\r\nso I can clean the scrambled eggs.\n\r\nJoin me, do\r\nThere are lots of eggs for me and you\r\nI've got ham and cheese and bacon too\r\nso go get two and join me, do.\n\r\nFried or sunny-side\r\njust aren't right. The mix-bowl begs.\r\nQuick - go get a pan\r\nand we'll scram-ble up some eggs, eggs, eggs, eggs.\n\r\nScrambled eggs\r\nGood for breakfast, dinnertime or brunch\r\nDon't buy six or twleve - buy a bunch\r\nand we'll have lunch\r\non scrambled eggs.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nThis may sound crazy to most of you, but whenever Im upset all I do is put this song on and it makes me know, that better days are coming my way. Just believe in yesterday.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nI think he is living in the present, but then something jolted him into remembering about years ago which he doesn't normally think on.  In his yesterdays, there were mixed feelings, some of which he didn't even know he had!; things he didn't plan, things he didn't think about, they just happened. Paul thought he had already written the song, as though he was remembering it from the past but writing it today, so he believes in yesterday.  One minute, he's happily in love or going about his business and then something may go wrong.  He may feel that he's all messed up now, but no, he remembers all the yesterdays and so he has hope for the present and future.  He thinks he messed it up by saying or doing the wrong thing when he's not to blame.  He or someone made a choice not realizing how it affected others or may have hurt them.  He may not know how he will be or feeling, or what things might be like now or in the future had he made  different decisions.  Some people think that their past was better, and we can all think of times that we could go back to and do it better.  An \"if only\" sort of thing, a regret perhaps.  As a result, some things can help one grow/mature psychologically that otherwise wouldn't be on your mind, or that you wouldn't dream of doing again.  Or perhaps one will think something positive came of out it.  When he was young, troubles seemed far away but now he's thinking some of those things were actually troubling then (\"...there's a shadow hanging over me\"...) and he's troubled by them now.  He wants to hide from the past or the feelings of the past, or how they trouble him today, but that's not wise.  He's better to accept it as it happened and not to invent plausible reasons, speculations, conclusions or opinions why they happened just to feel better about it.  (rationalizing).  I think it's a sad song (perhaps the mistakes or missteps that were made), but at the same time, he believes in today because of what did happen.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nThis song describes emotion we all can relate. One of the best from Beatles' early years.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nNot only was Paul with Jane Asher when he wrote Yeserday, but he was introduced to classical music by her. Paul probably lifted the music from a 19 century Neopolitan classcal piece called Piccere Che Ven Dicere (Re: Yeserday Wiki) Neither Paul nor John could read music they depended on George Martin for his musical maestro knowledge and technical skills. After the Beatles break up they went back to three chord songs. Paul is on record stating they borrowed from many diverse songs and adapted sometimes outright. Golden Slumbers is another said song Paul almost recomposed verbatim. Paul went around for around two months laying down his little dream story about Yesterday, with Ham and Egg lyrics. Paul has always been a very manipulitive aggressive and talented charmer. Paul's is a passive aggresive, while John was just upfront in his aggressive lionese psuedo confidence. Poor George could not hold his own with either John or Paul.Yoko saw thru John's neurotic vulnerable needyness and he was no match for her feminine  oriental intellectual manipulation, emotional and mental castrating ways. \t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nits the song that everyone knows atleast some of the lyrics to and everyone can relate to this song somehow, \r\neg) in the original Mr Bean movie, the guy that hes staying with starts singing this song when hes walking home one night, after getting drunk at a bar with Mr Bean because hes been having problems with his wife and work etc\n\r\nmeaningful karaoke song?\n\n\n\n", "comment_101": "\nI think this song is very sad. I agree with the poster about it being about \"arriving at a state of depression,\" and longing for better days of the past. Just think about the lyrics \"All my troubles seemed so far away. Now it looks as though there here to stay.\" And \"Why she had to go, I don't know, she wouldn't say,\" could relate to losing anyone-to anything. It makes me think of losing my dad when I was 25 of alcoholism. Why he had to go, I don't know, he never did say. Why he drank himself to death, he never talked about. Of course, I suspect it was depression-even manic depression. Despite being a successful businessman and very popular and active in sports, college educated, and comfortably upper-middle class, he chose that route. I myself am 36 now, and suffer from manic depression and am in recovery from substance abuse. Despite my own successes and being \"good-looking\" according to many, my life is falling apart now. It has been for awhile. Sometimes I think of suicide. And I long for \"Yesterday.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nthis song is about how paul woke up one morning and realized how much he had changed and how life used to be so easy and simple but now he has a shadow hanging over him (like depression) and he has major love troubles cuz he just lost his girl. its my favorite song written by paul cuz any1 can relate to the \"wut have i become?\" feeling \t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\ni love this song. and not just because its the beatles... more because i have felt this exact same thing before. sad =( but true.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\n++++++++++++++++++++++ ---------------------------------======================================\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nthis is a really beautiful song, I felt in love with it!!\r\nJohn Lennon was the best singer ever!! I wish he was alive <3\r\nI love him!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nSuch a simple song, yet beautiful. It's one of the few (very few) songs I like of this band's. I need to research them and the time in history to figure out why and how they changed music (and possibly culture). I don't get it. I just don't get it.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nI long for yesterday too , but I just hope I'll never feel the same about today !\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nI love this song so much! What makes it so sad and effective is the mood and the lyrics of the song. It is definitely a break-up or relationship gone bad kind of song, but it can mean so many other things to a lot of people. One movie I always seem to visualize when I hear this song is ``Fox and the Hound''. You know the scene where Tod is abandoned and left out in the woods and has to find somewhere to call his home. That whole scene perfectly captures the feeling of this song. The lyric ``Now I need a place to hide away'', really drives home how lonely the character in the song feels. When I mean character, it could be any of us. You have to imagine yourself as the one singing the song, to really get an idea of where the artist is coming from. The violins also really add a layer of sadness and makes the song all the more melancholy. Such a beautiful song, and the way Paul sings with such sincerity and tragedy, makes the song all the more poignant.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nThis song actually sucks and is a demonstration of terrible lyricism. Notice the line \"Oh, yesterday came suddenly\". However, in the narrative being shown in the song, TODAY came suddenly and he longs for Yesterday. The Beatles just lack the intelligence to notice that, or they knew their fans wouldn't be smart enough to pick that up.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nOne must break this down logically. Y is the critical key chromosome that renders a baby Male, it's been ESTABLISHED by the genesis of this song, no ERror about this, not during the daytime. In otherwords, it's about Paul's buyers remorse at his gender swapping. Keep in mind he was wearing no shoes on the cover of Abbey Road. he saw it all coming.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\ni also agree with hy92...the lyrics are:\r\nSuddenly, thereâ\u0080\u0099s a shadow hanging over me\r\nIâ\u0080\u0099m not half the man I used to be\n\n\n", "comment_112": "\nI cant believe you fruits are arguing about the order of the lines, john lennon was a communistic idiot, paul mccartney was a brittiant songwriter, and anyone who says that this is the greatest song ever written is a moron because theres no way they've heard every song ever written, and are therefore not qualified to make such a statement\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nanyone can visit Romania except beatles fans,cuz their favorite band blows!\r\nRomanians hate the beatles (they say this band bites smelly ass!) \r\nMETAL RULES !!! HAIL REAL METAL !!!\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nThis song refers (in my opinion of course nobody actually gives there true opinions of what the song means on here and thats what the website is for)to how great your life can be going and then the next day you are miserable and depressed and you always think if you could just go back in time you could make it better.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nI can't believe it. John Lennon is still releasing songs long after his death.\r\nApparently he was working on a song but never finished it and recently someone has released a very similar song.\r\nPaul McCartney, who has parts of the original song recognised it and is trying to sue the artist that released the copied song!\r\nYoko Ono is helping but is already trying to claim rights to the song!\nyoutube.com/…\n\n\n", "comment_116": "\nWhenever i hear the first line of the song, i want to cry but at the same time i ger amd at myself.\nI loved a girl really much, but she didnt love me... We were really good friends, and she knew i liked her. But one day i got so sad and angry about she doesnt liking me, so i wrote a text about her, which made her sad... \nSo whenever i hear \"I said something wrong, now I long for yesterday\" i get that feeling of sadness and guiltyness in my heart...\n\nFrom that day on, our friendship has been different... We still are very good friend, but somewhere i feel like i destroyed a part of our friendship with that letter...\n\nYesterday my troubles seemed so far away...\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nTHANK GOD HE GAVE THE INTELLIGENT TO PAUL MCCARTNEY TO WRITE THIS PERFECT SONG EVER WRITTEN!!\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nugh. I HATE this song. It barely has any lyrics. And the few lyrics it has, are just plain dumb.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nObviously there are two versions of the song.  I'm shocked so much tension was had before the parties realized they were both wrong.\n\r\nBut more importantly...\n\r\nMatty Keating, the venerable anti-conformist, says:\n\r\n\"lennon? damn you're narrowminded. He has a dream of equality- one that fits in with the communist dream. sure, communism doesn't have a fantstic history of working, but the dream itself is far superior to the capitalist one. will you believe any crap your government feeds you if they say it often enough?\"\n\r\nI'm sorry to do this, but this positively requires an answer as it is quite possibly the most flawed argument I've ever seen.  \n\r\nFirst, he/she uses the vapid elitist buzzword \"narrow-minded\".  Anybody who initiates his or her rebuttal with vacuous antagonisms such as this loses all credibility in my book.\n\r\nSecond, everyone has a \"dream of equality\".  The distinction is manifest in the radically different terms by which people define it.  That your ilk feel this alleged characteristic sets you apart from the rest is but one example of your awe-inspiring naivete.\n\r\nThird, and most egregiously, you actually attempted to reconcile the glib idealism of Communism with the fact that it has been an abject failure everywhere it has been implemented, and with a straight face.  I can't believe it--100 million people are dead but there are still radical ideologues out there like you who could be so fundamentally dishonest with themselves that they could believe the hundredth time is a charm.  Albert Einstein once said, \"Insanity is doing the same thing over and over again and expecting a different result.\"  He calls it insanity, I call it top-to-bottom corruption.\n\r\nAs for your claim that the dream of Communism is somehow intrinsically superior to the dream of Capitalism, well... I think the record speaks for itself.  And it is an inarguable one.  What tangible way is the former superior than the latter?  I'd ask you to answer that question but I'll settle for the fact that you already know you are woefully wrong.\n\r\nAnd finally there is the implicit conspiracy that our government is comprised of reprobate propagandists--the perfect way for any leftist pseudo-intellectual to conclude a markedly wrong and profoundly incoherent rant.\n\r\nSummarily, you are wrong, and if you were any more wrong then--well, that's not possible.\t\t\t\t\n\t\t\t\t\n\n"}