{"comment_0": "\nThis is the best song on Kenny's new album.  I think it's about a forbidden love; he absolutely loves this woman but either he can't have her or she can't have him.  He goes up Mulholland drive to kick the dust in the canyon wind just like they did the night they shared together.  For a month (30 days and 30 nights) he's been trying to convince himself not to want her and he has to remind himself how bittersweet the morning after was - the bitter taste is because the night before ended.  But in the long run he knows he's hooked and one more night is what he wants although he knows it will depress him again (because he'll want her more) but at the same time it will leave him wanting another night.  \"When it comes to loving you, oh the damage I could do, it's always your favorite sins that do you in\" means he knows that if he lets himself go with her someone (his wife/family, her husband/family?) is going to get hurt but he can't stop because he can't control himself; she's a \"favorite sin.\"\n\r\nIt's a ballad about forbidden love and the struggle one has with dealing with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nIt is about loving someone who is no good for you...no better than that shot of tequila...the craving it, wanting it, even though you know you will regret it later. This woman has the same kind of power over him that the liquor does...it is intense. Obviously, there is a hint of alcohol addiction, but I think the main point it just neither the liquor nor the girl are good for him, yet he cant pass on either one of them. This is an awesome song!\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI think Geman's view is one way of looking at it, and I agree the lyrics could be interpreted that way; that essentially he's obsessed about an unrequited love.\n\r\nOn the other hand, this also seems like it could be about drug addiction.  He's kicking \"dust\" in the canyon wind after went to get \"high, high above the lights of town.\"  Then he goes on to talk about it being poison in his blood, thirty days and thirty nights (rehab?) when the addiction almost won out over his attempts to break it.  Ultimately, he says he just wants one more night (high) but knows one is one too many and one more would just kick the addiction into overdrive again.  In the end, he knows if he uses the drug again the damage is done and seemingly acknowledges he will because \"it's always your favorite sins that do you in.\"\n\n\n", "comment_3": "\nI think German and Kerik's view could be correct. I can see the song going both ways. Great song. \t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nWhy do some people think every song ever written is about drugs...???\n\r\nNot a personal shot kerik, just getting tired of reading the same thing over and over.\n\r\nI think Geman hit the nail on the head, at least it did for me.  Almost like it was written for me...\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song is actually about both unrequited love and drug/alcohol abuse. \r\nHe misses his wife or girlfriend, so he drinks. He quits drinking and tries to move on, most likely through a twelve step program.\r\nThe words \"One is one too many, and one more is never enough.\" Come from the Alcoholics Anonymous Big Book.\n\n\n", "comment_6": "\nThis is one of his best songs ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nBoth in the music video and in the lyrics there is a clear depiction of the use of alcohol, in this case tequila. There is a direct correlation between love and addiction in this song as it depicts the equal levels of damage and desparity. To think there is no intentional commentary being made about addiction is clearly either personal denial or ignorance. \"One is one to many, One more is never enough\" is a recover slogan. This song is a brillian play on words which is what makes it so fabulous. \t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nseems pretty clear to me,,, about an addiction;\n\"Thirty days and thirty nights\nBeen putting up a real good fight\nAnd there were times I thought you'd win\nIt's so easy to forget\nThe bitter taste the morning left\nSwore I wouldn't go back there again\"\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\n\"It's always your favorite sins that do you in\"  My favorite line in the song. The entire song is very real and honest. I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nWhen I saw this song live Kenny said this song is about being addicted to someone.. I can relate this to the struggle of getting out of an abuse relationship. The person is amazing and you love them so much and you see so much good in them then they flip and the are bad for you, and do horrible emotional/physical things to you. but at the same time all you can do is think of them every hour and every day and then you break and get back together with them. One is one too many but one more is never enough... All you want is one more night but that is never enough and you end up hurt and stuck in the cycle again.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI don't think this song is about just addiction or just a bad relationship alone- but rather the two together and how they play a role in the demise of a relationship.  I've dated a few guys that thought alcohol and \"just one more\" gave him power in the relationship, but it destroyed us and drove me crazy knowing it wasn't going to work out like I had originally thought.  The alcohol and the two of us together was toxic. It became an endless cycle of substance abuse and emotional abuse, and often wanted just one more night to see if things would change. Also, Hollywood (referencing Mulholland Drive) can make anyone in a relationship very vulnerable- he's talking about that atmosphere and having the opportunity to have that high right in the palm of his hand  Unfortunately, I know many people that have had very similar experiences, and he more than likely was drawn to this song because it is a very real thing that he has felt too.\t\t\t\t\n\t\t\t\t\n\n"}