{"comment_0": "\nnot necessarily \"young\" girls, IMO, but girls who are just with him for what he can give them. and even though they have no emotional investment in him, he finds himself always falling for them and coming back to them.\n\nI first heard this JUST as I was starting to get over my ex (a young girl both literally and in this song's meaning) and it just killed me. I wasn't a fan of this guy before, but now I am really very impressed by him. not only a great pop songwriter, but amazingly skilled vocalist as well.\n\nI see it as a guy who is lonely and attaches himself to girls who provide with him unhealthy and - eventually - destructive relationships. and I can only say \"been there, done that, still going to therapy over it\". the song really moved me and also opened my eyes to my own behaviour with girls.\n\nlovely piece of music =)\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nHe spends lost of money on these cute, young girls. He always ends up with a young girl, but he doesn't know why. He knows his relationships with them aren't good or going anywere, but he loves them too much to stop. In the end, he just ends up wasting money and time on them on them and making himself more miserable. Though he dreams of actually getting married and settling down with one of them, he knows that true, sacrificail love isn't found in these kind of relationships.\n\nI like this song because I'm always attracked to girls at least 3 years younger than me. But this song just keeps reminding me that if I get in a relationship with a young girl, I'll only end up hurting her and myself. Because, even if I truly love her, she's too young and isn't ready for the type of serious relationship that I want.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nTo each his/her own. It's about preference. It's about choice. And some need the high of physical beauty and youth. More power to 'em, if that's what floats their boats. We each have our preferences. I won't date men who aren't very bright, but not due to my ego; rather, I simply get bored if I am not constantly learning. I tend to like younger men because sitting around watching TV or talking about chidlren all the time is not my idea of letting lose whenever I'm not working. However, if an older guy came along (as one did last summer) who acted youthful and was what I consider wild in ways that are important to me, so be it. Again, it's about preference. Nothing wrong with being attracted to gorgeous, young females who provide an emotional high and an ego boost that obviously older females cannot. Good song. Like most of Mars' music.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\ninitially when i first listened to this song i though he said ' young white girls' and i was like WHOA getting a little racist here bruno, but then i realized he was saying young wild girls and i laughed at myself\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\neven though he has all of these \"young wild girls\" and all of the fame and fortune in the world,he still lonesome and wants a \"simple life\" also he knows that addiction to sex and other things are taking him in the wrong direction and that worries him.\n\nits a good song but meaning behind the song hard to swallow\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nTo fully comprehend the lyrics in this song, you have to understand or have experience dealing with serious addiction.  In this particular instance, Bruno has an \"addiction\" to young, pretty girls.  However, the keyword here is GIRLS (as in more than one).  He knows what's right:  one man, one woman--holy matrimony.  However, he can't seem to fight off his strong inclination to promiscuity.\n\nBruno isn't boasting.  In fact, the tone of the song is very somber.  His addictive tendencies hurt others around him as well as himself because ultimately, he realizes true love can't be found unless he changes.  It's an introspective look at why he can't seem to find happiness.  Brilliant!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nBasically, I think of this being about how he continues to get himself involved with girls who he gives and gives to, that only take from him.  He knows that he shouldn't and that it makes him miserable, but he just keeps doing it with girl after girl.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThe song is about his struggle to remain grounded while he realizes that he is constantly falling in love with young, wild squirrels.It seems like he also used be in love with birds, and that maybe they join them in the morning. I don't quite understand that part. He might not be describing a romantic love, but he cares about them nonetheless. It seems like he is getting jerked around by the squirrels he's meeting and that it's hard for him to feel at peace. It seems like he's having a great time with them, but he doesn't sound fulfilled. Maybe it's that squirrels aren't very good companions, or maybe it's just that he's still learning how to be himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nHe is talking about how he always goes after the same type of girls; ones who only care for his money and fame, and he can't help himself but keep the same relationship repeating itself with different people.\n\nI'm addicted and I don't know why\nGuess I've always been this way\n\nThe second verse I think he is saying how he wants to find a girl, fall in love and get married, like how it usually happens, but because he is famous and rich, he doesn't know if the girl is just with him because of it.\n\nOh, I still dream of simple life\nBoy meets girl, makes her his wife\nBut love don't exist\nWhen you live like this\nThat much I know, yes I know\n\nThe chorus is just saying how he keeps falling for the same type of girls, ones who only want him for fame and fortune and no matter what he does, he will still go for them.\n\nNo matter what you do (No matter what you do)\nYeah, you young wild girls\nI'll always come back to you, come back to you\n\nBeautiful song, absolutely love it so emotional and raw. This song deserves more recognition in my opinion\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nTalented artist and fun song, albeit a bit lyrically repetitious. Obvious meaning... t's about a guy (or woman?) who likes young girls.\t\t\t\t\n\t\t\t\t\n\n"}