{"comment_0": "\nAs this was written specifically for The Great Gatsby- for me, this song is representative of Daisy Buchanan. The 'Hot Summer nights, Mid July' are representative of Gatsby and Daisy's love affair when she was a maiden. 'The way you'd play with me like a child' symbolises the fickleness of their love affair, Daisy is attracted to light heartedness. The  fact she's wondering 'Will you still love me when I'm no longer young and beautiful' can highlight character vulnerability but also show us of the fickle nature of Daisy Buchannan. This song is perfectly captures the character of Daisy. The contextual factors of 'new age' show us the unpredictable nature of the novel, of the age in fact. \nThe religious conisations of 'Dear Lord, when I get to heaven please let me bring my man' are simply ironic and effective. Gatsby is indeed, a novel without God therefore the fickle treatment of higher power shows the pursuit of aesthetics as oppose to morality. \n\n\nMini essay on how Lana Del Rey's Young and Beautiful symbolises a lot of the book haha!\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI know this song is from the Great Gatbsy movie and I haven't seen it yet. But I feel like adding my interpretation from personal experience. \n\nTo me it's a beautiful and soft cry. It reminds me of longing for someone in the initial stages of a relationship, and sensing something from them, almost knowing something about them that prohibits you from believing in their love. Yet, you give in all the same without knowing. Almost convincing yourself \"I know you will (be true)\". The phrase \"young and beautiful\" is just an excuse, a fitting one, in the circumstances that shapes your limits with them as well as your hope in them. It helps you enjoy and live the moment (away from a truth you sense from them). That sentence \"until I've got nothing but my aching soul\" sums up how much hope she's investing just to love him. A cry of hope, almost to the Universe, to carry them through. She's trying to be positive for both of them because his attention brings her so much joy as if it's as genuine as it could get. It could be enough for both of them to escape into it forever. But that's the problem, they're escaping in every senese.. which is why she can't help asking till the end of the song \"will you still love me?...\" but there's no bitterness between them, as so much has been opened up and understood between that there is no room for bitterness. They understand each other. That's the blessing and problem. In her voice... you can almost here a positive hoping that the soul transcends and all will be right but at the same time that is what's sickening and draws them to the grave, each other... that sadness, lesson, betrayal. Those are the things that will make sure they will be. No other way is there a positive glimpse into the unanswerable.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song is very self explained, but she's just asking her man if he will still love here when she's no longer young and beautiful, or when she all she has is her soul. But she knows he will. Then she's asking God if when she gets to heaven, that can she bring him with her, cause she cant bare to be without him.\n\nMy favorite part is \"Oh that grace, oh that body, oh that face, makes me wanna party.\" I love that part!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis song is so underrated it is RIDICULOUS!   It captures the very essence of The Great Gatsby brilliantly. It is from the perspective of Daisy Buchanan, the character and the symbol.  Daisy is the reason for Gatsby's everything.  She's a pretentious snob; beautiful, unattainable.  What does she mean?  She IS money, wealth, success.  Poor boys can't date rich girls, so Gatsby becomes s billionaire to have her finally, but even that isn't enough.  IT IS NEVER ENOUGH!  All those shirts, the parties, the money; he will never be good enough.  Will you still love me when I'm no longer young and beautiful?  It's rhetorical...it's a siren song...he'll never know her when she's no longer young and beautiful because he'll die before he gets that chance.  Daisy only has power because he gives it to her...he makes her shine like diamonds and not the other way around...dear Lord when I get to Heaven...that is the promise of salvation she is suppose to give but of course does not...because in the end, money can't buy you those things.  Your soul is your responsibility and you can't find it in someone or something else.  Daisy is the American Dream, a facade to distract us from the real work.  She is what you think you want, young and beautiful, until she is not.  She gets old and no longer desirable...pulling the proverbial curtain up and seeing the wizard is no wizard, just a flawed and pathetic man with power only because you give it to him; like God.  \t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think most people forget certain parts of the song. Besides it being a self contained song, \"Will [he] still love [her] when [she's] no longer young and beautiful\" it has the part about the aching soul.  Love is love.  Attraction is attraction.  Two separate entities all together.  I look at me and my girlfriend.  60 years from now, will she be \"attractive\" having aged and all? Probably won't be the definition, or even remotely close, of attractive, but I will still love her. This is where the aching soul part comes in.  You have the physical attributes that make you want someone. Then you find their person, their soul to complete the rest. You fall in love.  But we all have issues, mistakes, regrets, etc.. When the beauty fades, all you still have left with you are said issues, mistakes, regrets, etc.. We all have to be realistic in the overall mating ritual that is man, we see first, then we approach and then we get to know them.  That's just he way it is. So that said, without the first thing that made them approach you, that drove them to you, all gone, and you are left with just mistakes, memories, regrets, maybe some hurting that you did to them, or hurting that they did to you, will there still be love?  Narrator, LDR, understands it so too.\"All that grace, all that body All that face, makes me wanna party\"  I do find it fascinating though that she want him to be that way into death. Maybe without those good looks, the shell that remains no longer make her want to party?\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nbel-air is a city in the los angeles county\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI like to think of this as in Daisy's perspective. We all know that good things must to an end. Daisy is stunning, young, beautiful, and rich. But I think in end, she wants someone who will love her no matter what and deep in her heart, she knows only Gatsby can grant her these things. \nShe'll loose all her wealth in the end and all that will be left is her \"aching soul\".\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song represents the reflections of Daisy Buchanan on her past, her present and future with Gatsby in a very obvious way.\n\nHowever, taken out of context, we could find other meanings to this song.\n\n\"Iâ\u0080\u0099ve seen the world\nDone it all, had my cake now.\"\nThe girl is growing up, she is getting older, gathering more experiences... She is not innocent anymore. \n\"The crazy days, the city lights\nThe way youâ\u0080\u0099d play with me like a child\"\nHe had always handled her that way, as an innocent girl. It seems then legitimate for her to wonder : \"Will you still love me when Iâ\u0080\u0099m no longer young and beautiful\"\n\"Dear lord when I get to heaven\nPlease let me bring my man\nWhen he comes tell me that youâ\u0080\u0099ll let him\nFather tell me if you can\"\nShe's fairly certain she will go to heaven, but she begs God to let him go with her. 'Young and Beautiful' or, she was just too young to begin with.\n\nLana Del Rey's song always have that 'daddy' feeling.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nLana just  made a new Fan....\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nGreat explaination sedawen... but the last part 'All that grace, all that body, All that face, makes me wanna party, He's my sun, he makes me shine like diamonds' i think its meaning is quite simple... unlike movie... \r\ndaisy did wrong certainly but gatsby did lied to her about his profession... and she lied about her only love... what if that accident wud have not happenned and daisy wud have known about tom's affair... gatsby wud have taken daisy in the end..\r\nHowever moral of the story is no matter how rich or famous u have become... in the end u will take nothing and will be alone... gatsby betrayed his parents assuming himself god's child then why he put that much faith and hope in a strange girl... god's child is always alone... forever wed was a blame game... gatsby wasnt really great... he does everything for his love abandoning those who loved him even before he was born... this is KARMA\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI love this song\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis definitely has to be from Gatsby's point of view to Daisy; as she was the rather shallow, money-obsessed of the two, I think this really speaks to Gatsby's intense idealism and insistence upon revisiting the past, while maybe having an inkling that Daisy's affections are more fleeting than they seem. The wistfulness is just spot-on for Gatsby's character.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI've seen the world, done it allâ\u0080¦ Had my cake now, Diamondsâ\u0080¦ = Daisyâ\u0080\u0099s current life with Tom\nHot summer nightsâ\u0080¦When you and I were forever wild, The crazy daysâ\u0080¦The way you'd play with me like a child = Her younger days flirting with Gatsby\nWill you still love me, When I'm no longer young and beautiful?...When I've got nothing but my aching soul?...I know you willâ\u0080¦ = Gatsby is unrelenting in his love for Daisy forever as he once said â\u0080\u009cI am forever wed to herâ\u0080¦â\u0080\u009d  while Tom cheats on her and probably will not still love her.\nI've seen the world, lit it up, As my stage now, Changeling angels in a new age now = sees the way â\u0080\u009cnew moneyâ\u0080\u009d live their lives compared to her â\u0080\u009cold moneyâ\u0080\u009d life style.\nâ\u0080¦.The way you play for me at your show, And all the ways, I got to know, Your pretty face and electric soul = Gatsby through an exotic party every night to get Daisyâ\u0080\u0099s attention. \nDear lord, when I get to heaven, Please let me bring my manâ\u0080¦ = Gatsby is living a life of crime as a bootlegger/ gangster with all the lies and stealing, he probably wouldn't go to heaven.\nAll that grace, all that body, All that face, makes me wanna party, He's my sun, he makes me shine like diamonds = How Daisy is still infatuated with him for his money and good looks, but he still is of poor blood. Gatsby uses a lot of resources to make her happy. Daisy is just using Gatsby for a fun fling because she cannot bring herself to leave Tom.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\ni cryed when i hear this  song\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI think in the song, other than the parts when she says will you still love me , she's talking about all the fun times together, almost reminding him of all they've been through and how he's changed her. When she sings, \" will you still love me when im not young or beautiful' it makes me think that maybe when they fell in love she was young and beautiful and she's thinking he won't love her anymore so she reminds him of all they've been through.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI think the constant repetition of \"I know you will\" brings out the effects quite perfectly. She is convincing herself that his love for her is eternal and stuff. Even the religious connotation of her begging to a God that he will allow him in shows that God wont allow him in. So I think this shows how she is clinging on their love that she wishes to be true, faithful and eternal when in fact, it is not.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis is one of the sexiest songs ever written.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI Loved you through it all Holly... it was always your heart and soul i adored, but shallower waters you chose :( 3\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nwanna ask whts bel-air mean?!\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI think this songs goes hand in hand with \"Gods & Monsters\" and \"Bel-Air\".\nIn \"Gods & Monsters\" she sings about being an angels in the garden of evil. Lana has always had that perspective of herself, like she's been so good that she'll actually get to heaven because she feels herself as a baby that is doing everything that she needs to reach her goals and make ends meet.\n\nShe also talks about have seen it all and done it all in \"Bel-Air\" she sings about how she only wants him and she wont cheat him no more stopping her lolita-esque lifestyle she used to have like in \"Off to the races\" I guess these songs are from a more mature point of view. (the paradise ed ones)\n\nNow that she's gotten famous, I guess she feels this way. And as for her man, like always, he is the bad \"Million dollar man\" we all have heard about but have never seen (btw ew barrie) & I know this was used for \"The Great Gatsby\" but I don't see much relevance with it, maybe they wanted it because of the nice background music idk. \"Cola\" would've been a better choice but I guess it was too controversial to even think about putting it in their movie soundtrack haha.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThis song gives me pure life. Jesus jumped off his throne and started twerking with the Holy Ghost.  \n\r\nThis song makes me want to ride down the coast smoking an unfiltered American Spirit with my blonde wig flapping through the air.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI would run through the streets of Iraq dressed as Captain America for Lana\t\t\t\t\n\t\t\t\t\n\n"}